{
  "emiten": "ABM Investama Tbk",
  "laporan_keuangan": {
    "measure": "shares",
    "identifier": "abmm_makerfin",
    "instant": "2024-12-31",
    "startDate": "2024-01-01",
    "endDate": "2024-12-31",
    "explicitMember": "idx-cor:OtherCurrencyMember",
    "ConversionRateAtReportingDateIfPresentationCurrencyIsOtherThanRupiah": "16588.00000",
    "EntityName": "ABM Investama Tbk",
    "EntityCode": "ABMM",
    "EntityIdentificationNumber": "AA600",
    "EntityMainIndustry": "Umum / General",
    "SelectedAccountingStandards": "PSAK",
    "Sector": "A. Energy",
    "Subsector": "A1. Oil, Gas & Coal",
    "Industry": "A12. Coal",
    "Subindustry": "A121. Coal Production",
    "ControllingShareholderInformation": "National Corporation",
    "TypeOfEntity": "Local Company - Indonesia Jurisdiction",
    "TypeOfListedSecurities": "Saham / Stock",
    "TypeOfBoardOnWhichTheEntityIsListed": "Utama / Main",
    "WhetherTheFinancialStatementsAreOfAnIndividualEntityOrAGroupOfEntities": "Entitas grup / Group entity",
    "PeriodOfFinancialStatementsSubmissions": "Kuartal I / First Quarter",
    "DateOfBoardOfDirectorsStatementLetter": "2025-04-28",
    "CurrentPeriodStartDate": "2025-01-01",
    "CurrentPeriodEndDate": "2025-03-31",
    "PriorYearEndDate": "2024-12-31",
    "PriorPeriodStartDate": "2024-01-01",
    "PriorPeriodEndDate": "2024-03-31",
    "Prior2YearEndDate": "2023-12-31",
    "DescriptionOfPresentationCurrency": "Dollar Amerika / USD",
    "LevelOfRoundingUsedInFinancialStatements": "Satuan Penuh / Full Amount",
    "TypeOfReportOnFinancialStatements": "Tidak Diaudit / Unaudit",
    "WhetherInComplianceWithBAPEPAMLKVIIIG11RulesConcerningResponsibilitiesOfBoardOfDirectorsOnFinancialStatements": "Ya / Yes",
    "WhetherInComplianceWithBAPEPAMLKVIIIATwoRulesConcerningIndependenceOfAccountantProvidingAuditServicesInCapitalMarket": "Ya / Yes",
    "CashAndCashEquivalents": "170318176",
    "CurrentRestrictedFunds": "5846",
    "TradeReceivablesThirdParties": "129624758",
    "TradeReceivablesRelatedParties": "146150268",
    "OtherReceivablesThirdParties": "6331060",
    "OtherReceivablesRelatedParties": "958867",
    "CurrentInventories": "60634153",
    "CurrentPrepaidExpenses": "4801091",
    "OtherCurrentAdvances": "9962319",
    "CurrentPrepaidTaxes": "2467584",
    "OtherCurrentNonFinancialAssets": "2783186",
    "NonCurrentAssetsOrDisposalGroupsClassifiedAsHeldForSale": "410162",
    "CurrentAssets": "534447470",
    "InvestmentsInAssociates": "593417349",
    "DeferredTaxAssets": "7336052",
    "PropertyPlantAndEquipment": "725355336",
    "RightOfUseAssets": "119755436",
    "MiningProperties": "27924221",
    "NonCurrentClaimsForTaxRefund": "67562963",
    "IntangibleAssetsOtherThanGoodwill": "15030037",
    "OtherNonCurrentNonFinancialAssets": "33544636",
    "NonCurrentAssets": "1561004132",
    "Assets": "2095451602",
    "ShortTermBankLoans": "40774657",
    "TradePayablesThirdParties": "97322735",
    "TradePayablesRelatedParties": "75704427",
    "OtherPayablesThirdParties": "3216065",
    "OtherPayablesRelatedParties": "1039966",
    "CurrentAdvancesFromCustomersThirdParties": "3995529",
    "CurrentAdvancesFromCustomersRelatedParties": "570764",
    "CurrentAccruedExpenses": "33900691",
    "ShortTermPostEmploymentBenefitObligations": "7125122",
    "TaxesPayable": "3660943",
    "CurrentMaturitiesOfBankLoans": "129446658",
    "CurrentMaturitiesOfFinanceLeaseLiabilities": "34705771",
    "CurrentMaturitiesOfOtherBorrowings": "3010792",
    "CurrentLiabilities": "500895664",
    "DeferredTaxLiabilities": "14911235",
    "LongTermBankLoans": "646558694",
    "LongTermFinanceLeaseLiabilities": "40369736",
    "LongTermBondsPayable": "0",
    "LongTermOtherBorrowings": "15041637",
    "NonCurrentProvisionsForRestorationAndRehabilitation": "3919647",
    "LongTermPostEmploymentBenefitObligations": "26500093",
    "NonCurrentLiabilities": "747301042",
    "Liabilities": "1248196706",
    "CommonStocks": "146554908",
    "AdditionalPaidInCapital": "123417237",
    "OtherComponentsOfEquity": "19855",
    "AppropriatedRetainedEarnings": "810278",
    "UnappropriatedRetainedEarnings": "570601450",
    "EquityAttributableToEquityOwnersOfParentEntity": "841403728",
    "NonControllingInterests": "5851168",
    "Equity": "847254896",
    "LiabilitiesAndEquity": "2095451602",
    "SalesAndRevenue": "14749406",
    "CostOfSalesAndRevenue": "236923822",
    "GrossProfit": "33780128",
    "SellingExpenses": "562171",
    "GeneralAndAdministrativeExpenses": "12713222",
    "FinanceIncome": "1674327",
    "DividendsIncome": "0",
    "InvestmentIncome": "55843416",
    "InterestAndFinanceCosts": "28645338",
    "OtherIncome": "6704853",
    "OtherExpenses": "3540045",
    "ProfitLossBeforeIncomeTax": "52541948",
    "TaxBenefitExpenses": "-1941201",
    "ProfitLossFromContinuingOperations": "50600747",
    "ProfitLoss": "50600747",
    "OtherAdjustmentsToOtherComprehensiveIncomeThatWillNotBeReclassifiedToProfitOrLossAfterTax": "412939",
    "OtherComprehensiveIncomeThatWillNotBeReclassifiedToProfitOrLossAfterTax": "412939",
    "GainsLossesOnExchangeDifferencesOnTranslationAfterTax": "-306343",
    "ShareOfOtherComprehensiveIncomeOfAssociatesAccountedForUsingEquityMethodAfterTax": "0",
    "OtherComprehensiveIncomeThatMayBeReclassifiedToProfitOrLossAfterTax": "-306343",
    "OtherComprehensiveIncomeAfterTax": "106596",
    "ComprehensiveIncome": "50707343",
    "ProfitLossAttributableToParentEntity": "50604802",
    "ProfitLossAttributableToNonControllingInterests": "-4055",
    "ComprehensiveIncomeAttributableToParentEntity": "50711398",
    "ComprehensiveIncomeAttributableToNonControllingInterests": "-4055",
    "BasicEarningsLossPerShareFromContinuingOperations": "0.01838",
    "BalanceBeforeRestatementAtBeginningOfPeriod": "758926967",
    "EquityPositionBeginningOfThePeriod": "758926967",
    "ProfitLossChangesInEquity": "50600747",
    "OtherComprehensiveIncome": "106596",
    "EquityPositionEndOfThePeriod": "809634310",
    "ReceiptsFromCustomers": "320009935",
    "PaymentsToSuppliersForGoodsAndServices": "173899192",
    "PaymentsForSalariesAndAllowances": "50312383",
    "CashGeneratedFromUsedInOperations": "95798360",
    "InterestsReceivedFromOperatingActivities": "1674327",
    "IncomeTaxesRefundedPaidFromOperatingActivities": "-3966677",
    "NetCashFlowsReceivedFromUsedInOperatingActivities": "93506010",
    "PaymentsForAdvancesForPurchaseOfPropertyPlantAndEquipment": "0",
    "ProceedsFromDisposalOfPropertyPlantAndEquipment": "11066527",
    "PaymentsForAcquisitionOfPropertyPlantAndEquipment": "118635636",
    "PaymentsForAcquisitionOfMiningProperties": "0",
    "PaymentsForAcquisitionOfIntangibleAssets": "848935",
    "NetCashFlowsReceivedFromUsedInInvestingActivities": "-108418044",
    "ProceedsFromBankLoans": "111265997",
    "PaymentsOfBankLoans": "66369565",
    "PaymentsOfFinanceLeaseLiabilities": "15986831",
    "InterestsPaidFromFinancingActivities": "30249379",
    "OtherCashInflowsOutflowsFromFinancingActivities": "0",
    "NetCashFlowsReceivedFromUsedInFinancingActivities": "-1339778",
    "NetIncreaseDecreaseInCashAndCashEquivalents": "-16251812",
    "CashAndCashEquivalentsCashFlows": "169724068",
    "EffectOfExchangeRateChangesOnCashAndCashEquivalents": "-2601096",
    "BasisOfPreparationOfConsolidatedFinancialStatementsTextBlock": "Laporan keuangan konsolidasian interim telah disusun sesuai dengan Standar Akuntansi Keuangan di Indonesia, yang mencakup Pernyataan dan Interpretasi yang dikeluarkan oleh Dewan Standar Akuntansi Keuangan Ikatan Akuntan Indonesia (IAI) dan Peraturan-Peraturan serta Pedoman Penyajian dan Pengungkapan Laporan Keuangan yang diterbitkan oleh Otoritas Jasa Keuangan.",
    "PrinciplesOfConsolidationTextBlock": "Laporan keuangan konsolidasian interim meliputi laporan keuangan Perusahaan dan entitas-entitas anak. Kendali diperoleh bila Grup terekspos atau memiliki hak atas imbal hasil variabel dari keterlibatannya dengan investee dan memiliki kemampuan untuk mempengaruhi imbal hasil tersebut melalui kekuasaannya atas investee. Dengan demikian, investor mengendalikan investee jika dan hanya jika investor memiliki seluruh hal berikut ini: (a) kekuasaan atas investee, yaitu hak yang ada saat ini yang memberi investor kemampuan kini untuk mengarahkan aktivitas relevan dari investee; (b) eksposur, atau hak, atas imbal hasil variabel dari keterlibatannya dengan investee; (c) kemampuan untuk menggunakan kekuasaannya atas investee untuk mempengaruhi jumlah imbal hasil.",
    "CashAndCashEquivalentsTextBlock": "Kas dan setara kas merupakan akun-akun kas yang tidak dibatasi penggunaannya. Kas dan setara kas dalam laporan posisi keuangan konsolidasian interim yang terdiri dari kas dan bank serta deposito jangka pendek yang jatuh tempo dalam waktu 3 (tiga) bulan atau kurang, yang dapat segera dikonversikan menjadi kas dalam jumlah yang dapat ditentukan dan memiliki risiko perubahan nilai yang tidak signifikan.",
    "TradeAndOtherReceivablesTextBlock": "Piutang merupakan hak Grup atas sejumlah imbalan yang tidak bersyarat (yaitu, hanya berlalunya waktu yang diperlukan sebelum pembayaran imbalan jatuh tempo). Pada pengakuan awal, Grup mengukur aset keuangan pada nilai wajarnya ditambah biaya transaksi, dalam hal aset keuangan tidak diukur pada nilai wajar melalui laba rugi. Piutang usaha yang tidak mengandung komponen pembiayaan yang signifikan, dimana Grup telah menerapkan cara praktis, yaitu diukur pada harga transaksi yang ditentukan sesuai PSAK 115.",
    "InventoriesTextBlock": "Persediaan dinyatakan sebesar nilai yang lebih rendah antara biaya perolehan atau nilai realisasi neto. Biaya perolehan ditentukan dengan menggunakan metode rata-rata tertimbang. Nilai realisasi neto persediaan adalah estimasi harga jual dalam kegiatan usaha biasa dikurangi estimasi biaya penyelesaian dan estimasi biaya yang diperlukan untuk membuat penjualan.",
    "FixedAssetsTextBlock": "Aset tetap dinyatakan sebesar biaya perolehan dikurangi akumulasi penyusutan (kecuali tanah yang tidak disusutkan) dan rugi penurunan nilai, jika ada. Biaya perolehan termasuk biaya penggantian bagian aset tetap saat biaya tersebut terjadi, jika memenuhi kriteria pengakuan. Selanjutnya, pada saat inspeksi yang signifikan dilakukan, biaya inspeksi itu diakui ke dalam nilai tercatat aset tetap sebagai suatu penggantian jika memenuhi kriteria pengakuan.",
    "ImpairmentOfNon-FinancialAssetsTextBlock": "Pada setiap tanggal pelaporan, Grup menilai apakah terdapat indikasi suatu aset mengalami penurunan nilai. Jika terdapat indikasi tersebut atau pada saat pengujian penurunan nilai aset (yaitu aset takberwujud dengan umur manfaat tidak terbatas, aset takberwujud yang belum dapat digunakan, atau goodwill yang diperoleh dalam suatu kombinasi bisnis) diperlukan, maka Grup membuat estimasi formal jumlah terpulihkan aset tersebut.",
    "TradePayablesAndOtherLiabilitiesTextBlock": "Liabilitas untuk utang usaha dan utang lain-lain jangka pendek, biaya masih harus dibayar dan liabilitas imbalan kerja jangka pendek dinyatakan sebesar jumlah tercatat (jumlah nosional), yang kurang lebih sebesar nilai wajarnya.",
    "RevenueAndExpenseRecognitionTextBlock": "Grup menerapkan PSAK 115,  dari Kontrak dengan Pelanggan yang mensyaratkan pengakuan pendapatan untuk memenuhi 5 (lima) langkah analisis. Beban diakui pada saat terjadinya (asas akrual).",
    "ForeignCurrencyTranslationTextBlock": "Mata uang pelaporan yang digunakan pada laporan keuangan konsolidasian interim adalah Dolar Amerika Serikat ($), yang juga merupakan mata uang fungsional setiap entitas dalam Grup, kecuali entitas anak tertentu. Tiap entitas dalam Grup menentukan mata uang fungsionalnya masing-masing dan laporan keuangannya masing-masing diukur menggunakan mata uang fungsional tersebut. Untuk tujuan konsolidasi, aset dan liabilitas dari entitas anak tertentu yang dicatat dalam Rupiah sebagai mata uang fungsionalnya, dijabarkan ke AS$ dengan menggunakan kurs tukar yang berlaku pada tanggal laporan posisi keuangan. Akun-akun pendapatan dan biaya dijabarkan dengan menggunakan kurs tukar rata-rata periode tersebut. Selisih kurs yang terjadi disajikan sebagai bagian dari penghasilan komprehensif lain. Transaksi dalam mata uang selain AS$ dicatat ke dalam mata uang AS$ berdasarkan kurs yang berlaku pada saat transaksi dilakukan. Pada tanggal pelaporan, aset dan liabilitas moneter dalam mata uang selain AS$ disesuaikan ke dalam AS$ menggunakan kurs tengah Bank Indonesia pada tanggal tersebut. Jika ada keuntungan atau kerugian akan dikreditkan atau dibebankan di tahun berjalan.",
    "TransactionsWithRelatedPartiesTextBlock": "Perusahaan dan entitas anaknya melakukan transaksi dengan pihak berelasi sesuai dengan definisi yang diuraikan pada PSAK 224. Transaksi ini dilakukan berdasarkan persyaratan yang disetujui oleh kedua belah pihak, yang mungkin tidak sama dengan transaksi lain yang dilakukan dengan pihak-pihak yang tidak berelasi.",
    "IncomeTaxesTextBlock": "Peraturan perpajakan di Indonesia mengatur beberapa jenis penghasilan dikenakan pajak yang bersifat final. Pajak final yang dikenakan atas nilai bruto transaksi tetap dikenakan walaupun atas transaksi tersebut pelaku transaksi mengalami kerugian. Grup mengakui liabilitas atas pajak penghasilan badan berdasarkan estimasi apakah akan terdapat tambahan pajak penghasilan badan.",
    "BorrowingsTextBlock": "Semua liabilitas keuangan diakui pada nilai wajar saat pengakuan awal dan, dalam hal liabilitas keuangan dilklasifikasi sebagai utang dan pinjaman, diakui pada nilai wajar setelah dikurangi biaya transaksi yang dapat diatribusikan secara langsung.",
    "ProvisionsTextBlock": "Provisi diakui jika Grup memiliki kewajiban kini (baik bersifat hukum maupun bersifat konstruktif) jika, sebagai akibat peristiwa masa lalu, besar kemungkinan penyelesaian kewajiban tersebut mengakibatkan arus keluar sumber daya yang mengandung manfaat ekonomi dan estimasi yang andal mengenai jumlah kewajiban tersebut dapat dibuat.",
    "EmployeeBenefitsTextBlock": "Perusahaan dan entitas-entitas anak tertentu, mempunyai program dana pensiun iuran pasti untuk seluruh karyawan tetap yang memenuhi syarat. Grup juga mencatat penyisihan manfaat tambahan selain program dana pensiun tersebut di atas untuk memenuhi dan menutup imbalan minimum yang harus dibayar kepada karyawan-karyawan sesuai dengan Peraturan Perusahaan, Perjanjian Kerja Bersama dan Undang-Undang No. 6/2023 Penetapan Peraturan Pemerintah Pengganti Undang-Undang Nomor 2 Tahun 2022 tentang Cipta Kerja menjadi Undang-Undang ( Cipta Kerja (UUCK)). Penyisihan tambahan tersebut diestimasi dengan menggunakan perhitungan aktuarial metode  Unit Credit. Grup juga memberikan imbalan kerja jangka panjang selain pensiun berupa jubilee yang tidak didanai.",
    "EarningsPerShareTextBlock": "Laba per saham dihitung berdasarkan rata-rata tertimbang jumlah saham yang beredar selama periode yang bersangkutan. Laba per saham dihitung dengan membagi laba periode berjalan yang dapat diatribusikan kepada pemilik entitas induk dengan jumlah rata-rata tertimbang saham yang beredar selama periode berjalan, yaitu 2.753.165.000 saham.",
    "DividendsTextBlock": "Dividen diakui sebagai penghasilan lain-lain dalam laba rugi pada saat hak atas pembayaran telah ditetapkan.",
    "SegmentReportingTextBlock": "Segmen adalah komponen yang dapat dibedakan dari Grup yang terlibat baik dalam menyediakan produk-produk tertentu (segmen usaha), atau dalam menyediakan produk dalam lingkungan ekonomi tertentu (segmen geografis), yang memiliki risiko dan imbalan yang berbeda dari segmen lainnya.",
    "DerivativeFinancialInstrumentsTextBlock": "Derivatif melekat dalam kontrak hibrida, dengan liabilitas keuangan atau kontrak utama non-keuangan, dipisahkan dari kontrak utamanya dan dicatat sebagai derivatif terpisah jika: karakteristik ekonomi dan risiko tidak berkaitan erat dengan kontrak utamanya; instrumen terpisah dengan persyaratan yang sama dengan derivatif melekat akan memenuhi definisi derivatif; dan kontrak hibrida ini tidak diukur pada NWLR. Derivatif melekat diukur pada nilai wajar dengan perubahan nilai wajar diakui dalam laba rugi. Penilaian ulang hanya terjadi jika terdapat perubahan baik dalam persyaratan kontrak yang secara signifikan mengubah arus kas yang sebaliknya akan diperlukan, atau reklasifikasi aset keuangan diluar dari kategori NWLR.",
    "TheImplementationOfNewStatementsOfAccountingStandardsTextBlock": "Grup menerapkan pertama kali standar yang direvisi yang berlaku efektif untuk periode yang dimulai pada atau setelah 1 Januari 2024, termasuk standar yang direvisi berikut ini yang memengaruhi laporan keuangan konsolidasian interim Grup: Amendemen PSAK 201: Penyajian Laporan Keuangan - Liabilitas Jangka Panjang dengan Kovenan dimana Amendemen ini tidak memiliki dampak terhadap laporan keuangan konsolidasian interim Grup.; Amendemen PSAK 116: Sewa - Liabilitas Sewa dalam Jual Beli dan Sewa-balik dimana Amendemen ini tidak memiliki dampak terhadap laporan keuangan konsolidasian interim Grup.; Amendemen PSAK 207 dan PSAK 107: Pengaturan Pembiayaan Pemasok dimana Amendemen ini tidak memiliki dampak terhadap laporan keuangan konsolidasian interim Grup.",
    "BusinessCombinationTextBlock": "Kombinasi bisnis dicatat dengan menggunakan metode akuisisi. Biaya perolehan dari sebuah akuisisi diukur pada nilai agregat imbalan yang dialihkan, diukur pada nilai wajar pada tanggal akuisisi dan jumlah setiap KNP pada pihak yang diakuisisi. Untuk setiap kombinasi bisnis, Grup memilih apakah mengukur KNP pada entitas yang diakuisisi baik pada nilai wajar ataupun pada proporsi kepemilikan KNP atas aset neto yang teridentifikasi dari entitas yang diakuisisi. Biaya-biaya akuisisi yang timbul dibebankan langsung dan disertakan dalam beban administrasi.",
    "DeterminationOfFairValueTextBlock": "Nilai wajar adalah harga yang akan diterima dari menjual suatu aset atau harga yang akan dibayar untuk mengalihkan suatu liabilitas dalam transaksi teratur antara pelaku pasar pada tanggal pengukuran. Pengukuran nilai wajar mengasumsikan bahwa transaksi untuk menjual aset atau mengalihkan liabilitas terjadi: (i) Di pasar utama untuk aset atau liabilitas tersebut, atau; (ii) Jika tidak terdapat pasar utama, di pasar yang paling menguntungkan untuk aset atau liabilitas tersebut.",
    "ForeignCurrencyTransactionsAndBalancesTextBlock": "Mata uang pelaporan yang digunakan pada laporan keuangan konsolidasian interim adalah Dolar Amerika Serikat ($), yang juga merupakan mata uang fungsional setiap entitas dalam Grup, kecuali entitas anak tertentu. Tiap entitas dalam Grup menentukan mata uang fungsionalnya masing-masing dan laporan keuangannya masing-masing diukur menggunakan mata uang fungsional tersebut. Untuk tujuan konsolidasi, aset dan liabilitas dari entitas anak tertentu yang dicatat dalam Rupiah sebagai mata uang fungsionalnya, dijabarkan ke AS$ dengan menggunakan kurs tukar yang berlaku pada tanggal laporan posisi keuangan. Akun-akun pendapatan dan biaya dijabarkan dengan menggunakan kurs tukar rata-rata periode tersebut. Selisih kurs yang terjadi disajikan sebagai bagian dari penghasilan komprehensif lain. Transaksi dalam mata uang selain AS$ dicatat ke dalam mata uang AS$ berdasarkan kurs yang berlaku pada saat transaksi dilakukan. Pada tanggal pelaporan, aset dan liabilitas moneter dalam mata uang selain AS$ disesuaikan ke dalam AS$ menggunakan kurs tengah Bank Indonesia pada tanggal tersebut. Jika ada keuntungan atau kerugian akan dikreditkan atau dibebankan di tahun berjalan.",
    "PlacementsWithBankIndonesiaAndOtherBanksTextBlock": "Aset keuangan lancar lainnya terdiri dari salah satunya deposito berjangka dengan jangka waktu lebih dari 3 (tiga) bulan tetapi tidak lebih dari 1 (satu) tahun sejak tanggal penempatan.",
    "RightOfUseAssetsTextBlock": "Grup mengakui aset hak-guna pada tanggal permulaan sewa (yaitu tanggal aset pendasar tersedia untuk digunakan). Aset hak-guna diukur pada harga perolehan, dikurangi akumulasi penyusutan dan penurunan nilai, serta disesuaikan dengan pengukuran kembali liabilitas sewa. Biaya perolehan aset hak-guna mencakup jumlah liabilitas sewa yang diakui, biaya langsung awal yang terjadi, dan pembayaran sewa yang dilakukan pada atau sebelum tanggal permulaan dikurangi setiap insentif sewa yang diterima. Aset hak-guna disusutkan dengan metode garis lurus selama masa sewa.",
    "InvestmentPropertiesTextBlock": "Properti pertambangan merupakan penyesuaian nilai wajar properti pertambangan yang diperoleh pada tanggal akuisisi dan dinyatakan sebesar harga perolehan. Properti pertambangan diamortisasi selama umur manfaat properti dengan menggunakan metode  produksi sejak tanggal akuisisi berdasarkan basis estimasi cadangan. Umur manfaat properti pertambangan yang timbul dari hak kontraktual tidak lebih lama dari masa hak kontraktual tersebut, kecuali jika hak kontraktual dapat diperbarui dengan tidak menimbulkan biaya yang signifikan. Perubahan dalam estimasi cadangan dilakukan secara prospektif, dimulai sejak awal periode terjadinya perubahan.",
    "GoodwillTextBlock": "Aset takberwujud diperoleh dari kombinasi bisnis dan diakui terpisah dari goodwill dicatat sebesar nilai wajar pada tanggal akuisisi. Goodwill yang terkait dengan entitas asosiasi termasuk dalam jumlah tercatat investasi dan tidak diamortisasi maupun diuji secara individual untuk penurunan nilai.",
    "InvestmentInAssociatesTextBlock": "Investasi Grup pada entitas asosiasi dicatat dengan menggunakan metode ekuitas. Dalam metode ekuitas, investasi awalnya diakui pada harga perolehan. Nilai tercatat investasi disesuaikan untuk mengakui perubahan bagian Grup atas aset neto entitas asosiasi sejak tanggal perolehan. Goodwill yang terkait dengan entitas asosiasi termasuk dalam jumlah tercatat investasi dan tidak diamortisasi maupun diuji secara individual untuk penurunan nilai.",
    "IntangibleAssetsTextBlock": "Aset takberwujud yang diperoleh secara terpisah diukur pada pengakuan awal sebesar biaya perolehan. Biaya perolehan aset takberwujud yang diperoleh dalam suatu kombinasi bisnis adalah nilai wajarnya pada tanggal akuisisi. Setelah pengakuan awal, aset takberwujud dicatat sebesar biaya perolehan dikurangi akumulasi amortisasi dan akumulasi kerugian penurunan nilai. Aset takberwujud yang dihasilkan secara internal, tidak termasuk biaya pengembangan yang dikapitalisasi, tidak dikapitalisasi dan pengeluaran terkait tercermin dalam laba rugi pada periode ketika pengeluaran terjadi. Masa manfaat aset takberwujud dinilai baik terbatas atau tidak terbatas.",
    "PrepaidExpensesTextBlock": "Biaya dibayar di muka diamortisasi dan dibebankan pada operasi selama masa manfaatnya, dan disajikan sebagai aset lancar atau aset tidak lancar sesuai sifatnya masing-masing.",
    "ExplorationAndEvaluationAssetsTextBlock": "Pengeluaran untuk eksplorasi dan evaluasi dikapitalisasi dan diakui sebagai  eksplorasi dan evaluasi untuk setiap daerah pengembangan (area of interest) apabila izin pertambangan telah diperoleh dan masih berlaku dan: (i) biaya tersebut diharapkan dapat diperoleh kembali melalui keberhasilan pengembangan dan eksploitasi daerah pengembangan, atau (ii) apabila kegiatan tersebut belum mencapai tahap yang memungkinkan untuk menentukan adanya cadangan terbukti yang secara ekonomis dapat diperoleh, serta kegiatan yang aktif dan signifikan, dalam daerah pengembangan terkait masih berlangsung.",
    "ShareCapitalTextBlock": "Modal Grup terdiri dari modal saham dan saldo laba. Grup mengelola struktur permodalan dan melakukan penyesuaian terhadap perubahan kondisi ekonomi dan memenuhi persyaratan dari pihak pemberi pinjaman.",
    "StockIssuanceCostTextBlock": "Biaya emisi saham disajikan sebagai pengurang terhadap  Modal Disetor - Neto pada bagian ekuitas di laporan posisi keuangan konsolidasian interim. Biaya emisi obligasi dan sukuk ijarah dikurangkan dari hasil penerbitan obligasi dalam laporan posisi keuangan konsolidasian interim sebagai diskonto dan diamortisasi menggunakan metode SBE selama jangka waktu obligasi dan sukuk ijarah. Biaya emisi obligasi wajib tukar dicatat sebagai pengurang modal.",
    "FinancialInstrumentsTextBlock": "Instrumen keuangan adalah setiap kontrak yang menambah nilai aset keuangan bagi satu entitas dan liabilitas keuangan atau ekuitas bagi entitas lain.",
    "NoncurrentAssetsClassifiedAsHeldForSaleTextBlock": "Aset tidak lancar diklasifikasikan sebagai dimiliki untuk dijual jika nilai tercatatnya akan terpulihkan terutama melalui transaksi penjualan daripada melalui pemakaian berlanjut. Aset tidak lancar yang diklasifikasikan sebagai dimiliki untuk dijual diukur pada nilai yang lebih rendah antara nilai tercatat dan nilai wajar setelah dikurangi biaya untuk menjual. Dalam hal ini, aset harus berada dalam keadaan dapat dijual dengan syarat-syarat yang biasa dan umum untuk penjualan aset tersebut dan penjualannya harus sangat mungkin terjadi.",
    "EventsAfterReportingPeriodTextBlock": "Peristiwa setelah akhir periode yang memberikan tambahan informasi mengenai posisi keuangan Grup pada tanggal pelaporan (peristiwa penyesuai), jika ada, dicerminkan dalam laporan keuangan konsolidasian interim. Peristiwa setelah akhir periode yang bukan peristiwa penyesuaian diungkapkan dalam Catatan atas laporan keuangan konsolidasian interim, jika material.",
    "AdoptionOfNewAccountingStandardsTextBlock": "Grup menerapkan pertama kali standar yang direvisi yang berlaku efektif untuk periode yang dimulai pada atau setelah 1 Januari 2024, termasuk standar yang direvisi berikut ini yang memengaruhi laporan keuangan konsolidasian interim Grup: Amendemen PSAK 201: Penyajian Laporan Keuangan - Liabilitas Jangka Panjang dengan Kovenan dimana Amendemen ini tidak memiliki dampak terhadap laporan keuangan konsolidasian interim Grup.; Amendemen PSAK 116: Sewa - Liabilitas Sewa dalam Jual Beli dan Sewa-balik dimana Amendemen ini tidak memiliki dampak terhadap laporan keuangan konsolidasian interim Grup.; Amendemen PSAK 207 dan PSAK 107: Pengaturan Pembiayaan Pemasok dimana Amendemen ini tidak memiliki dampak terhadap laporan keuangan konsolidasian interim Grup.",
    "AccountingStandardsIssuedButNotYetEffectiveTextBlock": "Standar akuntansi yang telah diterbitkan sampai tanggal penerbitan laporan keuangan konsolidasian interim Grup namun belum berlaku efektif diungkapkan berikut ini. Manajemen bermaksud untuk menerapkan standar tersebut yang dipertimbangkan relevan terhadap Grup pada saat efektif, dan pengaruhnya terhadap posisi dan kinerja keuangan konsolidasian interim Grup masih diestimasi pada tanggal 26 September 2024: PSAK 117: Kontrak Asuransi dan Amendemen PSAK 221: Pengaruh Perubahan Kurs Valuta Asing - kekurangan ketertukaran.",
    "AdditionInPropertyPlantAndEquipment": "147023690",
    "TranslationAdjustmentPropertyPlantandEquipment": "-6021865",
    "DisposalsInPropertyPlantAndEquipment": "100623308",
    "ReclassificationsOfPropertyPlantAndEquipment": "0",
    "DisclosureofNotesforPropertyPlantandEquipmentTextBlock": "Aset tetap dinyatakan sebesar biaya perolehan dikurangi akumulasi penyusutan (kecuali tanah yang tidak disusutkan) dan rugi penurunan nilai, jika ada. Biaya perolehan termasuk biaya penggantian bagian aset tetap saat biaya tersebut terjadi, jika memenuhi kriteria pengakuan. Selanjutnya, pada saat inspeksi yang signifikan dilakukan, biaya inspeksi itu diakui ke dalam nilai tercatat aset tetap sebagai suatu penggantian jika memenuhi kriteria pengakuan.",
    "DisposalsInRightofUseAssets": "17069218",
    "TranslationAdjustmentRightofUseAssets": "-1862582",
    "AdditionInRightofUseAssets": "47937598",
    "PartyName": "PT Binuang Mitra Bersama Blok Dua",
    "ServiceOrProductName": "Tambang batubara",
    "SalesAndRevenueMoreThan10Percent": "145641041",
    "TradeReceivablesGross": "146644311",
    "AllowanceForImpairmentOfTradeReceivables": "9692036",
    "TradeReceivablesNet": "146150268",
    "CounterpartyName": "Lainnya",
    "AdditionOfAllowanceForImpairmentOfTradeReceivables": "954758",
    "ReductionOfMovementOfAllowanceForImpairmentOfTradeReceivables": "1832276",
    "WrittenOffOfMovementOfAllowanceForImpairmentOfTradeReceivables": "6459951",
    "WorkInProcess": "11587242",
    "RawAndIndirectMaterial": "17506574",
    "Spareparts": "23224750",
    "Coal": "11544791",
    "OtherInventories": "934632",
    "InventoriesGross": "64797989",
    "AllowanceForImpairmentOfInventories": "3227836",
    "Inventories": "60634153",
    "IncreaseDecreaseforAllowanceForImpairmentOfInventory": "936000",
    "DisclosureofNotesforInventoriesTextBlock": "Persediaan dinyatakan sebesar nilai yang lebih rendah antara biaya perolehan atau nilai realisasi neto. Biaya perolehan ditentukan dengan menggunakan metode rata-rata tertimbang. Nilai realisasi neto persediaan adalah estimasi harga jual dalam kegiatan usaha biasa dikurangi estimasi biaya penyelesaian dan estimasi biaya yang diperlukan untuk membuat penjualan.",
    "TradePayables": "75704427",
    "CounterpartyNameTradePayable": "Lainnya",
    "OtherCostOfGoodSold": "236923822",
    "DisclosureofNotesforCostofGoodsSoldTextBlock": "Rincian beban pokok pendapatan yang dapat diatribusikan ke setiap lini bisnis setelah eliminasi.",
    "BankLoanAmountInForeignCurrency": "26889388",
    "BankLoans": "776005352",
    "DisclosureofNotesforLongTermBankLoansTextBlock": "Grup menetapkan liabilitas keuangannya sebagai utang bank jangka pendek, utang usaha, utang lain-lain, beban akrual, liabilitas imbalan kerja jangka pendek, utang obligasi dan utang bank jangka panjang.",
    "DisclosureofNotesforShortTermBankLoansTextBlock": "Grup menetapkan liabilitas keuangannya sebagai utang bank jangka pendek, utang usaha, utang lain-lain, beban akrual, liabilitas imbalan kerja jangka pendek, utang obligasi dan utang bank jangka panjang.",
    "ShortTermBankLoanAmountInForeignCurrency": "40774657"
  }
}