{
  "emiten": "PT Adhi Commuter Properti Tbk",
  "laporan_keuangan": {
    "measure": "shares",
    "identifier": "adcp_maker",
    "instant": "2024-12-31",
    "startDate": "2024-01-01",
    "endDate": "2024-12-31",
    "explicitMember": "idx-cor:OtherCurrencyMember",
    "EntityName": "PT Adhi Commuter Properti Tbk",
    "EntityCode": "ADCP",
    "EntityIdentificationNumber": "AB032",
    "EntityMainIndustry": "Properti / Property",
    "SelectedAccountingStandards": "PSAK",
    "Sector": "H. Properties & Real Estate",
    "Subsector": "H1. Properties & Real Estate",
    "Industry": "H11. Real Estate Management & Development",
    "Subindustry": "H111. Real Estate Development & Management",
    "ControllingShareholderInformation": "National Corporation",
    "TypeOfEntity": "Local Company - Indonesia Jurisdiction",
    "TypeOfListedSecurities": "Saham dan Obligasi / Stock and Bond",
    "TypeOfBoardOnWhichTheEntityIsListed": "Pengembangan / Development",
    "WhetherTheFinancialStatementsAreOfAnIndividualEntityOrAGroupOfEntities": "Entitas grup / Group entity",
    "PeriodOfFinancialStatementsSubmissions": "Kuartal I / First Quarter",
    "DateOfBoardOfDirectorsStatementLetter": "2025-04-21",
    "CurrentPeriodStartDate": "2025-01-01",
    "CurrentPeriodEndDate": "2025-03-31",
    "PriorYearEndDate": "2024-12-31",
    "PriorPeriodStartDate": "2024-01-01",
    "PriorPeriodEndDate": "2024-03-31",
    "Prior2YearEndDate": "2023-12-31",
    "DescriptionOfPresentationCurrency": "Rupiah / IDR",
    "LevelOfRoundingUsedInFinancialStatements": "Satuan Penuh / Full Amount",
    "TypeOfReportOnFinancialStatements": "Tidak Diaudit / Unaudit",
    "WhetherInComplianceWithBAPEPAMLKVIIIG11RulesConcerningResponsibilitiesOfBoardOfDirectorsOnFinancialStatements": "Ya / Yes",
    "WhetherInComplianceWithBAPEPAMLKVIIIATwoRulesConcerningIndependenceOfAccountantProvidingAuditServicesInCapitalMarket": "Ya / Yes",
    "CashAndCashEquivalents": "35404621650",
    "CurrentRestrictedFunds": "130000000000",
    "TradeReceivablesThirdParties": "27582988583",
    "TradeReceivablesRelatedParties": "731760347",
    "UnbilledReceivablesThirdParties": "54679620796",
    "CurrentRealEstateAssets": "3381980875219",
    "CurrentInventories": "1942636425",
    "CurrentPrepaidExpenses": "2578941721",
    "OtherCurrentAdvances": "8902857101",
    "CurrentPrepaidTaxes": "1871810101",
    "CurrentAssets": "3645676111943",
    "NonCurrentRestrictedFunds": "231942776392",
    "OtherNonCurrentReceivablesThirdParties": "55989234108",
    "OtherNonCurrentReceivablesRelatedParties": "9169847062",
    "NonCurrentRealEstateAssets": "2674175374453",
    "InvestmentProperties": "202721000000",
    "IntangibleAssetsOtherThanGoodwill": "1044500000",
    "OtherNonCurrentNonFinancialAssets": "341995267",
    "NonCurrentAssets": "3175384727282",
    "Assets": "6821060839225",
    "TradePayablesThirdParties": "537054899229",
    "TradePayablesRelatedParties": "579703923444",
    "OtherPayablesThirdParties": "2116251981",
    "OtherPayablesRelatedParties": "1410688093",
    "DividendsPayable": "18724601162",
    "CurrentAccruedExpenses": "221620433998",
    "TaxesPayable": "43915762288",
    "CurrentUnearnedRevenue": "899740344977",
    "CurrentMaturitiesOfBankLoans": "123500000000",
    "CurrentMaturitiesOfFinanceLeaseLiabilities": "793109378",
    "CurrentMaturitiesOfBondsPayable": "101837965301",
    "CurrentLiabilities": "2530417979851",
    "DeferredTaxLiabilities": "1374308582",
    "LongTermBankLoans": "125562000000",
    "LongTermNon-BankFinancialInstitutionsLoan": "126492500000",
    "LongTermBondsPayable": "493007556592",
    "LongTermSukuk": "268414235028",
    "OtherNonCurrentFinancialLiabilities": "437677628290",
    "OtherNonCurrentNonFinancialLiabilities": "221148070439",
    "NonCurrentLiabilities": "1673676298931",
    "Liabilities": "4204094278782",
    "CommonStocks": "2222222220000",
    "AdditionalPaidInCapital": "56632698985",
    "AppropriatedRetainedEarnings": "54010882540",
    "UnappropriatedRetainedEarnings": "284092038919",
    "EquityAttributableToEquityOwnersOfParentEntity": "2616957840444",
    "NonControllingInterests": "8719999",
    "Equity": "2616966560443",
    "LiabilitiesAndEquity": "6821060839225",
    "SalesAndRevenue": "81921246362",
    "CostOfSalesAndRevenue": "59997276443",
    "GrossProfit": "21923969919",
    "GeneralAndAdministrativeExpenses": "7560337432",
    "FinanceIncome": "2818081204",
    "InterestAndFinanceCosts": "5031577345",
    "OtherExpenses": "4971186330",
    "OtherGainsLosses": "-5479732928",
    "ProfitLossBeforeIncomeTax": "7178950016",
    "TaxBenefitExpenses": "-64182279",
    "ProfitLossFromContinuingOperations": "7114767737",
    "ProfitLoss": "7114767737",
    "ComprehensiveIncome": "7114767737",
    "ProfitLossAttributableToParentEntity": "7114783300",
    "ProfitLossAttributableToNonControllingInterests": "-15563",
    "ComprehensiveIncomeAttributableToParentEntity": "7114783300",
    "ComprehensiveIncomeAttributableToNonControllingInterests": "-15563",
    "BasicEarningsLossPerShareFromContinuingOperations": "0.36",
    "BalanceBeforeRestatementAtBeginningOfPeriod": "2574162796643",
    "EquityPositionBeginningOfThePeriod": "2574162796643",
    "ProfitLossChangesInEquity": "7114767737",
    "EquityPositionEndOfThePeriod": "2581277564380",
    "ReceiptsFromCustomers": "114537885051",
    "PaymentsToSuppliersForGoodsAndServices": "76479330508",
    "PaymentsForSalariesAndAllowances": "5033147379",
    "CashGeneratedFromUsedInOperations": "33025407164",
    "IncomeTaxesRefundedPaidFromOperatingActivities": "-37269927",
    "NetCashFlowsReceivedFromUsedInOperatingActivities": "32988137237",
    "ProceedsFromDisposalOfLandForDevelopment": "2791087748",
    "PaymentsForAcquisitionOfLandForDevelopment": "1665000000",
    "OtherCashInflowsOutflowsFromInvestingActivities": "0",
    "NetCashFlowsReceivedFromUsedInInvestingActivities": "2791087748",
    "ProceedsFromBankLoans": "6000000000",
    "PaymentsOfBankLoans": "47496000000",
    "PaymentsOfNon-BankFinancialInstitutionLoan": "6657500000",
    "PaymentsOfBondsIssuanceCosts": "325268740",
    "ProceedsFromDueToRelatedParties": "68355597343",
    "PaymentsOfDueToRelatedParties": "2986568389",
    "InterestsReceivedFromFinancingActivities": "2818081204",
    "InterestsPaidFromFinancingActivities": "20939641794",
    "NetCashFlowsReceivedFromUsedInFinancingActivities": "-62929397719",
    "NetIncreaseDecreaseInCashAndCashEquivalents": "-27150172734",
    "CashAndCashEquivalentsCashFlows": "256544309173",
    "BasisOfPreparationOfConsolidatedFinancialStatementsTextBlock": "Laporan keuangan konsolidasian disusun dan disajikan berdasarkan asumsi kelangsungan usaha serta atas dasar akrual, kecuali laporan arus kas konsolidasian. Dasar pengukuran dalam penyusunan laporan keuangan konsolidasian ini adalah konsep biaya perolehan, kecuali beberapa akun tertentu yang didasarkan pengukuran lain sebagaimana dijelaskan dalam kebijakan akuntansi masing-masing akun tersebut. Biaya perolehan umumnya didasarkan pada nilai wajar imbalan yang diserahkan dalam pemerolehan aset. Laporan arus kas konsolidasian disajikan dengan metode langsung dengan mengelompokkan arus kas dalam aktivitas  operasi, investasi dan pendanaan. Mata uang penyajian yang digunakan dalam penyusunan laporan keuangan konsolidasian ini adalah Rupiah, yang merupakan mata uang fungsional Grup dan seluruh entitas anak. Setiap entitas di dalam Grup menetapkan mata uang fungsional sendiri dan unsur-unsur dalam laporan keuangan dari setiap entitas diukur berdasarkan mata uang fungsional tersebut.",
    "PrinciplesOfConsolidationTextBlock": "Laporan keuangan konsolidasian mencakup laporan keuangan Grup seperti disebutkan pada Catatan 1b. Entitas anak adalah entitas yang dikendalikan oleh Grup, yakni Grup terekspos, atau memiliki hak, atas imbal hasilvariabel dari keterlibatannya dengan entitas dan memiliki kemampuan untuk mempengaruhi imbal hasil tersebut melalui kemampuan kini untuk mengarahkan aktivitas relevan dari entitas (kekuasaan atas investee). Keberadaan dan dampak dari hak suara potensial dimana Grup memiliki kemampuan praktis untuk melaksanakan (yakni hak substantif) dipertimbangkan saat menilai apakah Grup mengendalikan entitas lain. Laporan keuangan Grup mencakup hasil usaha, arus kas, aset dan liabilitas dari Grup dan seluruh entitas anak yang, secara langsung dan tidak langsung, dikendalikan oleh Grup. Entitas anak dikonsolidasikan sejak tanggal efektif akuisisi, yaitu tanggal dimana Grup secara efektif memperoleh pengendalian atas bisnis yang diakuisisi, sampai tanggal pengendalian berakhir. Grup menyusun laporan keuangan konsolidasian dengan menggunakan kebijakan akuntansi yang sama untuk transaksi dan peristiwa lain dalam keadaan yang serupa. Seluruh transaksi, saldo,penghasilan, beban, dan arus kas dalam intra kelompok usaha terkait dengan transaksi antar entitas dalam kelompok usaha dieliminasi secara penuh. Grup mengatribusikan laba rugi dan setiap komponen dari penghasilan komprehensif lain kepada pemilik entitas induk dan kepentingan nonpengendali meskipun hal tersebut mengakibatkan kepentingan nonpengendali memiliki saldo defisit. Grup menyajikan kepentingan nonpengendali di ekuitas dalam laporan posisi keuangan konsolidasian, terpisah dari ekuitas pemilik entitas induk. Perubahan dalam bagian kepemilikan entitas induk pada entitas anak yang tidak mengakibatkan hilangnya pengendalian adalah transaksi ekuitas (yaitu transaksi  dengan pemilik dalam kapasitasnya sebagai pemilik). Ketika proporsi ekuitas yang dimiliki oleh kepentingan nonpengendali berubah, Grup menyesuaikan jumlah tercatat kepentingan pengendali dan kepentingan nonpengendali untuk mencerminkan perubahan kepemilikan relatifnya dalam entitas anak. Selisih antara jumlah tercatat kepentingan nonpengendali yang disesuaikan dan nilai wajar dari jumlah yang diterima atau dibayarkan diakui langsung dalam ekuitas dan diatribusikan pada pemilik dari entitas induk. Jika Grup kehilangan pengendalian, maka Grup: a) Menghentikan pengakuan aset (termasuk goodwill) dan liabilitas entitas anak pada jumlah tercatatnya ketika pengendalian hilang; b) Menghentikan pengakuan jumlah tercatat setiap kepentingan nonpengendali pada entitas anak terdahulu ketika pengendalian hilang (termasuk setiap komponen penghasilan komprehensif lain yang diatribusikan pada kepentingan nonpengendali); c) Mengakui nilai wajar pembayaran yang diterima (jika ada) dari transaksi, peristiwa, atau keadaan yang mengakibatkan hilangnya pengendalian; d) Mengakui sisa investasi pada entitas anak terdahulu pada nilai wajarnya pada tanggal hilangnya pengendalian; e) Mereklasifikasi ke laba rugi, atau mengalihkan secara langsung ke saldo laba jika disyaratkan oleh SAK lain, jumlah yang diakui dalam penghasilan  komprehensif lain dalam kaitan dengan entitas anak; f) Mengakui perbedaan apapun yang dihasilkan sebagai keuntungan atau kerugian dalam laba rugi yang  diatribusikan kepada entitas induk.",
    "CashAndCashEquivalentsTextBlock": "Kas dan setara kas termasuk kas, kas di bank (rekening giro), dan deposito berjangka yang jatuh tempo dalam jangka waktu tiga bulan atau kurang pada saat penempatan yang tidak digunakan sebagai jaminan atau tidak dibatasi penggunaannya.",
    "InventoriesTextBlock": "Persediaan Hotel. Persediaan dinyatakan sebesar nilai yang lebih rendah antara harga perolehan dan nilai realisasi bersih. Harga perolehan ditentukan dengan menggunakan metode pertama-masuk, pertama keluar (). Harga perolehan barang jadi dan pekerjaan dalam proses terdiri dari bahan baku, tenaga kerja langsung, biaya langsung lainnya dan biaya overhead produksi (berdasarkan kapasitas normal operasi). Persediaan tidak mencakup biaya pinjaman. Nilai realisasi bersih adalah estimasi harga penjualan dalam kegiatan usaha biasa, dikurangi beban penjualan bervariasi. Persediaan Aset Real Estat yang terutama terdiri dari  tanah dalam pematangan, unit bangunan siap jual dan unit bangunan dalam penyelesaian, dinyatakan sebesar nilai yang lebih rendah antara biaya perolehan dan nilai realisasi neto. Biaya perolehan ditentukan dengan menggunakan metode rata-rata. Biaya perolehan atas tanah dalam  pematangan termasuk biaya pengembangan dan pematangan tanah. Nilai realisasi neto adalah taksiran harga penjualan dalam kegiatan usaha normal yang didasarkan pada harga pasar pada  tanggal pelaporan dan didiskontokan untuk nilai waktu uang, jika material, dikurangi taksiran biaya penyelesaian dan taksiran biaya untuk melaksanakan penjualan. Penurunan nilai persediaan ditetapkan untuk mengurangi nilai tercatat persediaan ke nilai realisasi neto dan penurunannya diakui sebagai rugi pada laporan laba rugi komprehensif tahun yang bersangkutan. Biaya perolehan atas unit bangunan terdiri dari biaya aktual konstruksi. Beban keuangan atas pinjaman bank dan fasilitas pinjaman lainnya yang diperoleh yang dapat  diatribusikan langsung dengan pembelian; pengembangan dan pematangan tanah; serta konstruksi aset real estat akan dikapitalisasi. Harga perolehan aset real estat adalah harga beli tanah ditambah dengan biaya-biaya lain yang memenuhi kriteria kapitalisasi sebagai berikut: 1. Biaya pra perolehan tanah 2. Biaya perolehan tanah 3. Biaya yang secara langsung berhubungan dengan proyek 4. Biaya yang dapat diatribusikan pada aktifitas pengembangan real estat dan properti 5. Biaya pinjaman. Biaya yang dikapitalisasi ke proyek pengembangan aset real estat dialokasikan ke setiap unit properti dengan metode identifikasi khusus.Pengukuran dengan menggunakan metode identifikasi khusus disesuaikan dengan tipe tanah dan bangunan, dan lokasi. Grup tetap melakukan akumulasi biaya ke proyek pengembangan walaupun realisasi pendapatan pada masa depan lebih rendah dari nilai tercatat proyek, atas perbedaan yang terjadi, Grup melakukan penyisihan secara periodik. Jumlah penyisihan tersebut akan mengurangi nilai tercatat proyek dan dibebankan ke laba dan rugi berjalan.Pengkajian atas estimasi dan alokasi biaya dilakukan pada setiap akhir periode pelaporan sampai proyek secara substansial, jika terjadi perubahan mendasar Grup akan melakukan revisi dan realokasi biaya.",
    "InvestmentPropertyTextBlock": "Properti investasi adalah properti (tanah atau bangunan atau bagian dari suatu bangunan atau kedua-duanya) yang dikuasai oleh pemilik atau penyewa melalui sewa pembiayaan untuk menghasilkan sewa atau untuk kenaikan nilai atau kedua-duanya, dan tidak untuk digunakan dalam produksi atau penyediaan barang atau jasa atau untuk tujuan administratif; atau dijual dalam kegiatan usaha sehari-hari. Properti investasi diakui sebagai aset jika dan hanya jika besar kemungkinan manfaat ekonomis masa depan yang terkait dengan properti investasi akan mengalir ke entitas; dan biaya perolehan properti investasi dapat diukur dengan andal.Properti investasi pada awalnya diukur sebesar biaya perolehan, meliputi harga harga pembelian dan setiap pengeluaran yang diatribusikan secara langsung (biaya jasa hukum, pajak pengalihan properti, dan biaya transaksi lain). Biaya transaksi termasuk dalam pengukuran awal tersebut. Properti investasi yang sedang dalam pengembangan ulang untuk penggunaan lebih lanjut sebagai properti investasi atauketika pasar menjadi kurang aktif tetap dicatat sebesar nilai wajarnya. Properti investasi dalam konstruksi diukur secara andal, tetapi Grup mengharapkankan nilai wajarnya dapat diukur secara andal ketika konstruksiselesai, diukur senilai biaya dikurangi penurunan nilai sampai nilai wajarnya dapat diukur secara andal atau konstruksi diselesaikan  yang mana yang lebih awal.Setelah pengakuan awal, Grup memilih menggunakan model nilai wajar dan mengukur seluruh properti investasi berdasarkan nilai wajar. Keuntungan atau kerugian yang timbul dari perubahan nilai wajar properti investasi diakui dalam laba rugi pada periode terjadinya.Penentuan nilai wajar investasi didasarkan pada penilaian oleh penilai independen yang mempunyai kualifikasi profesional yang telah diakui dan relevan serta memiliki pengalaman terkini di lokasi dan kategori properti investasi yang dinilai.Pengalihan ke properti investasi dilakukan jika, dan hanya jika, terdapat perubahan penggunaan yang ditunjukkan dengan berakhirnya pemakaian oleh pemilik dan dimulainya sewa operasi kepada pihak lain.Pengalihan dari properti investasi dilakukan jika, dan hanya jika, terdapat perubahan penggunaan yang ditunjukkan dengan dimulainya penggunaan oleh pemilik dan dimulainya pengembangan untuk dijual.Properti investasi dihentikan pengakuannya pada saat dilepaskan atau ketika tidak digunakan lagi secara permanen dan tidak memiliki manfaat ekonomis masa depan yang diperkirakan dari pelepasannya. Keuntungan atau kerugian yang timbul dari penghentian atau pelepasan ditentukan dari selisih antara hasil neto pelepasan dan jumlah tercatat aset, dan diakui dalam laba rugi pada periode terjadinya penghentian atau pelepasan.",
    "FixedAssetsTextBlock": "Aset tetap pada awalnya diakui sebesar biaya perolehan yang meliputi harga perolehannya dan setiap biaya yang dapat diatribusikan langsung untuk membawa aset ke kondisi dan lokasi yang diinginkan agar aset siap digunakan sesuai intensi manajemen. Apabila relevan, biaya perolehan juga dapat mencakup estimasi awal biaya pembongkaran dan pemindahan aset tetap dan restorasi lokasi aset tetap, kewajiban tersebut timbul ketika aset tetap diperoleh atau sebagai konsekuensi penggunaan aset tetap selama periode tertentu untuk tujuan selain untuk memproduksi persediaan selama periode tersebut. Setelah pengakuan awal, aset tetap kecuali tanah dinyatakan sebesar biaya perolehan dikurangi akumulasi penyusutan dan akumulasi rugi penurunan nilai. Penyusutan aset tetap dimulai pada saat aset tersebut siap untuk digunakan sesuai maksud penggunaannya dan dihitung dengan menggunakan metode garis lurus berdasarkan estimasi masa manfaat ekonomis aset. Pada akhir tahun buku pelaporan, Grup melakukan penelaahan berkala atas masa manfaat ekonomis aset, nilai residu, metode penyusutan, dan sisa umur pemakaian berdasarkan kondisi teknis. Jumlah tercatat aset tetap dihentikan pengakuannya pada saat dilepaskan atau saat tidak ada manfaat ekonomis masa depan yang diharapkan dari penggunaan atau pelepasannya. Laba atau rugi yang timbul dari penghentian pengakuan aset (dihitung sebagai perbedaan antara jumlah neto hasil pelepasan dan nilai tercatat dari aset) dikreditkan atau dibebankan pada laporan laba rugi komprehensif tahun aset tersebut dihentikan pengakuannya.",
    "RevenueAndExpenseRecognitionTextBlock": "Grup mengakui pendapatan sesuai dengan PSAK 72,  dari Kontrak dengan Pelanggan dengan melakukan analisis transaksi melalui metode lima langkah pengakuan pendapatan sebagai berikut:  1. Mengidentifikasi kontrak dengan pelanggan, dimana Grup mencatat kontrak dengan pelanggan hanya jika seluruh kriteria berikut terpenuhi: Kontrak telah disetujui oleh para pihak dalam kontrak; Kelompok Usaha dapat mengindentifikasi hak dari para pihak dan jangka waktu pembayaran atas barang yang akan dialihkan; Kontrak memiliki substansi komersial; dan Kemungkinan besar Kelompok Usaha akan menerima imbalan atas barang yang dialihkan;2. Mengindentifikasi kewajiban pelaksanaan dalam kontrak;3. Menentukan harga transaksi; 4. Mengalokasikan harga transaksi pada setiap kewajiban pelaksanaan; dan5. Mengakui pendapatan ketika kewajiban pelaksanaan telah dipenuhi (pada suatu waktu tertentu atau sepanjang waktu).Kriteria spesifik berikut juga harus dipenuhi sebelum pendapatan diakui:Real Estat Real EstateMetode yang digunakan Grup untuk mengakui pendapatan dari penjualan real estat dilakukan pada titik tertentu, yaitu pada saat terjadi penyerahan aset kepada pembeli (at a point in time).Pendapatan BungaPendapatan bunga diakui berdasarkan waktu terjadinya dengan acuan jumlah pokok simpanan dan tingkat bunga yang sesuai.Beban Beban diakui pada saat terjadinya, dengan menggunakan dasar akrual.",
    "TransactionsWithRelatedPartiesTextBlock": "Pihak berelasi adalah orang atau entitas yang terkait dengan entitas pelapor:  a) Orang atau anggota keluarga dekatnya mempunyai relasi dengan entitas pelapor jika orang tersebut:  i. memiliki pengendalian atau pegendalian bersama atas entitas pelapor; ii. memiliki pengaruh signifikan atas entitas pelapor; atau iii. merupakan personil manajemen kunci entitas pelapor atau entitas induk dari entitas pelapor; b) Suatu entitas berelasi dengan entitas pelapor jika memenuhi salah satu hal berikut: i. Entitas dan entitas pelapor adalah anggota dari kelompok usaha yang sama (artinya entitas induk, entitas anak, dan entitas anak berikutnya saling berelasi dengan entitas lain); ii. Satu entitas adalah entitas asosiasi atau ventura bersama dari entitas lain (atau entitas asosiasi atau ventura bersama yang merupakan anggota suatu kelompok usaha, yang mana entitas lain tersebut adalah anggotanya);  iii. Kedua entitas tersebut adalah ventura bersama dari pihak ketiga yang sama; iv. Satu entitas adalah ventura bersama dari entitas ketiga dan entitas yang lain adalah entitas asosiasi dari entitas ketiga; v. Entitas tersebut adalah suatu program imbalan pascakerja untuk imbalan kerja dari salah satu entitas pelapor atau entitas yang terkait dengan entitas pelapor. Jika entitas pelapor adalah entitas yang menyelenggarakan program tersebut, maka entitas sponsor juga berelasi dengan entitas pelapor; vi. Entitas yang dikendalikan atau dikendalikan bersama oleh orang yang diidentifikasi dalam huruf (a); atau vii. Orang yang diidentifikasi dalam huruf (a) (i) memiliki pengaruh signifikan atas entitas atau merupakan personil manajemen kunci entitas (atau entitas induk dari entitas); viii. Entitas, atau anggota dari kelompok yang mana entitas merupakan bagian  dari kelompok tersebut, menyediakan jasa personil manajemen kunci kepada entitas pelapor atau kepada entitas induk dari entitas pelapor.Entitas yang berelasi dengan Pemerintah dapat berupa entitas yang dikendalikan atau dipengaruhi secara signifikan oleh Kementerian Keuangan atau Pemerintah  Daerah yang merupakan Pemegang Saham entitas, atau entitas yang dikendalikan oleh Pemerintah Republik Indonesia melalui Kementerian BUMN sebagai kuasa  pemegang saham. Seluruh transaksi dan saldo yang signifikan dengan pihak berelasi diungkapkan dalam Catatan yang relevan.",
    "IncomeTaxesTextBlock": "Beban pajak adalah jumlah gabungan pajak kini dan pajak tangguhan yang diperhitungkan dalam menentukan laba rugi pada suatu periode. Pajak kini dan pajak tangguhan diakui dalam laba rugi, kecuali pajak penghasilan yang timbul dari transaksi atau peristiwa yang diakui dalam penghasilan komprehensif lain atau secara langsung di ekuitas. Dalam hal ini, pajak tersebut masing diakui dalam penghasilan komprehensif lain atau ekuitas. Manfaat terkait dengan rugi pajak yang dapat ditarik untuk memulihkan pajak kini dari periode sebelumnya diakui sebagai aset. Aset pajak tangguhan diakui untuk akumulasi rugi pajak belum dikompensasi dan kredit pajak belum dimanfaatkan sepanjang kemungkinan besar laba kena pajak masa depan akan tersedia untu dimanfaatkan dengan rugi pajak belum dikompensasi dan kredit pajak belum dimanfaatkan. Seluruh perbedaan temporer kena pajak diakui sebagai liabilitas pajak tangguhan, kecuali perbedaan temporer kena pajak yang berasal dari: a) pengakuan awal goodwill; atau b) pengakuan awal aset atau liabilitas dari transaksi yang bukan kombinasi bisnis dan pada saat transaksi tidak mempengaruhi laba akuntansi atau laba kena pajak (rugi pajak).  Aset pajak tangguhan diakui untuk seluruh perbedaan temporer dapat dikurangkan sepanjang kemungkinan besar laba kena pajak akan tersedia sehingga perbedaan temporer dapat dimanfaatkan untuk mengurangi laba dimaksud, kecuali jika aset pajak tangguhan timbul dari pengakuan awal aset atau pengakuan awal liabilitas dalam transaksi yang bukan kombinasi bisnis dan pada saat transaksi tidak mempengaruhi laba akuntansi atau laba kena pajak (rugi pajak). Aset dan liabilitas pajak tangguhan diukur dengan menggunakan tarif pajak yang diharapkan berlaku ketika aset dipulihkan atau liabilitas diselesaikan, berdasarkan tarif pajak (dan peraturan pajak) yang telah berlaku atau secara substantif telah berlaku pada akhir periode pelaporan. Pengukuran aset dan liabilitas pajak tangguhan mencerminkan konsekuensi pajak yang sesuai dengan cara Grup memperkirakan, pada akhir periode pelaporan, untuk memulihkan atau menyelesaikan jumlah tercatat aset dan liabilitasnya. Jumlah tercatat aset pajak tangguhan ditelaah ulang pada akhir periode pelaporan. Grup mengurangi jumlah tercatat aset pajak tangguhan jika kemungkinan besar laba kena pajak tidak lagi tersedia dalam jumlah yang memadai untuk mengkompensasikan sebagian atau seluruh aset pajak tangguhan tersebut. Setiap pengurangan tersebut dilakukan pembalikan atas aset pajak tangguhan hingga kemungkinan besar laba kena pajak yang tersedia jumlahnya memadai. Grup melakukan saling hapus aset pajak tangguhan dan liabilitas pajak tangguhan jika dan hanya jika: a) Grup memiliki hak yang dapat dipaksakan secara hukum untuk melakukan saling hapus aset pajak kini terhadap liabilitas pajak kini; dan b) Aset pajak tangguhan dan liabilitas pajak tangguhan terkait dengan pajak penghasilan yang dikenakan oleh otoritas perpajakan yang sama atas:  i. entitas kena pajak yang sama; atau  ii. entitas kena pajak yang berbeda yang bermaksud untuk memulihkan aset dan liabilitas pajak kini dengan dasar neto, atau merealisasikan aset dan menyelesaikan liabilitas secara bersamaan, pada setiap periode masa depan dimana jumlah signifikan atas aset atau liabilitas pajak tangguhan diperkirakan untuk diselesaikan atau dipulihkan.",
    "BorrowingsTextBlock": "Biaya pinjaman yang dapat diatribusikan langsung dengan perolehan, pembangunan atau pembuatan aset kualifikasian, dikapitalisasi sebagai bagian biaya perolehan aset tersebut. Biaya pinjaman lainnya diakui sebagai beban pada saat terjadi. Biaya pinjaman dapat mencakup beban bunga, beban keuangan dalam sewa pembiayaan atau selisih kurs yang berasal dari pinjaman dalam mata uang asing sepanjang selisih kurs tersebut diperlakukan sebagai penyesuaian atas biaya bunga. Kapitalisasi biaya pinjaman dimulai pada saat Grup telah melakukan aktivitas yang diperlukan untuk mempersiapkan aset agar dapat digunakan atau dijual sesuai dengan intensinya serta pengeluaran untuk aset dan biaya pinjamannya telah terjadi. Kapitalisasi biaya pinjaman dihentikan ketika secara substansial seluruh aktivitas yang diperlukan untuk mempersiapkan aset kualifikasian agar dapat digunakan atau dijual sesuai dengan intensinya telah selesai. Biaya bunga dan biaya pinjaman lainnya, seperti biaya diskonto pinjaman baik yang secara langsung atau tidak langsung digunakan untuk pendanaan konstruksi aset kualifikasian, dikapitalisasi hingga aset tersebut selesai dikonstruksi. Untuk biaya pinjaman yang dapat diatribusikan secara langsung pada aset kualifikasian, jumlah yang dikapitalisasi ditentukan dari biaya pinjaman aktual yang terjadi selama periode berjalan, dikurangi penghasilan yang diperoleh dari investasi sementara atas dana hasil pinjaman tersebut. Untuk pinjaman yang tidak dapat diatribusikan secara langsung pada suatu aset kualifikasian, jumlah yang dikapitalisasi ditentukan dengan mengalikan tingkat kapitalisasi terhadap jumlah yang dikeluarkan untuk memperoleh aset kualifikasian. Tingkat kapitalisasi dihitung berdasarkan rata-rata tertimbang biaya pinjaman yang dibagi dengan jumlah pinjaman yang tersedia selama periode, selain pinjaman yang secara spesifik diambil untuk tujuan memperoleh suatu aset kualifikasian.",
    "ProvisionsTextBlock": "Aset takberwujud diukur sebesar nilai perolehan pada pengakuan awal. Setelah pengakuan awal, aset takberwujud dicatat pada biaya perolehan dikurangi akumulasi amortisasi dan akumulasi rugi penurunan nilai. Umur manfaat aset takberwujud dinilai apakah terbatas atau tidak terbatas. Umur manfaat aset takberwujud dinilai apakah terbatas atau tidak terbatas. Aset takberwujud diamortisasi dengan menggunakan metode garis lurus berdasarkan estimasi masa manfaat lima tahun. Aset takberwujud dihentikan pengakuannya jika dilepas. Ketika tidak terdapat lagi manfaat ekonomi masa depan yang diharapkan dari penggunaan atau pelepasannya.",
    "IntangibleAssetsTextBlock": "Aset takberwujud diukur sebesar nilai perolehan pada pengakuan awal. Setelah pengakuan awal, aset takberwujud dicatat pada biaya perolehan dikurangi akumulasi amortisasi dan akumulasi rugi penurunan nilai. Umur manfaat aset takberwujud dinilai apakah terbatas atau tidak terbatas. Umur manfaat aset takberwujud dinilai apakah terbatas atau tidak terbatas. Aset takberwujud diamortisasi dengan menggunakan metode garis lurus berdasarkan estimasi masa manfaat lima tahun. Aset takberwujud dihentikan pengakuannya jika dilepas. Ketika tidak terdapat lagi manfaat ekonomi masa depan yang diharapkan dari penggunaan atau pelepasannya.",
    "PrepaidExpensesTextBlock": "Biaya dibayar dimuka terdiri dari biaya usaha, biaya sewa, dan asuransi. Untuk biaya usaha akan dibebankan secara proporsional dengan pendapatan yang diakui pada setiap periode.",
    "TradeReceivablesGross": "1253304280",
    "AllowanceForImpairmentOfTradeReceivables": "521543933",
    "TradeReceivablesNet": "731760347",
    "DisclosureofNotesforInventoriesTextBlock": "Pada periode 31 March 2025 dan 31 Desember 2024 terdapat pengurangan sehubungan dengan penjualan aset real estate masing-masing sebesar Rp 20.411.181.621 dan Rp121.201.280.245 (Catatan 32). Pada periode 31 March 2025 dan 31 Desember 2024 terdapat reklasifikasi aset real estate ke properti investasi sehubungan dengan gedung, bangunan siap jual, beban akrual, beban keuangan dan biaya gaji proyek sebesar Rp 18.929.986.091 dan Rp1.887.531.844",
    "TradePayables": "579703923444",
    "RealtyAndProperty": "59997276443",
    "DisclosureofNotesforCostofGoodsSoldTextBlock": "Beban pokok pendapatan dari properti dan operasi bersama merupakan beban pokok pendapatan atas aset real estat yang terjual dan biaya dibayar di muka lain lain",
    "BankLoanAmountInForeignCurrency": "125562000000",
    "TotalBankLoanGross": "249062000000",
    "BankLoans": "249062000000",
    "DisclosureofNotesforLongTermBankLoansTextBlock": "Fasilitas Kredit Modal Kerja\nPT Bank Tabungan Negara (Persero) Tbk LRT City Bekasi Timur Eastern Green\nBerdasarkan Surat Persetujuan Pemberian Kredit (SP2K) No. 77/S/CSTD/CB1/II/2022 tanggal 22 Februari 2023, Grup memperoleh Fasilitas Kredit Modal Kerja Konstruksi untuk pembangunan Apartemen  Eastern Green Lot 1. Fasilitas tersebut berjangka waktu 5 (lima) tahun terhitung sejak tanggal 22 Februari 2023 dengan syarat dan ketentuan sebagai berikut:\n\tPlafond kredit Rp 160.000.000.000;\n\tSifat kredit non revolving;\n\tBiaya provisi 0,25%\n\tBiaya administrasi 0,25%\n\tSuku Bunga 8,5% p.a:\n\tDenda 2%\n\tBiaya APHT 0,50%\n\nFasilitas pinjaman tersebut dijamin dengan:\na.\tTanah proyek pembangunan Apartemen Eastern Green Lot 1  Tower Primrose dan Tower Clove;\nb.\tPiutang yang berkaitan dengan pendapatan atas unit-unit Apartemen Eastern Green Lot 1  Tower Primrose dan Tower Clove yang diikat dengan cessie atau fiducia.\n\nPerusahaan terikat dengan beberapa batasan, antara lain:\na.\tDER maksimal sebesar 350%;\nb.\tInterest Coverage Ratio minimal 100%;\n\nc.\tCurrent Ratio diatas 100%;\nd.\tMenjaga kualitas kredit di BTN maupun Bank lain agar selalu kondisi lancar;\n\ne.\tMelaksanakan pembangunan Apartemen berjalan sesuai dengan rencana saat pengajuan kredit.\nf.\tMenyerahkan laporan yang ditandatangani pejabat yang berwenang sesuai dengan Anggaran Dasar terkait perkembangan proyek setiap 3 bulan.\ng.\tMenyerahkan Laporan Keuangan Semesteran paling lambat 90 hari setelah tanggal pelaporan dan Laporang Auditor Independen maksimal 180 hari setelah tanggal pelaporan.\nh.\tMenyerahkan Hasil Penilaian Agunan yang dilakukan oleh Appraisal Independen setiap 24 (dua puluh empat) bulan sejak tanggal penilaian; dan\ni.\tMengizinkan BTN atau pihak yang ditunjuk BTN untuk melakukan pemeriksaan atas aktivitas usaha Perusahaan, mencakup informasi keuangan, perkembangan konstruksi, dan perkembangan penjualan unit atas proyek yang dibiayai oleh BTN.\n\nSaldo utang bank per 31 March 2025 dan 31 Desember 2024 masing-masing sebesar  Rp121.734.000.000 dan Rp125.562.000.000.\n\n\nJumlah pencairan tahun 2025 dan 2024 masing-masing sebesar Nihil.\n\nPembayaran yang dilakukan pada tahun 2025 dan 2024 masing-masing sebesar Rp 3.828.000.000 dan Rp20.545.200.000.\n\n\nPer 31 March 2025, Perusahaan telah memenuhi seluruh batasan-batasan keuangan seperti yang tertuang dalam masing-masing perjanjian pinjaman bank.\n\nPT Bank Tabungan Negara (Persero) Tbk LRT City Sentul Royal Sentul Park\nBerdasarkan Surat Persetujuan Pemberian Kredit (SP2K) No. 180/S/CBD/CB1/V/2023 tanggal 17 Mei 2023, Perusahaan memperoleh Fasilitas Kredit Modal Kerja Konstruksi untuk Pembangunan Apartemen Royal Sentul Park - Tower 1 sebanyak 1.626 unit dan area komersial beserta sarana dan  prasarana. Fasilitas tersebut berjangka waktu 1 (satu) tahun terhitung sejak tanggal 17 Mei 2023 dengan syarat dan ketentuan sebagai berikut: \n\tPlafond kredit Rp. 358.700.000.000;\n\tSifat kredit non revolving;\n\tBiaya provisi 0,25%;\n\tBiaya administrasi 0,25%;\n\tSuku Bunga 9,15% p.a;\n\tDenda 2%;\n\tBiaya APHT 0,50%\n\nPerusahaan memperoleh Fasilitas Perpanjangan Jangka Waktu Fasilitas Kredit sampai dengan 29 Oktober 2024 dengan syarat dan ketentuan kelonggaran Tarik Rp 4.214.250.000.\n\nFasilitas pinjaman tersebut dijamin dengan:\na.\tTanah proyek pembangunan Apartemen LRT City Sentul - Tower 1;\nb.\tPiutang yang berkaitan dengan pendapatan atas unit-unit Apartemen LRT City Sentul - Tower 1 yang diikat dengan cessie atau fiducia. \n\nGrup terikat dengan beberapa batasan, antara lain:\na.\tDER maksimal sebesar 500%;\nb.\tDebt Service Coverage Ratio (DSCR) diatas 100%;\nc.\tCurrent Ratio diatas 100%;\nd.\tRasio Modal disetor terhadap kredit minimal 10%; dan\ne.\tMenjaga ekuitas selalu positif.\nf.\tMelaksanakan pembangunan Apartemen berjalan sesuai dengan rencana saat pengajuan kredit.\ng.\tMenyerahkan laporan yang ditandatangani pejabat yang berwenang sesuai dengan Anggaran Dasar terkait perkembangan proyek setiap 3 bulan.\nh.\tMenyerahkan Laporan Keuangan Semesteran paling lambat 30 hari setelah tanggal pelaporan dan Laporang Auditor Independen maksimal 120 hari setelah tanggal pelaporan.\ni.\tMenyerahkan Hasil Penilaian Agunan yang dilakukan oleh Appraisal Independen setiap 18 (delapan belas) bulan sejak tanggal penilaian terakhir.\nj.\tMengizinkan BTN atau pihak yang ditunjuk BTN untuk melakukan pemeriksaan atas aktivitas usaha Perusahaan, mencakup informasi keuangan, perkembangan konstruksi, dan perkembangan penjualan unit atas proyek yang dibiayai oleh BTN.\nk.\tSetelah proyek apartemen selesai dibangun, Perusahaan wajib menyerahkan Surat Rekomendasi Kelaikan Huni yang dikeluarkan oleh Dinas tertentu.\nl.\tMemasang umbul-umbul dan/papan proyek yang menginformasikan bahwa proyek Apartemen didukung dan bekerjasama dengan Bank BTN dan membebaskan biaya atas branding Bank BTN dalam lingkungan/kawasan proyek Apartemen.\n\nPembayaran yang dilakukan untuk periode yang berakhir pada tanggal 31 March 2025 dan 31 Desember 2024 sebesar Nihil dan Rp28.298.750.000.\n\nPer 31 March 2025, Perusahaan telah memenuhi seluruh batasan-batasan keuangan seperti yang tertuang dalam masing-masing perjanjian pinjaman bank.\n\nPT Bank Tabungan Negara (Persero) Tbk  Adhi City Sentul\nBerdasarkan Surat Persetujuan Pemberian Kredit (SP2K) No. 259/S/CSTD/VII/2021 tanggal 23 Juli 2021. Perusahaan memperoleh Fasilitas Kredit Modal Kerja Konstruksi untuk Pembangunan Perumahan Bhumi Anvaya Adhi City Sentul sebanyak 351 unit rumah beserta sarana prasarana. Fasilitas tersebut jatuh tempo pada tanggal tanggal 26 Agustus 2024 dengan syarat dan ketentuan sebagai berikut:\n\tPlafond kredit Rp. 105.000.000.000;\n\tSifat kredit non revolving;\n\tBiaya administrasi 0,5%;\n\tSuku Bunga 9,00% p.a;\n\tDenda 2%;\n\tBiaya APHT 0,5%\n\nFasilitas pinjaman tersebut dijamin dengan:\na.\tTanah dan bangunan proyek perumahan Bhumi Anvaya Adhi City Sentul;\nb.\tPiutang yang berkaitan dengan pendapatan atas unit-unit Perumahan Bhumi Anvaya Adhi City Sentul yang diikat dengan cessie atau fiducia. \n\nGrup terikat dengan beberapa batasan, antara lain:\na.\tDER maksimal sebesar 500%;\nb.\tCurrent Ratio diatas 100%;\nc.\tRasio Modal disetor terhadap kredit minimal 10%; dan\nd.\tMenjaga ekuitas selalu positif.\ne.\tMelaksanakan pembangunan Apartemen berjalan sesuai dengan rencana saat pengajuan kredit.\nf.\tMenyerahkan laporan yang ditandatangani pejabat yang berwenang sesuai dengan Anggaran Dasar terkait perkembangan proyek setiap 3 bulan.\ng.\tMenyerahkan Laporan Keuangan Semesteran paling lambat 30 hari setelah tanggal pelaporan dan Laporang Auditor Independen maksimal 120 hari setelah tanggal pelaporan.\nh.\tMenyerahkan Hasil Penilaian Agunan yang dilakukan oleh Appraisal Independen setiap 18 (delapan belas) bulan sejak tanggal penilaian terakhir.\ni.\tMengizinkan BTN atau pihak yang ditunjuk BTN untuk melakukan pemeriksaan atas aktivitas usaha Perusahaan, mencakup informasi keuangan, perkembangan konstruksi, dan perkembangan penjualan unit atas proyek yang dibiayai oleh BTN.\nj.\tSetelah proyek apartemen selesai dibangun, Perusahaan wajib menyerahkan Surat Rekomendasi Kelaikan Huni yang dikeluarkan oleh Dinas tertentu.\nk.\tMemasang umbul-umbul dan/papan proyek yang menginformasikan bahwa proyek Apartemen didukung dan bekerjasama dengan Bank BTN dan membebaskan biaya atas branding Bank BTN dalam lingkungan/kawasan proyek Apartemen.\n\nPembayaran yang dilakukan untuk periode yang berakhir pada tanggal 31 March 2025 dan 31 Desember 2024 sebesar Nihil dan Rp57.408.500.000.\n\nPer 31 March 2025, Perusahaan telah memenuhi seluruh batasan-batasan keuangan seperti yang tertuang dalam masing-masing perjanjian pinjaman bank.\n\nPT Bank Pembangunan Daerah Jawa Barat dan Banten Tbk\nBerdasarkan Perjanjian Kredit Cash Collateral No. 0063/KBA-OKR/2024 tanggal 26 Januari 2024, Perusahaan memperoleh Fasilitas KMK Cash Collateral untuk modal kerja. Jangka waktu pinjaman 4 (empat) bulan sampai dengan tanggal 26 Mei 2024. Fasilitas tersebut mempunyai syarat dan ketentuan sebagai berikut:\n\tPlafond kredit Rp4.750.000.000;\n\tSifat kredit non revolving;\n\tBiaya provisi 0.5%;\n\tSuku Bunga 6% per tahun.\n\tMenjadikan deposito senilai Rp5.000.000.000 sebagai jaminan pinjaman.\n\nJumlah pencairan sampai dengan 31 March 2025 dan 31 Desember 2024 sebesar Nihil dan Rp665.530.800.\n\nPembayaran yang dilakukan untuk periode yang berakhir pada tanggal 31 March 2025 dan 31 Desember 2024 sebesar Nihil dan Rp665.530.800.\n\nPT Bank Pembangunan Daerah Jawa Barat dan Banten Tbk\nBerdasarkan Perjanjian Kredit Cash Collateral No. 0108/KBA-OKR/2024 tanggal 12 Februari 2024, Perusahaan memperoleh Fasilitas KMK Cash Collateral untuk modal kerja. Jangka waktu pinjaman 12 (dua belas) bulan sampai dengan tanggal 12 Februari 2025. Fasilitas tersebut mempunyai syarat dan ketentuan sebagai berikut:\n\tPlafond kredit Rp85.500.000.000;\n\tSifat kredit non revolving;\n\tBiaya provisi 0.5%;\n\tSuku Bunga 6% per tahun.\n\tMenjadikan deposito senilai Rp90.000.000.000 sebagai jaminan pinjaman.\n\nSaldo utang bank per 31 March 2025 dan 31 Desember 2024 sebesar  Rp85.500.000.000.\n\n\nJumlah pencairan sampai dengan 31 March 2025 dan 31 Desember 2024 sebesar Nihil dan Rp85.500.000.000.\n\nPT Bank Pembangunan Daerah Jawa Barat dan Banten Tbk\nBerdasarkan Perjanjian Kredit Cash Collateral No. 0309/KBA-OKR/2024 tanggal 16 Mei 2024, Perusahaan memperoleh Fasilitas KMK Cash Collateral untuk modal kerja. Jangka waktu pinjaman 12 (dua belas) bulan sampai dengan tanggal 16 Mei 2025. Fasilitas tersebut mempunyai syarat dan ketentuan sebagai berikut:\n\tPlafond kredit Rp38.000.000.000;\n\tSifat kredit non revolving;\n\tBiaya provisi 0.37%;\n\tSuku Bunga 6% per tahun.\n\tMenjadikan deposito senilai Rp40.000.000.000 sebagai jaminan pinjaman.\n\nSaldo utang bank per 31 March 2025 dan 31 Desember 2024 sebesar Rp 38.000.000.000.\n\n\nJumlah pencairan sampai dengan 31 March 2025 dan 31 Desember 2024 sebesar Nihil dan Rp 38.000.000.000"
  }
}