{
  "emiten": "PT Adhi Karya (Persero) Tbk.",
  "laporan_keuangan": {
    "measure": "shares",
    "identifier": "adhi_maker1",
    "instant": "2024-12-31",
    "startDate": "2024-01-01",
    "endDate": "2024-12-31",
    "explicitMember": "idx-cor:OtherCurrencyMember",
    "EntityName": "PT Adhi Karya (Persero) Tbk.",
    "EntityCode": "ADHI",
    "EntityIdentificationNumber": "AA435",
    "EntityMainIndustry": "Properti / Property",
    "SelectedAccountingStandards": "PSAK",
    "Sector": "J. Infrastructures",
    "Subsector": "J2. Heavy Constructions & Civil Engineering",
    "Industry": "J21. Heavy Constructions & Civil Engineering",
    "Subindustry": "J211. Heavy Constructions & Civil Engineering",
    "ControllingShareholderInformation": "Indonesian Government",
    "TypeOfEntity": "Local Company - Indonesia Jurisdiction",
    "TypeOfListedSecurities": "Saham dan Obligasi / Stock and Bond",
    "TypeOfBoardOnWhichTheEntityIsListed": "Utama / Main",
    "WhetherTheFinancialStatementsAreOfAnIndividualEntityOrAGroupOfEntities": "Entitas grup / Group entity",
    "PeriodOfFinancialStatementsSubmissions": "Kuartal I / First Quarter",
    "DateOfBoardOfDirectorsStatementLetter": "2025-04-24",
    "CurrentPeriodStartDate": "2025-01-01",
    "CurrentPeriodEndDate": "2025-03-31",
    "PriorYearEndDate": "2024-12-31",
    "PriorPeriodStartDate": "2024-01-01",
    "PriorPeriodEndDate": "2024-03-31",
    "Prior2YearEndDate": "2023-12-31",
    "DescriptionOfPresentationCurrency": "Rupiah / IDR",
    "LevelOfRoundingUsedInFinancialStatements": "Satuan Penuh / Full Amount",
    "TypeOfReportOnFinancialStatements": "Tidak Diaudit / Unaudit",
    "AnyKeyAuditMattersOpinion": "Tidak / No",
    "WhetherInComplianceWithBAPEPAMLKVIIIG11RulesConcerningResponsibilitiesOfBoardOfDirectorsOnFinancialStatements": "Ya / Yes",
    "WhetherInComplianceWithBAPEPAMLKVIIIATwoRulesConcerningIndependenceOfAccountantProvidingAuditServicesInCapitalMarket": "Ya / Yes",
    "CashAndCashEquivalents": "2243830554138",
    "TradeReceivablesThirdParties": "1749663810224",
    "TradeReceivablesRelatedParties": "695139624733",
    "RetentionReceivablesThirdParties": "500926040288",
    "RetentionReceivablesRelatedParties": "730656666184",
    "UnbilledReceivablesThirdParties": "3267027386868",
    "UnbilledReceivablesRelatedParties": "4605860802470",
    "CurrentRealEstateAssets": "5701979814280",
    "CurrentInventories": "273421077558",
    "CurrentPrepaidExpenses": "245441161996",
    "OtherCurrentAdvances": "690242577040",
    "CurrentPrepaidTaxes": "161058091133",
    "OtherCurrentNonFinancialAssets": "1292918500928",
    "NonCurrentAssetsOrDisposalGroupsClassifiedAsHeldForSale": "360191414476",
    "CurrentAssets": "22518357522316",
    "NonCurrentRestrictedFunds": "559884263446",
    "OtherNonCurrentReceivablesRelatedParties": "617452900",
    "InvestmentsInJointVentures": "2762746412679",
    "InvestmentsInAssociates": "189422484488",
    "OtherNonCurrentFinancialAssets": "1254872972311",
    "DeferredTaxAssets": "3660559737",
    "NonCurrentRealEstateAssets": "3913949638964",
    "InvestmentProperties": "1281109600000",
    "PropertyPlantAndEquipment": "2049076918159",
    "RightOfUseAssets": "30298231012",
    "OtherNonCurrentNonFinancialAssets": "344154662087",
    "NonCurrentAssets": "12524423549757",
    "Assets": "35042781072073",
    "ShortTermBankLoans": "7488000000",
    "TradePayablesThirdParties": "4042670672066",
    "TradePayablesRelatedParties": "3260874940241",
    "CurrentAdvancesFromCustomersThirdParties": "820408824710",
    "CurrentAccruedExpenses": "1938602344354",
    "TaxesPayable": "620143574883",
    "CurrentUnearnedRevenue": "979031521593",
    "DueToCustomersThirdParties": "3004540950072",
    "DueToCustomersRelatedParties": "163352299363",
    "CurrentMaturitiesOfBankLoans": "187257465334",
    "CurrentMaturitiesOfRetentionPayables": "553141741679",
    "CurrentMaturitiesOfBondsPayable": "1387460237270",
    "OtherCurrentNonFinancialLiabilities": "189180190558",
    "CurrentLiabilities": "20049429384176",
    "DeferredTaxLiabilities": "36458172508",
    "LongTermBankLoans": "1109979298815",
    "LongTermRetentionPayables": "193597260761",
    "LongTermBondsPayable": "3053314426870",
    "LongTermSukuk": "268414235028",
    "NonCurrentAdvancesFromCustomersThirdParties": "45012504534",
    "LongTermPostEmploymentBenefitObligations": "321566151192",
    "OtherNonCurrentNonFinancialLiabilities": "289819450027",
    "NonCurrentLiabilities": "5318161499735",
    "Liabilities": "25367590883911",
    "CommonStocks": "840760897900",
    "AdditionalPaidInCapital": "4755656134234",
    "RevaluationReserves": "822154104065",
    "OtherComponentsOfEquity": "71328744422",
    "AppropriatedRetainedEarnings": "327344656179",
    "UnappropriatedRetainedEarnings": "2224189208851",
    "EquityAttributableToEquityOwnersOfParentEntity": "9041433745651",
    "NonControllingInterests": "633756442511",
    "Equity": "9675190188162",
    "LiabilitiesAndEquity": "35042781072073",
    "SalesAndRevenue": "1580626382366",
    "CostOfSalesAndRevenue": "2409084553406",
    "GrossProfit": "226631907862",
    "SellingExpenses": "2323642418",
    "GeneralAndAdministrativeExpenses": "167080362950",
    "FinanceIncome": "20136404676",
    "InterestAndFinanceCosts": "179767395470",
    "GainsLossesOnChangesInForeignExchangeRates": "527296565",
    "ShareOfProfitLossOfAssociatesAccountedForUsingEquityMethod": "-1329775489",
    "ShareOfProfitLossOfJointVenturesAccountedForUsingEquityMethod": "125014700323",
    "OtherIncome": "55410716078",
    "OtherExpenses": "612879664",
    "ProfitLossBeforeIncomeTax": "77936745002",
    "TaxBenefitExpenses": "-61207662819",
    "ProfitLossFromContinuingOperations": "16729082183",
    "ProfitLoss": "16729082183",
    "ComprehensiveIncome": "16729082183",
    "ProfitLossAttributableToParentEntity": "10153501620",
    "ProfitLossAttributableToNonControllingInterests": "6575580563",
    "ComprehensiveIncomeAttributableToParentEntity": "10153501620",
    "ComprehensiveIncomeAttributableToNonControllingInterests": "6575580563",
    "BasicEarningsLossPerShareFromContinuingOperations": "1.21",
    "BalanceBeforeRestatementAtBeginningOfPeriod": "9218792381077",
    "EquityPositionBeginningOfThePeriod": "9218792381077",
    "ProfitLossChangesInEquity": "16729082183",
    "EquityPositionEndOfThePeriod": "9235521463260",
    "ReceiptsFromCustomers": "6651288079733",
    "PaymentsToSuppliersForGoodsAndServices": "4711522529602",
    "PaymentsForSalariesAndAllowances": "107264181938",
    "CashGeneratedFromUsedInOperations": "1832501368193",
    "IncomeTaxesRefundedPaidFromOperatingActivities": "-58753434107",
    "NetCashFlowsReceivedFromUsedInOperatingActivities": "1773747934086",
    "ProceedsFromDisposalOfPropertyAndEquipment": "199193559",
    "PaymentsForAcquisitionOfPropertyAndEquipment": "5806152600",
    "PaymentsForAcquisitionOfLandForDevelopment": "1665000000",
    "WithdrawalPlacementOfShortTermInvestments": "-4491000000",
    "ProceedsOnSaleOfFinancialAssets": "79924430355",
    "PaymentsToAcquireFinancialAssets": "94271683070",
    "ProceedsFromSalesOfInterestsInJointVentures": "340559040610",
    "PaymentsForAcquisitionOfInterestsInJointVentures": "147310177808",
    "PaymentsForAcquisitionOfInterestsInAssociates": "7037000000",
    "InterestsReceivedFromInvestingActivities": "20136404676",
    "NetCashFlowsReceivedFromUsedInInvestingActivities": "188740862163",
    "ProceedsFromBankLoans": "1404914645716",
    "PaymentsOfBankLoans": "1193742660079",
    "PaymentsOfFinanceLeaseLiabilities": "2894243286",
    "InterestsPaidFromFinancingActivities": "251887181926",
    "NetCashFlowsReceivedFromUsedInFinancingActivities": "-43609439575",
    "NetIncreaseDecreaseInCashAndCashEquivalents": "1918879356674",
    "CashAndCashEquivalentsCashFlows": "6422611079533",
    "BasisOfPreparationOfConsolidatedFinancialStatementsTextBlock": "Laporan keuangan konsolidasian disusun dan disajikan berdasarkan asumsi kelangsungan usaha serta atas dasar akrual, kecuali laporan arus kas konsolidasian. Dasar pengukuran dalam penyusunan laporan keuangan konsolidasian ini adalah konsep biaya perolehan, kecuali beberapa akun tertentu yang didasarkan pengukuran lain sebagaimana dijelaskan dalam kebijakan akuntansi masing-masing akun tersebut. Biaya perolehan umumnya didasarkan pada nilai wajar imbalan yang diserahkan dalam pemerolehan aset. Laporan arus kas konsolidasian disajikan dengan metode langsung dengan mengelompokkan arus kas dalam aktivitas operasi, investasi dan pendanaan. Mata uang penyajian yang digunakan dalam penyusunan laporan keuangan konsolidasian ini adalah Rupiah, yang merupakan mata uang fungsional Grup. Setiap entitas di dalam Grup menetapkan mata uang fungsional sendiri dan unsur-unsur dalam laporan keuangan dari setiap entitas diukur berdasarkan mata uang fungsional tersebut.",
    "PrinciplesOfConsolidationTextBlock": "Laporan keuangan konsolidasian  mencakup laporan keuangan Grup seperti disebutkan pada (Catatan 1.c.)\n\nEntitas anak adalah entitas yang dikendalikan oleh Perusahaan, yakni Perusahaan terekspos, atau memiliki hak, atas imbal hasil variabel dari keterlibatannya dengan entitas dan memiliki kemampuan untuk memengaruhi imbal hasil tersebut melalui kemampuan kini untuk mengarahkan aktivitas relevan dari entitas (kekuasaan atas investee).\n\nKeberadaan dan dampak dari hak suara potensial dimana Perusahaan memiliki kemampuan praktis untuk melaksanakan (yakni hak substantif) dipertimbangkan \nsaat menilai apakah Perusahaan mengendalikan entitas lain.\n\nLaporan keuangan Grup mencakup hasil usaha, arus kas, aset dan liabilitas dari Perusahaan dan seluruh entitas anak yang, secara langsung dan tidak langsung, dikendalikan oleh Grup. Entitas anak dikonsolidasikan sejak tanggal efektif akuisisi, yaitu tanggal dimana Perusahaan secara efektif memperoleh pengendalian atas bisnis yang diakuisisi, sampai tanggal pengendalian berakhir.\nEntitas induk menyusun laporan keuangan konsolidasian dengan menggunakan kebijakan akuntansi yang sama untuk transaksi dan peristiwa lain dalam keadaan yang serupa. Seluruh transaksi, saldo, penghasilan, beban, dan arus kas dalam intrakelompok usaha terkait dengan transaksi antar entitas dalam kelompok usaha dieliminasi secara penuh.\n\nGrup mengatribusikan laba rugi dan setiap komponen dari penghasilan komprehensif lain kepada pemilik entitas induk dan kepentingan nonpengendali meskipun hal tersebut mengakibatkan kepentingan nonpengendali memiliki saldo defisit. Grup menyajikan kepentingan nonpengendali di ekuitas dalam laporan posisi keuangan konsolidasian, terpisah dari ekuitas pemilik entitas induk.\n\nPerubahan dalam bagian kepemilikan entitas induk pada entitas anak yang tidak mengakibatkan hilangnya pengendalian adalah transaksi ekuitas (yaitu transaksi dengan pemilik dalam kapasitasnya sebagai pemilik). Ketika proporsi ekuitas yang dimiliki oleh kepentingan nonpengendali berubah, Grup menyesuaikan jumlah tercatat kepentingan pengendali dan kepentingan nonpengendali untuk mencerminkan perubahan kepemilikan relatifnya dalam entitas anak. Selisih antara jumlah tercatat kepentingan nonpengendali yang disesuaikan dan nilai wajar dari jumlah yang diterima atau dibayarkan diakui langsung dalam ekuitas dan diatribusikan pada pemilik dari entitas induk.\n\nJika Grup kehilangan pengendalian, maka Grup:\na)\tMenghentikan pengakuan aset (termasuk goodwill) dan liabilitas entitas anak pada jumlah tercatatnya ketika pengendalian hilang;\nb)\tMenghentikan pengakuan jumlah tercatat setiap kepentingan nonpengendali pada entitas anak terdahulu ketika pengendalian hilang (termasuk setiap komponen penghasilan komprehensif lain yang diatribusikan pada kepentingan nonpengendali);\na)\tMengakui nilai wajar pembayaran yang diterima (jika ada) dari transaksi, peristiwa, atau keadaan \nyang mengakibatkan hilangnya pengendalian;\nc)\tMengakui sisa investasi pada entitas anak terdahulu pada nilai wajarnya pada tanggal hilangnya pengendalian;\nd)\tMereklasifikasi ke laba rugi, atau mengalihkan secara langsung ke saldo laba jika disyaratkan oleh SAK lain, jumlah yang diakui dalam penghasilan komprehensif lain dalam kaitan dengan entitas anak;\ne)\tMengakui perbedaan apapun yang dihasilkan sebagai keuntungan atau kerugian dalam laba rugi yang diatribusikan kepada entitas induk.",
    "CashAndCashEquivalentsTextBlock": "Kas dan setara kas termasuk kas, kas di bank (rekening giro), dan deposito berjangka yang jatuh tempo dalam jangka waktu tiga bulan atau kurang pada saat penempatan yang tidak digunakan sebagai jaminan atau tidak dibatasi penggunaannya. Pada laporan arus kas konsolidasian, kas dan setara kas mencakup kas, simpanan yang sewaktu-waktu bisa dicairkan dan investasi likuid jangka pendek lainnya dengan yang jatuh tempo dalam waktu tiga bulan atau kurang dan cerukan. Pada laporan posisi Keuangan konsolidasian, cerukan disajikan bersama sebagai pinjaman dalam liabilitas jangka pendek",
    "InventoriesTextBlock": "Persediaan dinyatakan sebesar nilai yang lebih rendah antara biaya perolehan dan nilai realisasi bersih. Biaya perolehan ditentukan dengan menggunakan metode pertama-masuk, pertama keluar (). Biaya perolehan barang jadi dan pekerjaan dalam proses terdiri dari bahan baku, tenaga kerja langsung, biaya langsung lainnya dan biaya overhead produksi (berdasarkan kapasitas normal operasi). Persediaan tidak mencakup biaya pinjaman. Nilai realisasi bersih adalah estimasi harga penjualan dalam kegiatan usaha biasa, dikurangi beban penjualan bervariasi. Persediaan beton pracetak diakui berdasarkan nilai terendah antara harga perolehan (menggunakan metode rata-rata tertimbang) dan nilai realisasi bersih.",
    "InvestmentPropertyTextBlock": "Properti investasi adalah properti (tanah atau bangunan atau bagian dari suatu bangunan atau kedua-duanya) yang dikuasai oleh pemilik atau penyewa melalui sewa pembiayaan untuk menghasilkan sewa atau untuk kenaikan nilai atau kedua-duanya, dan tidak untuk digunakan dalam produksi atau penyediaan barang atau jasa atau untuk tujuan administratif; atau dijual dalam kegiatan usaha sehari-hari. Properti investasi diakui sebagai aset jika dan hanya jika besar kemungkinan manfaat ekonomis masa depan yang terkait dengan properti investasi akan mengalir ke entitas; dan biaya perolehan properti investasi dapat diukur dengan andal. Properti investasi pada awalnya diukur sebesar biaya perolehan, meliputi harga harga pembelian dan setiap pengeluaran yang diatribusikan secara langsung (biaya jasa hukum, pajak pengalihan properti, dan biaya transaksi lain). Biaya transaksi termasuk dalam pengukuran awal tersebut. Properti investasi yang sedang dalam pengembangan ulang untuk penggunaan lebih lanjut sebagai properti investasi atau ketika pasar menjadi kurang aktif tetap dicatat sebesar nilai wajarnya. Properti investasi dalam konstruksi diukur secara andal, tetapi Grup mengharapkankan nilai wajarnya dapat diukur secara andal ketika konstruksi selesai, diukur senilai biaya dikurangi penurunan nilai sampai nilai wajarnya dapat diukur secara andal atau konstruksi diselesaikan  yang mana yang lebih awal. Setelah pengakuan awal, Grup memilih menggunakan model nilai wajar dan mengukur seluruh properti investasi berdasarkan nilai wajar. Keuntungan atau kerugian yang timbul dari perubahan nilai wajar properti investasi diakui dalam laba rugi pada periode terjadinya. Penentuan nilai wajar investasi didasarkan pada penilaian oleh penilai independen yang mempunyai kualifikasi profesional yang telah diakui dan relevan serta memiliki pengalaman terkini di lokasi dan kategori properti investasi yang dinilai. Pengalihan ke properti investasi dilakukan jika, dan hanya jika, terdapat perubahan penggunaan yang ditunjukkan dengan berakhirnya pemakaian oleh pemilik dan dimulainya sewa operasi kepada pihak lain. Pengalihan dari properti investasi dilakukan jika, dan hanya jika, terdapat perubahan penggunaan yang ditunjukkan dengan dimulainya penggunaan oleh pemilik dan dimulainya pengembangan untuk dijual. Properti investasi dihentikan pengakuannya pada saat dilepaskan atau ketika tidak digunakan lagi secara permanen dan tidak memiliki manfaat ekonomis masa depan yang diperkirakan dari pelepasannya. Keuntungan atau kerugian yang timbul dari penghentian atau pelepasan ditentukan dari selisih antara hasil neto pelepasan dan jumlah tercatat aset, dan diakui dalam laba rugi pada periode terjadinya penghentian atau pelepasan.",
    "FixedAssetsTextBlock": "Aset tetap pada awalnya diakui sebesar biaya perolehan yang meliputi harga perolehannya dan setiap biaya yang dapat diatribusikan langsung untuk membawa aset ke kondisi dan lokasi yang diinginkan agar aset siap digunakan sesuai intensi manajemen. Biaya-biaya setelah pengakuan awal diakui sebagai bagian nilai tercatat aset atau sebagai aset yang terpisah, sebagaimana mestinya, hanya jika kemungkinan besar Grup mendapat manfaat ekonomis di masa depan berkenan dengan aset tersebut dan biaya perolehan aset dapat diukur dengan andal. Nilai tercatat dari komponen yang diganti dihapuskan. Biaya perbaikan dan pemeliharaan dan pemeliharaan dibebankan ke dalam laporan laba rugi dalam periode keuangan ketika biaya-biaya tersebut terjadi. Biaya legal awal untuk mendapatkan hak legal diakui sebagai bagian biaya akuisisi tanah, biaya-biaya tersebut tidak disusutkan. Biaya terkait dengan pembaruan hak atas tanah diakui sebagai aset takberwujud dan diamortisasi sepanjang umur hukum hak. Apabila relevan, biaya perolehan juga dapat mencakup estimasi awal biaya pembongkaran dan pemindahan aset tetap dan restorasi lokasi aset tetap, kewajiban tersebut timbul ketika aset tetap diperoleh atau sebagai konsekuensi penggunaan aset tetap selama periode tertentu untuk tujuan selain untuk memproduksi persediaan selama periode tersebut. Setelah pengakuan awal, aset tetap kecuali tanah dinyatakan sebesar biaya perolehan dikurangi akumulasi penyusutan dan akumulasi rugi penurunan nilai. Penyusutan aset tetap dimulai pada saat aset tersebut siap untuk digunakan sesuai maksud penggunaannya dan dihitung dengan menggunakan metode garis lurus berdasarkan estimasi umur manfaat ekonomis aset (bangunan 10-25th, peralatan proyek 3-10th, kendaraan 3-6th, peralatan 2-5th). Bangunan dalam penyelesaian disajikan sebagai bagian dalam aset tetap dan dinyatakan sebesar biaya perolehan. Semua biaya, termasuk biaya pinjaman, yang terjadi sehubungan dengan pembangunan aset tersebut dikapitalisasi sebagai bagian dari biaya perolehan aset tetap dalam penyelesaian. Akumulasi biaya perolehan yang akan dipindahkan ke masing-masing aset tetap yang bersangkutan pada saat aset tersebut selesai dikerjakan atau siap digunakan dan disusutkan sejak beroperasi. Pada akhir tahun buku pelaporan, Grup melakukan penelaahan berkala atas masa manfaat ekonomis aset, nilai residu, metode penyusutan, dan sisa umur pemakaian berdasarkan kondisi teknis. Grup memilih menggunakan model revaluasi untuk tanah yang nilai wajarnya dapat diukur secara andal, yakni nilai wajar pada tanggal revaluasi dikurangi akumulasi penurunan nilai setelah tanggal revaluasi. Jika jumlah tercatat aset meningkat akibat revaluasi, maka kenaikan tersebut diakui dalam penghasilan komprehensif lain dan terakumulasi dalam ekuitas pada bagian surplus revaluasi.Akan tetapi, kenaikan tersebut diakui dalam laba rugi hingga sebesar jumlah penurunan nilai aset yang sama akibat revaluasi yang pernah diakui sebelumnya dalam laba rugi. Jika jumlah tercatat aset turun akibat revaluasi, maka penurunan tersebut diakui dalam laba rugi. Akan tetapi, penurunan nilai tersebut diakui dalam penghasilan komprehensif lain sepanjang tidak melebihi saldo surplus revaluasi untuk aset tersebut. Penurunan nilai yang diakui dalam penghasilan komprehensif lain tersebut mengurangi jumlah akumulasi dalam ekuitas pada bagian surplus revaluasi. Revaluasi dilakukan dengan keteraturan yang cukup regular untuk memastikan bahwa jumlah tercatat tidak berbeda secara material dengan jumlah yang ditentukan dengan menggunakan nilai wajar pada akhir periode pelaporan. Jumlah tercatat aset tetap dihentikan pengakuannya saat dilepaskan atau saat tidak ada manfaat ekonomis masa depan yang diharapkan dari penggunaan atau pelepasannya. Laba atau rugi yang timbul dari penghentian pengakuan aset (dihitung sebagai perbedaan antara jumlah neto hasil pelepasan dan nilai tercatat dari aset) dikreditkan atau dibebankan pada laporan laba rugi dan penghasilan komprehensif lain konsolidasian tahun aset tersebut dihentikan pengakuannya.",
    "UndevelopedLandTextBlock": "Aset real estat, yang terutama terdiri dari tanah dalam pematangan, unit bangunan siap jual dan unit bangunan dalam penyelesaian, dinyatakan sebesar nilai yang lebih rendah antara biaya perolehan dan nilai realisasi neto. Biaya perolehan Aset real estat, yang terutama terdiri dari tanah dalam pematangan, unit bangunan siap jual dan unit bangunan dalam penyelesaian, dinyatakan sebesar nilai yang lebih rendah antara biaya perolehan dan nilai realisasi neto. Biaya perolehan ditentukan dengan menggunakan metode rata-rata. Biaya perolehan atas tanah dalam pematangan termasuk biaya pengembangan dan pematangan tanah. \n\nNilai realisasi neto adalah taksiran harga penjualan dalam kegiatan usaha normal yang didasarkan pada harga pasar pada tanggal pelaporan dan didiskontokan untuk nilai waktu uang, jika material, dikurangi taksiran biaya penyelesaian dan taksiran biaya untuk melaksanakan penjualan. \n\nPenurunan nilai aset real estat ditetapkan untuk mengurangi nilai tercatat aset real estat ke nilai realisasi neto dan penurunannya diakui sebagai rugi pada laporan laba rugi dan penghasilan komprehensif lain konsolidasian periode/ tahun yang bersangkutan.\n\nBiaya perolehan atas unit bangunan terdiri dari biaya aktual konstruksi. Beban keuangan atas pinjaman bank dan fasilitas pinjaman lainnya yang diperoleh yang dapat diatribusikan langsung dengan pembelian; pengembangan dan pematangan tanah; serta konstruksi aset real estat akan dikapitalisasi. Tanah yang dimiliki oleh Grup untuk pengembangan di masa yang akan datang, disajikan sebagai  untuk Pengembangan di bagian aset di laporan posisi keuangan konsolidasian. Pada saat dimulainya pengembangan dan pembangunan infrastruktur, nilai tanah tersebut akan diklasifikasikan sebagai persediaan, properti investasi atau aset tetap, mana yang lebih sesuai. Selisih lebih nilai tercatat aset real estat atas estimasi jumlah terpulihkannya diakui sebagai rugi penurunan nilai sebagai  atas Penurunan Nilai Aset Real Estat dalam laporan laba rugi dan penghasilan komprehensif lain.",
    "ImpairmentOfNon-FinancialAssetsTextBlock": "Aset yang memiliki masa manfaat yang tidak terbatas  misalnya goodwill atau aset tak berwujud yang tidak siap untuk digunakan  tidak diamortisasi namun diuji penurunan nilainya setiap tahun, atau lebih sering apabila terdapat peristiwa atau perubahan pada kondisi yang mengindikasikan kemungkinan penurunan nilai. Aset yang tidak diamortisasi diuji ketika terdapat indikasi bahwa nilai tercatatnya mungkin  Aset yang memiliki masa manfaat yang tidak terbatas  misalnya goodwill atau aset tak berwujud yang tidak siap untuk digunakan  tidak diamortisasi namun diuji penurunan nilainya setiap tahun, atau lebih sering apabila terdapat peristiwa atau perubahan pada kondisi yang mengindikasikan kemungkinan penurunan nilai. Aset yang tidak diamortisasi diuji ketika terdapat indikasi bahwa nilai tercatatnya mungkin tidak dapat dipulihkan. Penurunan nilai diakui jika nilai tercatat aset melebihi jumlah terpulihkan. Jumlah terpulihkan adalah yang lebih tinggi antara nilai wajar aset dikurangi biaya untuk menjual dan nilai pakai aset. Dalam menentukan penurunan nilai, aset dikelompokkan pada tingkat yang paling rendah dimana terdapat arus kas masuk yang dapat diidentifikasi, yang sebagian besar tidak tergantung pada arus masuk kas dari aset lain atau kelompok aset (unit penghasil kas). Aset nonkeuangan selain goodwill yang mengalami penurunan nilai diuji setiap tanggal pelaporan untuk menentukan apakah terdapat kemungkinan pemulihan penurunan nilai. Pada setiap akhir periode pelaporan, Grup menilai apakah terdapat indikasi aset mengalami penurunan nilai. Jika terdapat indikasi tersebut, Grup mengestimasi jumlah terpulihkan aset tersebut. Jumlah terpulihkan ditentukan atas suatu aset individual, dan jika tidak memungkinkan, Grup menentukan jumlah terpulihkan dari unit penghasil kas dari aset tersebut. Jumlah terpulihkan adalah jumlah yang lebih tinggi antara nilai wajar dikurangi biaya pelepasan dengan nilai pakainya. Nilai pakai adalah nilai kini dari arus kas yang diharapkan akan diterima dari aset atau unit penghasil kas. Nilai kini dihitung dengan menggunakan tingkat diskonto sebelum pajak yang mencerminkan nilai waktu uang dan risiko spesifik atas aset atau unit yang penurunan nilainya. Jika, dan hanya jika, jumlah terpulihkan aset lebih kecil dari jumlah tercatatnya, maka jumlah tercatat aset diturunkan menjadi sebesar jumlah terpulihkan. Penurunan tersebut adalah rugi penurunan nilai dan segera diakui dalam laba rugi. Rugi penurunan nilai yang telah diakui dalam periode sebelumnya untuk aset selain goodwill dibalik jika, dan hanya jika, terdapat perubahan estimasi yang digunakan untuk menentukan jumlah terpulihkan aset tersebut sejak rugi penurunan nilai terakhir diakui. Jika demikian, jumlah tercatat aset dinaikan ke jumlah terpulihkannya. Kenaikan ini merupakan suatu pembalikan rugi penurunan nilai.",
    "RevenueAndExpenseRecognitionTextBlock": "Dalam menentukan pengakuan pendapatan, Grup melakukan analisa transaksi melalui lima langkah analisa berikut :\n1. Mengidentifikasi kontrak dengan pelanggan, dimana Grup mencatat kontrak dengan pelanggan hanya jika seluruh kriteria berikut terpenuhi: Kontrak telah disetujui oleh para pihak dalam kontrak; kelompok Usaha dapat mengindentifikasi hak dari para pihak dan jangka waktu pembayaran atas barang yang akan dialihkan; Kontrak memiliki substansi komersial; dan Kemungkinan besar Kelompok Usaha akan menerima imbalan atas barang yang dialihkan;\n2. Mengindentifikasi kewajiban pelaksanaan dalam kontrak, untuk menyerahkan barang atau jasa yang memiliki karakteristik yang berbeda ke pelanggan.\n3. Menentukan harga transaksi, setelah dikurangi diskon, retur, insentif penjualan, pajak penjualan barang mewah, pajak pertambahan nilai dan pungutan ekspor, yang berhak diperoleh suatu entitas sebagai kompensasi atas diserahkannya barang atau jasa yang dijanjikan ke pelanggan.\n4. Mengalokasikan harga transaksi pada setiap kewajiban pelaksanaan, dengan menggunakan dasar harga jual dari setiap barang atau jasa yang dijanjikan di kontrak\n5. Mengakui pendapatan ketika kewajiban pelaksanaan telah dipenuhi (pada suatu waktu tertentu atau sepanjang waktu).\nKewajiban pelaksanaan dapat dipenuhi dengan cara sebagai berikut:\nSuatu waktu tertentu (umumnya janji untuk menyerahkan barang ke pelanggan); atau Sepanjang waktu (umumnya janji untuk menyerahkan jasa ke pelanggan). Untuk kewajiban pelaksanaan yang dipenuhi sepanjang waktu, Grup memilih ukuran penyelesaian yang sesuai untuk penentuan jumlah pendapatan yang harus diakui karena telah terpenuhinya kewajiban pelaksanaan. \nSuatu kewajiban pelaksanaan dipenuhi pada suatu waktu tertentu kecuali jika memenuhi salah satu kriteria berikut, dalam hal ini dipenuhi dari sepanjang waktu:\n Pelanggan secara bersamaan menerima dan menggunakan manfaat yang diberikan oleh pelaksanaan Grup sebagaimana yang dilakukan Grup;\n Pelaksanaan Grup menciptakan atau meningkatkan aset yang dikendalikan pelanggan saat aset itu dibuat atau ditingkatkan; dan\n Pelaksanaan Grup tidak menciptakan aset dengan penggunaan alternatif untuk Grup dan Grup memiliki hak yang dapat diberlakukan atas pembayaran untuk pelaksanaan yang diselesaikan hingga saat ini. Kriteria berikut ini juga harus dipenuhi sebelum pendapatan diakui.\nPendapatan Konstruksi dan Biaya Konstruksi\nPendapatan yang berhubungan dengan kontrak konstruksi diakui sepanjang waktu yang dicatat dengan menggunakan metode persentase penyelesaian. Dengan metode ini, pendapatan yang diakui setara dengan estimasi terbaru dari total nilai kontrak dikalikan dengan tingkat penyelesaian sebenarnya yang ditentukan dengan mengacu pada hasil survei atas pekerjaan yang telah dilaksanakan. Pendapatan kontrak terdiri dari jumlah pendapatan semula yang disetujui dalam kontrak dan penyimpangan dalam pekerjaan kontrak, klaim, dan pembayaran insentif sepanjang hal ini memungkinkan untuk menghasilkan pendapatan dan dapat diukur dengan andal. Jika adanya kemungkinan bahwa kontrak akan menghasilkan kerugian pada saat penyelesaian kontrak, penyisihan atas kerugian yang diperkirakan hingga penyelesaian kontrak diakui sebagai penyisihan kini pada laporan keuangan konsolidasian. Kerugian diakui secara penuh ketika dapat diukur secara andal, terlepas dari tingkat penyelesaian. \nBiaya kontrak yang tidak mungkin dipulihkan diakui segera sebagai beban tahun berjalan pada laba rugi.\nBeban langsung dan beban tidak langsung proyek yang dapat dialokasikan ke suatu proyek tertentu, diakui sebagai beban pada proyek yang bersangkutan, sedangkan beban yang tidak dapat didistribusikan atau tidak dapat dialokasikan ke aktivitas proyek menjadi beban nonproyek (beban usaha). \nPenjualan Barang \nPendapatan dari penjualan barang diakui pada suatu waktu tertentu saat pengendalian atas barang telah berpindah kepada pelanggan, yaitu pada saat penyerahan barang, atau dalam hal barang disimpan di gudang Grup atas permintaan pelanggan.\n\nPenjualan Aset Real Estat\nPendapatan dari penjualan aset real estat diakui pada suatu waktu tertentu saat pengendalian atas aset telah berpindah kepada pelanggan, yaitu saat terjadi penyerahan aset kepada pembeli.\n\nPengakuan Beban\nBeban diakui pada saat terjadinya (basis akrual), kecuali merupakan aset yang terkait dengan aktivitas kontrak masa depan. Biaya yang secara langsung berhubungan dengan kontrak, menghasilkan sumber daya untuk memenuhi kontrak ( untuk memenuhi) atau penambahan untuk mendapatkan kontrak ( untuk memperoleh) dan diharapkan dapat dipulihkan. Beban tersebut dengan demikian memenuhi syarat kapitalisasi berdasarkan PSAK 72: Pendapatan dari Kontrak dengan Pelanggan dan dicatat sebagai aset lancar lainnya. Beban tersebut diamortisasi dengan cara sistematis sejalan dengan penyerahan barang atau jasa yang terkait dengan aset tersebut.",
    "ForeignCurrencyTranslationTextBlock": "a.\tMata uang fungsional dan penyajian\nItem-item yang disertakan dalam laporan keuangan setiap entitas anggota Grup diukur menggunakan mata uang yang sesuai dengan lingkungan ekonomi utama di mana entitas beroperasi ( uang fungsional). Laporan keuangan konsolidasian disajikan dalam Rupiah yang merupakan mata uang fungsional dan penyajian Grup.\nb.\tTransaksi dan saldo\nTransaksi dalam mata uang asing dijabarkan ke dalam mata uang Rupiah dengan menggunakan kurs yang berlaku pada tanggal transaksi. Pada setiap tanggal pelaporan, aset dan liabilitas moneter dalam mata uang asing dijabarkan ke dalam mata uang Rupiah menggunakan kurs penutup. Kurs yang digunakan sebagai acuan adalah kurs yang dikeluarkan oleh Bank Indonesia.\nKeuntungan dan kerugian selisih kurs yang timbul dari penyelesaian transaksi dalam mata uang asing dan dari penjabaran aset dan liabilitas moneter dalam mata uang asing diakui di dalam laporan laba rugi, kecuali jika ditangguhkan di dalam ekuitas sebagai lindung nilai arus kas dan lindung nilai investasi neto dalam kegiatan usaha luar negeri bersih yang memenuhi syarat.\nKeuntungan dan kerugian selisih kurs yang berhubungan dengan pinjaman, serta kas dan setara kas disajikan pada laporan laba rugi sebagai  atau biaya keuangan. Keuntungan atau kerugian neto selisih kurs lainnya disajikan pada laporan laba rugi dan penghasilan komprehensif lain sebagai (kerugian)/keuntungan lain-lain.\nPerubahan nilai wajar efek moneter yang didenominasikan dalam mata uang asing yang disajikan perubahan niai wajarnya pada penghasilan komprehensif lain dianalisa antara selisih pejabaran yang timbul dari perubahan biaya perolehan diamortisasi efek dan perubahan nilai tercatat efek lainnya. \nSelisih penjabaran terkait dengan perubahan biaya perolehan diamortisasi diakui di dalam laporan laba rugi, dan perubahan nilai tercatat lainnya diakui pada laba komprehensif lainnya.\nSelisih penjabaran aset dan liabilitas keuangan nonmoneter yang dicatat pada nilai wajar diakui sebagai bagian keuntungan atau kerugian perubahan nilai wajar.\nSebagai contoh, selisih penjabaran aset dan liabilitas keuangan nonmoneter seperti ekuitas yang dimiliki dan dicatat pada nilai wajar melalui laporan laba rugi diakui pada laporan laba rugi sebagai bagian keuntungan atau kerugian nilai wajar dan selisih penjabaran aset nonmoneter seperti ekuitas yang disajikan perubahan nilai wajarnya pada penghasilan komprehensif lain.\nTransaksi-transaksi selama tahun berjalan dalam mata uang asing dicatat dalam Rupiah dengan kurs spot antara Rupiah dan valuta asing pada tanggal transaksi. Pada akhir periode pelaporan, pos moneter dalam mata uang asing dijabarkan ke dalam Rupiah menggunakan kurs penutup, yaitu kurs tengah Bank Indonesia pada 31 Desember 2022 dan 2021 sebagai berikut: 2022 : USD sebesar 15,731;Yen Jepang sebesar 117.57; dan Euro sebesar 16,713 sedangkan tahun 2021 : USD sebesar 14,269;Yen Jepang sebesar 123.89; dan Euro sebesar 16,127.\nSelisih kurs yang timbul dari penyelesaian pos moneter dan dari penjabaran pos moneter dalam mata uang asing diakui dalam laba rugi.",
    "TransactionsWithRelatedPartiesTextBlock": "Pihak berelasi adalah orang atau entitas yang terkait dengan Grup (sebagai entitas pelapor) yang meliputi:\na.\tOrang atau anggota keluarga terdekat mempunyai relasi dengan entitas pelapor jika orang tersebut:\n\tMemiliki pengendalian atau pengendalian bersama atas entitas pelapor;\n\tMemiliki pengaruh signifikan atas entitas pelapor; atau\n\tPersonil manajemen kunci entitas pelapor atau entitas induk entitas pelapor.\nb.\tSatu entitas berelasi dengan entitas pelapor jika memenuhi salah satu hal berikut:\n\tEntitas dan entitas pelapor adalah anggota dari grup yang sama (artinya entitas induk, entitas anak, dan entitas anak berikutnya terkait dengan entitas lain);\n\tSuatu entitas adalah entitas asosiasi atau ventura bersama dari entitas lain (atau entitas asosiasi atau ventura bersama yang merupakan anggota suatu grup, yang mana entitas lain tersebut adalah anggotanya);\n\tKedua entitas tersebut adalah ventura bersama dari pihak ketiga yang sama;\n\tSatu entitas adalah ventura bersama dari entitas ketiga dan entitas yang lain adalah entitas asosiasi dari entitas ketiga;\n\tEntitas tersebut adalah suatu program imbalan pascakerja untuk imbalan kerja dari salah satu entitas pelapor atau entitas yang terkait dengan entitas pelapor. Jika entitas pelapor adalah entitas yang menyelenggarakan program tersebut, maka entitas sponsor juga berelasi dengan entitas pelapor;\n\tEntitas yang dikendalikan atau dikendalikan bersama oleh orang yang diidentifkasi dalam huruf (a);\n\tOrang yang diidentifikasi dalam huruf (a) (i) memiliki pengaruh signifikan atas entitas atau personil manajemen kunci entitas (atau entitas induk dari entitas);\n\tEntitas, atau anggota dari kelompok yang mana entitas merupakan bagian dari kelompok tersebut, menyediakan jasa personil manajemen kunci kepada entitas pelapor atau kepada entitas induk dari entitas pelapor.\nEntitas yang berelasi dengan pemerintah adalah entitas yang dikendalikan, dikendalikan bersama, atau dipengaruhi oleh pemerintah. Pemerintah mengacu kepada pemerintah, instansi pemerintah dan badan yang serupa baik lokal, nasional maupun internasional.\nSeluruh transaksi dan saldo yang signifikan dengan pihak berelasi diungkapkan dalam Catatan yang relevan.",
    "IncomeTaxesTextBlock": "Beban pajak adalah jumlah gabungan pajak kini dan pajak tangguhan yang diperhitungkan dalam menentukan laba rugi pada suatu periode. \n\nPajak kini dan pajak tangguhan diakui dalam laba rugi, kecuali pajak penghasilan yang timbul dari transaksi atau peristiwa yang diakui dalam penghasilan komprehensif lain atau secara langsung di ekuitas. Dalam hal ini, pajak tersebut masing-masing diakui dalam penghasilan komprehensif lain atau ekuitas.\n\nJumlah pajak kini untuk periode berjalan dan periode sebelumnya yang belum dibayar diakui sebagai liabilitas. Jika jumlah pajak yang telah dibayar untuk periode berjalan dan periode-periode sebelumnya melebihi jumlah pajak yang terutang untuk periode tersebut, maka kelebihannya diakui sebagai aset. Liabilitas (aset) pajak kini untuk periode berjalan dan periode sebelumnya diukur sebesar jumlah yang diperkirakan akan dibayar kepada (direstitusi dari) otoritas perpajakan, yang dihitung menggunakan tarif pajak (dan undang-undang pajak) yang telah berlaku atau secara substantif telah berlaku pada akhir periode pelaporan.\n\nManfaat terkait dengan rugi pajak yang dapat ditarik untuk memulihkan pajak kini dari periode sebelumnya diakui sebagai aset.\n\nAset pajak tangguhan diakui untuk akumulasi rugi pajak belum dikompensasi dan kredit pajak belum dimanfaatkan sepanjang kemungkinan besar laba kena pajak masa depan akan tersedia untuk dimanfaatkan dengan rugi pajak belum dikompensasi dan kredit pajak belum dimanfaatkan.\n\nSeluruh perbedaan temporer kena pajak diakui sebagai liabilitas pajak tangguhan, kecuali perbedaan temporer kena pajak yang berasal dari:\na.\tpengakuan awal goodwill; atau\nb.\tpengakuan awal aset atau liabilitas dari transaksi yang bukan kombinasi bisnis dan pada saat transaksi tidak mempengaruhi laba akuntansi atau laba kena pajak (rugi pajak).\n\nAset pajak tangguhan diakui untuk seluruh perbedaan temporer dapat dikurangkan sepanjang kemungkinan besar laba kena pajak akan tersedia sehingga perbedaan temporer dapat dimanfaatkan untuk mengurangi laba dimaksud, kecuali jika aset pajak tangguhan timbul dari pengakuan awal aset atau pengakuan awal liabilitas dalam transaksi yang bukan kombinasi bisnis dan pada saat transaksi tidak mempengaruhi laba akuntansi atau laba kena pajak (rugi pajak).\n\nPajak tangguhan diukur dengan menggunakan tarif pajak yang diperkirakan berlaku ketika aset dipulihkan atau liabilitas diselesaikan, berdasarkan tarif pajak (dan peraturan pajak) yang telah berlaku atau secara substantif telah berlaku pada akhir periode pelaporan. \n\nPengukuran aset dan liabilitas pajak tangguhan mencerminkan konsekuensi pajak yang sesuai dengan cara Grup memperkirakan, pada akhir periode pelaporan, untuk memulihkan atau menyelesaikan jumlah tercatat aset dan liabilitasnya.\n\nJumlah tercatat aset pajak tangguhan ditelaah ulang pada akhir periode pelaporan. Grup mengurangi jumlah tercatat aset pajak tangguhan jika kemungkinan besar laba kena pajak tidak lagi tersedia dalam jumlah yang memadai untuk mengompensasikan sebagian atau seluruh aset pajak tangguhan tersebut. Setiap pengurangan tersebut dilakukan pembalikan atas aset pajak tangguhan hingga kemungkinan besar laba kena pajak yang tersedia jumlahnya memadai.\n\nGrup melakukan saling hapus aset pajak tangguhan dan liabilitas pajak tangguhan jika dan hanya jika:\na.\tGrup memiliki hak yang dapat dipaksakan secara hukum untuk melakukan saling hapus aset pajak kini terhadap liabilitas pajak kini; dan\nb.\tAset pajak tangguhan dan liabilitas pajak tangguhan terkait dengan pajak penghasilan yang dikenakan oleh otoritas perpajakan yang sama atas:\ni.\tentitas kena pajak yang sama; atau\nii.\tentitas kena pajak yang berbeda yang bermaksud untuk memulihkan aset dan liabilitas pajak kini dengan dasar neto, atau merealisasikan aset dan menyelesaikan liabilitas secara bersamaan, pada setiap periode masa depan dimana jumlah signifikan atas aset atau liabilitas pajak tangguhan diperkirakan untuk diselesaikan atau dipulihkan.\n\nGrup melakukan saling hapus atas aset pajak kini dan liabilitas pajak kini jika dan hanya jika, Grup:\na.\tmemiliki hak yang dapat dipaksakan secara hukum untuk melakukan saling hapus atas jumlah yang diakui; dan\nb.\tbermaksud untuk menyelesaikan dengan dasar neto atau merealisasikan aset dan menyelesaikan liabilitas secara bersamaan.",
    "ProvisionsTextBlock": "Provisi diakui ketika Grup memiliki kewajiban kini (baik bersifat hukum maupun konstruktif) sebagai akibat peristiwa masa lalu, kemungkinan besar Grup diharuskan menyelesaikan kewajiban dan estimasi andal mengenai jumlah kewajiban tersebut dapat dibuat.\n\nJumlah yang diakui sebagai provisi merupakan estimasi terbaik dari pertimbangan yang diperlukan \nuntuk menyelesaikan kewajiban kini \npada akhir periode pelaporan, \ndengan mempertimbangkan risiko \ndan ketidakpastian yang meliputi kewajibannya. Apabila suatu provisi diukur menggunakan arus kas yang diperkirakan untuk menyelesaikan kewajiban kini, maka nilai tercatatnya adalah nilai kini dari arus kas. \n\n\n\nKetika beberapa atau seluruh manfaat ekonomi untuk penyelesaian provisi yang diharapkan dapat dipulihkan dari pihak ketiga, piutang diakui sebagai aset apabila terdapat kepastian bahwa penggantian akan diterima dan jumlah piutang dapat diukur secara andal.",
    "EmployeeBenefitsTextBlock": "Imbalan Kerja Jangka Pendek\nLiabilitas untuk upah dan gaji, termasuk imbalan nonmoneter dan akumulasi cuti sakit yang akan diselesaikan dalam waktu  \n12 bulan setelah akhir dari periode ketika pekerja memberikan jasa yang berhubungan diakui hingga jasa yang diberkan hingga  akhir dari periode pelaporan dan dihitung  pada jumlah yang diperkirakan akan dibayar ketika liabilitas diselesaikan. Liabilitas dipresentasikan sebagai kewajiban imbalan kerja masa kini pada laporan posisi keuangan.\n\n\nImbalan Pascakerja\nEntitas-entitas di dalam Grup mengoperasikan berbagai skema pensiun. Grup memiliki program imbalan pasti dan iuran pasti. Program iuran pasti merupakan program pensiun dimana Grup membayar sejumlah iuran tertentu kepada entitas (dana) yang terpisah. Grup tidak memiliki kewajiban hukum atau konstruktif untuk membayar iuran lebih lanjut jika entitas tersebut tidak memiliki aset yang cukup untuk membayar seluruh imbalan atas jasa yang diberikan pekerja pada periode berjalan maupun periode lalu. Program imbalan pasti adalah program pensiun yang bukan merupakan program iuran pasti. Pada umumnya, program imbalan pasti ditentukan berdasarkan jumlah imbalan pensiun yang akan diterima seorang pekerja pada saat pensiun, biasanya tergantung oleh satu faktor atau lebih, misalnya usia, masa bekerja dan kompensasi.\n\n\n\nSehubungan dengan program imbalan pasti, liabilitas diakui pada laporan posisi keuangan sebesar nilai kini kewajiban imbalan pasti pada akhir periode pelaporan dikurangi nilai wajar aset program. Kewajiban imbalan pasti dihitung setiap tahun oleh aktuaris yang independen dengan menggunakan metode projected unit credit. Nilai kini kewajiban imbalan pasti ditentukan dengan mendiskontokan arus kas keluar yang diestimasi dengan menggunakan tingkat bunga Obligasi Pemerintah (dikarenakan saat ini tidak ada pasar aktif untuk obligasi Grup yang berkualitas tinggi) yang didenominasikan dalam mata uang dimana imbalan akan dibayarkan dan memiliki jangka waktu jatuh tempo mendekati jangka waktu kewajiban pensiun.\n\nBiaya bunga bersih dihitung dengan menerapkan tingkat diskonto terhadap saldo bersih kewajiban imbalan pasti dan nilai wajar aset program. Biaya ini termasuk dalam beban imbalan kerja dalam laporan laba rugi.\n\nKeuntungan dan kerugian atas pengukuran kembali yang timbul dari penyesuaian dan perubahan dalam asumsi-asumsi aktuarial langsung diakui seluruhnya melalui laporan laba rugi dan penghasilan komprehensif lain pada saat terjadinya. Keuntungan dan kerugian ini termasuk didalam saldo laba pada laporan perubahan ekuitas dan pada laporan posisi keuangan.\n\nPerubahan nilai kini atas kewajiban imbalan pasti yang timbul dari amendemen rencana atau pembatasan langsung diakui dalam laporan laba rugi dan penghasilan komprehensif lain sebagai biaya jasa lalu.\n\nUntuk program iuran pasti, Grup membayar iuran program pensiun baik karena diwajibkan, berdasarkan kontrak atau sukarela. Namun karena Undang-Undang Ketenagakerjaan No. 13 tahun 2003 mengharuskan entitas membayar jumlah tertentu kepada para pekerja yang telah memasuki usia pensiun yang ditentukan berdasarkan masa kerja, Grup rentan terhadap kemungkinan untuk membayar kekurangan apabila iuran kumulatif kurang dari jumlah tertentu. Sebagai akibatnya untuk tujuan pelaporan keuangan, program iuran pasti secara efektif diberlakukan seolah-olah sebagai program imbalan pasti.\n\nUang Masa Persiapan Pensiun (UMPP)\nBeberapa entitas di dalam Grup memberikan imbalan bagi karyawan tetap yang memasuki usia pensiun. Imbalan ini biasanya diberikan kepada pekerja yang tetap bekerja sampai usia pensiun dan memenuhi masa kerja minimum. Biaya yang diharapkan timbul atas imbalan ini diakru selama masa kerja dengan menggunakan metode projected unit credit. Kewajiban ini dinilai setiap tahun oleh aktuaris independen yang memenuhi syarat.\n\n\nProgram Cincin Emas\nPerusahaan sebagai Pemberi Kerja, memberikan penghargaan berupa Cincin Emas kepada pegawai yang sudah memenuhi kriteria dan mekanisme untuk mendapatkan Cincin Emas sesuai Perjanjian Kerja Bersama (PKB). Biaya yang diharapkan timbul atas imbalan ini diakru selama masa kerja dengan menggunakan metode projected unit credit. Kewajiban ini dinilai setiap tahun oleh aktuaris independen yang memenuhi syarat.\n\nPesangon\nGrup mengakui pesangon sebagai liabilitas dan beban pada tanggal yang lebih awal diantaranya:\na.\tKetika Grup tidak dapat lagi menarik tawaran atas imbalan tersebut; dan\nb.\tKetika Grup mengakui biaya untuk restrukturisasi yang berada dalam ruang lingkup PSAK 57 dan melibatkan pembayaran pesangon.\n\nGrup mengukur pesangon pada saat pengakuan awal, dan mengukur dan mengakui perubahan selanjutnya, sesuai dengan sifat imbalan kerja.",
    "EarningsPerShareTextBlock": "Laba per saham dasar dihitung dengan membagi laba atau rugi yang dapat diatribusikan kepada pemegang saham biasa entitas induk dengan jumlah rata-rata tertimbang saham biasa yang beredar dalam suatu periode.\n\nUntuk tujuan penghitungan laba per saham dilusian, Grup menyesuaikan laba atau rugi yang dapat diatribusikan kepada pemegang saham biasa entitas induk dan jumlah rata-rata tertimbang saham yang beredar, atas dampak dari seluruh instrumen berpotensi saham biasa yang bersifat dilutif.",
    "DividendsTextBlock": "Distribusi dividen kepada pemilik Grup diakui sebagai liabilitas dalam laporan keuangan Grup pada periode dimana dividen telah disetujui oleh pemegang saham Grup.",
    "SegmentReportingTextBlock": "Grup menyajikan segmen operasi berdasarkan informasi keuangan yang digunakan oleh pengambil keputusan operasional dalam menilai kinerja segmen dan menentukan alokasi sumber daya yang dimilikinya. Segmetasi berdasarkan aktivitas dari setiap kegiatan operasi entitas legal di dalam Grup.\nSegmen operasi adalah suatu komponen dari entitas:\na.\tyang terlihat dalam aktivitas bisnis yang memperoleh pendapatan dan menimbulkan beban (termasuk pendapatan dan beban yang terkait dengan transaksi dengan komponen lain dari entitas yang sama);\nb.\thasil operasinya dikaji ulang secara berkala oleh kepala operasional untuk pembuatan keputusan tentang sumber daya yang dialokasikan pada segmen tersebut dan menilai kinerjanya; dan\na.\ttersedia informasi keuangan yang dapat dipisahkan.",
    "TheImplementationOfNewStatementsOfAccountingStandardsTextBlock": "a.\tPenerapan Standar Akuntansi Keuangan () Baru dan Revisi, serta Interpretasi Standar Akuntansi Keuangan () yang berlaku efektif untuk tahun buku yang dimulai pada atau setelah tanggal 1 Januari 2022 Standar dan amendemen standar berikut efektif untuk periode yang dimulai pada atau setelah tanggal 1 Januari 2022, dengan penerapan dini diperkenankan yaitu:\n\tPSAK 22 (Amendemen 2019): Kombinasi Bisnis tentang Definisi Bisnis;\n\tAmendemen PSAK 57: Provisi, Liabilitas Kontinjensi, dan Aset Kontinjensi tentang Kontrak Merugi - Biaya Memenuhi Kontrak;\n\tAmendemen PSAK 16: Aset Tetap tentang Hasil Sebelum Penggunaan yang Diintensikan;\n\tPSAK 69 (Penyesuaian Tahunan 2020): Agrikultur;\n\tPSAK 71 (Penyesuaian Tahunan 2020): Instrumen Keuangan; dan\n\tPSAK 73 (Penyesuaian Tahunan 2020): Sewa.\nImplementasi dari standar-standar tersebut tidak berdampak signifikan terhadap jumlah yang dilaporkan di periode berjalan atau tahun sebelumnya.\nb.\tStandar Akuntansi dan Interpretasi Standar yang telah Disahkan Namun Belum Efektif\nAmendemen atas standar yang berlaku efektif untuk periode yang dimulai pada atau setelah 1 Januari 2023, dengan penerapan dini diperkenankan yaitu:\n\tAmendemen PSAK 1: Penyajian Laporan Keuangan tentang Pengungkapan Kebijakan Akuntansi;\n\tAmendemen PSAK 1: Penyajian Laporan Keuangan tentang Klasifikasi Liabilitas sebagai Jangka Pendek atau Jangka Panjang; \n\tAmendemen PSAK 25: Kebijakan Akuntansi, Perubahan Estimasi Akuntansi, dan Kesalahan tentang Definisi Estimasi Akuntansi;\n\tAmendemen PSAK 46:  Pajak Penghasilan tentang  Pajak Tangguhan terkait Aset dan Liabilitas yang timbul dari Transaksi Tunggal; dan\n\tRevisi PSAK 107: Akuntansi Ijarah.\nStandar baru yang berlaku efektif untuk periode yang dimulai pada atau setelah 1 Januari 2025, dengan penerapan dini diperkenankan yaitu:\n\tPSAK 74: Kontrak Asuransi; dan\n\tAmendemen PSAK 74: Kontrak Asuransi tentang Penerapan Awal PSAK 74 dan PSAK 71  Informasi Komparatif.\nHingga tanggal laporan keuangan konsolidasian ini diotorisasi, Grup masih melakukan evaluasi atas dampak potensial dari penerapan standar baru dan amendemen standar tersebut.",
    "BusinessCombinationTextBlock": "Pengaturan bersama adalah pengaturan yang dua atau lebih pihak memiliki pengendalian bersama, yaitu persetujuan kontraktual untuk berbagi pengendalian atas suatu pengaturan, yang ada hanya ketika keputusan mengenai aktivitas relevan mensyaratkan persetujuan dengan suara bulat dari seluruh pihak yang berbagi pengendalian.\nGrup mengklasifikasikan pengaturan bersama sebagai:\ni.\tOperasi Bersama\nMerupakan pengaturan bersama yang mengatur bahwa para pihak yang memiliki pengendalian bersama atas pengaturan memiliki hak atas aset dan kewajiban terhadap liabilitas, terkait dengan pengaturan tersebut. Para pihak tersebut disebut operator bersama.\n\nOperator bersama mengakui hal berikut terkait dengan kepentingannya dalam operasi bersama:\na)\tAset, mencakup bagiannya atas setiap aset yang dimiliki bersama;\na)\tLiabilitas, mencakup bagiannya atas liabilitas yang terjadi bersama;\nb)\tPendapatan dari penjualan bagiannya atas output yang dihasilkan dari operasi bersama;\nc)\tBeban dari beban bagiannya atas output yang dihasilkan dari operasi bersama;\nd)\tBagiannya atas pendapatan dari penjualan output oleh operasi bersama.\n\ni.\tVentura Bersama\nMerupakan pengaturan bersama yang mengatur bahwa para pihak yang memiliki pengendalian bersama atas pengaturan memiliki hak atas aset neto pengaturan tersebut. Para pihak tersebut disebut sebagai ventura bersama.\n\nVentura bersama mengakui kepentingannya dalam ventura bersama sebagai investasi dan mencatat investasi tersebut dengan menggunakan metode ekuitas.",
    "DeterminationOfFairValueTextBlock": "Nilai wajar adalah harga yang akan diterima untuk menjual suatu aset atau harga yang akan dibayar untuk mengalihkan suatu liabilitas dalam transaksi teratur antara pelaku pasar pada tanggal pengukuran.\n\nNilai wajar aset dan liabilitas keuangan diestimasi untuk keperluan pengakuan dan pengukuran atau untuk keperluan pengungkapan.\n\nNilai wajar dikategorikan dalam level yang berbeda dalam suatu hierarki nilai wajar berdasarkan pada apakah input suatu pengukuran dapat diobservasi dan signifikansi input terhadap keseluruhan pengukuran nilai wajar:\n(i)\tHarga kuotasian (tanpa penyesuaian) di pasar aktif untuk aset atau liabilitas yang identik yang dapat diakses pada tanggal pengukuran (Level 1);\n(ii)\tInput selain harga kuotasian yang termasuk dalam Level 1 yang dapat diobservasi untuk aset atau liabilitas, baik secara langsung maupun tidak langsung (Level 2);\n(iii)\tInput yang tidak dapat diobservasi untuk aset atau liabilitas (Level 3).\n\nDalam mengukur nilai wajar aset atau liabilitas, Grup sebisa mungkin menggunakan data pasar yang dapat diobservasi. Apabila nilai wajar aset atau liabilitas tidak dapat diobservasi secara langsung, Grup menggunakan teknik penilaian yang sesuai dengan keadaannya dan memaksimalkan penggunaan input yang dapat diobservasi yang relevan dan meminimalkan penggunaan input yang tidak dapat diobservasi.\n\nPerpindahan antara level hierarki nilai wajar diakui oleh Grup pada akhir periode pelaporan dimana perpindahan terjadi.",
    "ForeignCurrencyTransactionsAndBalancesTextBlock": "a.\tMata uang fungsional dan penyajian\nItem-item yang disertakan dalam laporan keuangan setiap entitas anggota Grup diukur menggunakan mata uang yang sesuai dengan lingkungan ekonomi utama di mana entitas beroperasi ( uang fungsional).\n\nLaporan keuangan konsolidasian disajikan dalam Rupiah yang merupakan mata uang fungsional dan penyajian Grup.\n\nb.\tTransaksi dan saldo\nTransaksi dalam mata uang asing dijabarkan ke dalam mata uang Rupiah dengan menggunakan kurs yang berlaku pada tanggal transaksi. Pada setiap tanggal pelaporan, aset dan liabilitas moneter dalam mata uang asing dijabarkan ke dalam mata uang Rupiah menggunakan kurs penutup.\n\nKurs yang digunakan sebagai acuan adalah kurs yang dikeluarkan oleh Bank Indonesia.\n\n\n\n\nKeuntungan dan kerugian selisih kurs yang timbul dari penyelesaian transaksi dalam mata uang asing dan dari penjabaran aset dan liabilitas moneter dalam mata uang asing diakui di dalam laporan laba rugi, kecuali jika ditangguhkan di dalam ekuitas sebagai lindung nilai arus kas dan lindung nilai investasi neto dalam kegiatan usaha luar negeri bersih yang memenuhi syarat.\n\nKeuntungan dan kerugian selisih kurs yang berhubungan dengan pinjaman, serta kas dan setara kas disajikan pada laporan laba rugi sebagai  atau biaya keuangan. Keuntungan atau kerugian neto selisih kurs lainnya disajikan pada laporan laba rugi dan penghasilan komprehensif lain sebagai (kerugian)/keuntungan lain-lain.\n\nPerubahan nilai wajar efek moneter yang didenominasikan dalam mata uang asing yang disajikan perubahan niai wajarnya pada penghasilan komprehensif lain dianalisa antara selisih pejabaran yang timbul dari perubahan biaya perolehan diamortisasi efek dan perubahan nilai tercatat efek lainnya. \n\nSelisih penjabaran terkait dengan perubahan biaya perolehan diamortisasi diakui di dalam laporan laba rugi, dan perubahan nilai tercatat lainnya diakui pada laba komprehensif lainnya.\n\nSelisih penjabaran aset dan liabilitas keuangan nonmoneter yang dicatat pada nilai wajar diakui sebagai bagian keuntungan atau kerugian perubahan nilai wajar.\n\nSebagai contoh, selisih penjabaran aset dan liabilitas keuangan nonmoneter seperti ekuitas yang dimiliki dan dicatat pada nilai wajar melalui laporan laba rugi diakui pada laporan laba rugi sebagai bagian keuntungan atau kerugian nilai wajar dan selisih penjabaran aset nonmoneter seperti ekuitas yang disajikan perubahan nilai wajarnya pada penghasilan komprehensif lain.\n\nTransaksi-transaksi selama tahun berjalan dalam mata uang asing dicatat dalam Rupiah dengan kurs spot antara Rupiah dan valuta asing pada tanggal transaksi. Pada akhir periode pelaporan, pos moneter dalam mata uang asing dijabarkan ke dalam Rupiah menggunakan kurs penutup, \nyaitu kurs tengah Bank Indonesia.\nSelisih kurs yang timbul dari penyelesaian pos moneter dan dari penjabaran pos moneter dalam mata uang asing diakui dalam laba rugi.",
    "RightOfUseAssetsTextBlock": "Grup mengakui aset hak guna dan liabilitas sewa pada tanggal dimulainya sewa. Aset hak guna awalnya diukur pada biaya perolehan, yang terdiri dari jumlah pengukuran awal dari utang sewa disesuaikan dengan pembayaran sewa yang dilakukan pada atau sebelum tanggal permulaan, ditambah dengan biaya langsung awal yang dikeluarkan, dan estimasi biaya untuk membongkar dan memindahkan aset pendasar atau untuk merestorasi aset pendasar atau tempat di mana aset berada, dikurangi insentif sewa yang diterima. Jika sewa mengalihkan kepemilikan aset pendasar pada akhir masa sewa atau jika biaya perolehan aset hak guna merefleksikan penyewa akan mengeksekusi opsi beli, maka penyewa menyusutkan aset hak guna dari tanggal permulaan hingga akhir umur manfaat aset pendasar.",
    "InvestmentPropertiesTextBlock": "Properti investasi adalah properti (tanah atau bangunan atau bagian dari suatu bangunan atau kedua-duanya) yang dikuasai oleh pemilik atau penyewa melalui sewa pembiayaan untuk menghasilkan sewa atau untuk kenaikan nilai atau kedua-duanya, dan tidak untuk digunakan dalam produksi atau penyediaan barang atau jasa atau untuk tujuan administratif; atau dijual dalam kegiatan usaha sehari-hari. Properti investasi diakui sebagai aset jika dan hanya jika besar kemungkinan manfaat ekonomis masa depan yang terkait dengan properti investasi akan mengalir ke entitas; dan biaya perolehan properti investasi dapat diukur dengan andal. Properti investasi pada awalnya diukur sebesar biaya perolehan, meliputi harga harga pembelian dan setiap pengeluaran yang diatribusikan secara langsung (biaya jasa hukum, pajak pengalihan properti, dan biaya transaksi lain). Biaya transaksi termasuk dalam pengukuran awal tersebut. Properti investasi yang sedang dalam pengembangan ulang untuk penggunaan lebih lanjut sebagai properti investasi atau ketika pasar menjadi kurang aktif tetap dicatat sebesar nilai wajarnya. Properti investasi dalam konstruksi diukur secara andal, tetapi Grup mengharapkankan nilai wajarnya dapat diukur secara andal ketika konstruksi selesai, diukur senilai biaya dikurangi penurunan nilai sampai nilai wajarnya dapat diukur secara andal atau konstruksi diselesaikan  yang mana yang lebih awal. Setelah pengakuan awal, Grup memilih menggunakan model nilai wajar dan mengukur seluruh properti investasi berdasarkan nilai wajar. Keuntungan atau kerugian yang timbul dari perubahan nilai wajar properti investasi diakui dalam laba rugi pada periode terjadinya. Penentuan nilai wajar investasi didasarkan pada penilaian oleh penilai independen yang mempunyai kualifikasi profesional yang telah diakui dan relevan serta memiliki pengalaman terkini di lokasi dan kategori properti investasi yang dinilai. Pengalihan ke properti investasi dilakukan jika, dan hanya jika, terdapat perubahan penggunaan yang ditunjukkan dengan berakhirnya pemakaian oleh pemilik dan dimulainya sewa operasi kepada pihak lain. Pengalihan dari properti investasi dilakukan jika, dan hanya jika, terdapat perubahan penggunaan yang ditunjukkan dengan dimulainya penggunaan oleh pemilik dan dimulainya pengembangan untuk dijual. Properti investasi dihentikan pengakuannya pada saat dilepaskan atau ketika tidak digunakan lagi secara permanen dan tidak memiliki manfaat ekonomis masa depan yang diperkirakan dari pelepasannya. Keuntungan atau kerugian yang timbul dari penghentian atau pelepasan ditentukan dari selisih antara hasil neto pelepasan dan jumlah tercatat aset, dan diakui dalam laba rugi pada periode terjadinya penghentian atau pelepasan.",
    "GoodwillTextBlock": "Aset yang memiliki masa manfaat yang tidak terbatas  misalnya goodwill atau aset tak berwujud yang tidak siap untuk digunakan  tidak diamortisasi namun diuji penurunan nilainya setiap tahun, atau lebih sering apabila terdapat peristiwa atau perubahan pada kondisi yang mengindikasikan kemungkinan penurunan nilai. Aset yang tidak diamortisasi diuji ketika terdapat indikasi bahwa nilai tercatatnya mungkin tidak dapat dipulihkan. Penurunan nilai diakui jika nilai tercatat aset melebihi jumlah terpulihkan. Jumlah terpulihkan adalah yang lebih tinggi antara nilai wajar aset dikurangi biaya untuk menjual dan nilai pakai aset. \n\nDalam menentukan penurunan nilai, aset dikelompokkan pada tingkat yang paling rendah dimana terdapat arus kas masuk yang dapat diidentifikasi, yang sebagian besar tidak tergantung pada arus masuk kas dari aset lain atau kelompok aset (unit penghasil kas). Aset nonkeuangan selain goodwill yang mengalami penurunan nilai diuji setiap tanggal pelaporan untuk menentukan apakah terdapat kemungkinan pemulihan penurunan nilai.",
    "InvestmentInAssociatesTextBlock": "Entitas asosiasi adalah entitas dimana Grup memiliki kekuasaan untuk berpartisipasi dalam keputusan kebijakan keuangan dan operasional investee, tetapi tidak mengendalikan atau mengendalikan bersama atas kebijakan tersebut (pengaruh signifikan).\n\nInvestasi pada entitas asosiasi dicatat dengan menggunakan metode ekuitas. Dalam metode ekuitas, pengakuan awal investasi diakui sebesar biaya perolehan, dan jumlah tercatat ditambah atau dikurang untuk mengakui bagian atas laba rugi investee setelah tanggal perolehan. Bagian atas laba rugi investee diakui dalam laba rugi. Penerimaan distribusi dari investee mengurangi nilai tercatat investasi. Penyesuaian terhadap nilai tercatat tersebut juga mungkin dibutuhkan untuk perubahan dalam proporsi bagian investor atas investee yang timbul dari penghasilan komprehensif lain, termasuk perubahan yang timbul dari revaluasi aset tetap dan selisih penjabaran valuta asing. Bagian investor atas perubahan tersebut diakui dalam penghasilan komprehensif lain.\n\nGrup menghentikan penggunaan metode ekuitas sejak tanggal ketika investasinya berhenti menjadi investasi pada entitas asosiasi sebagai berikut:\n(a)\tJika investasi menjadi entitas anak, Grup mencatat investasinya sesuai dengan PSAK 22 dan PSAK 65;\n(a)\tJika sisa kepentingan dalam entitas asosiasi merupakan aset keuangan, maka Grup mengukur sisa kepentingan tersebut pada nilai wajar; dan\n(b)\tKetika Grup menghentikan penggunaan metode ekuitas, Grup mencatat seluruh jumlah yang sebelumnya telah diakui dalam penghasilan komprehensif lain yang terkait dengan investasi tersebut menggunakan dasar perlakuan yang sama dengan yang disyaratkan jika investee telah melepaskan secara langsung aset dan liabilitas terkait.",
    "PrepaidExpensesTextBlock": "Biaya dibayar dimuka terdiri dari biaya usaha, biaya produksi, biaya pengadaan, biaya pengelolaan, biaya distribusi, dan asuransi.\n\nUntuk biaya usaha, biaya produksi, biaya pengadaan, biaya distribusi, akan dibebankan secara proporsional dengan pendapatan yang diakui pada setiap periode.\n\nUntuk biaya-biaya dibayar dimuka asuransi diamortisasi selama masa manfaat masing-masing biaya dengan menggunakan metode garis lurus.",
    "ConcessionFinancialAssetsTextBlock": "Perjanjian konsesi jasa adalah perjanjian dimana pemerintah atau badan lainnya (pemberi konsesi) memberikan kontrak untuk penyediaan layanan publik ke entitas sektor swasta (). Perjanjian tersebut sering disebut sebagai perjanjian -ke-swasta.\n\nDalam perjanjian ini, operator membangun infrastruktur yang akan digunakan untuk menyediakan jasa publik dan mengoperasikan serta mengelola infrastruktur tersebut untuk jangka waktu tertentu. Operator dibayar untuk jasa yang dibayarkan selama periode perjanjian. Perjanjian diatur oleh suatu kontrak yang menetapkan standar kinerja, mekanisme penyesuaian harga, dan pengaturan untuk menengahi perselisihan. Dalam beberapa kasus, operator dapat meningkatkan infrastruktur yang ada.\n\nBeberapa ciri umum dari perjanjian konsesi jasa meliputi:\n\tPemberi konsesi merupakan entitas sektor publik, termasuk badan pemerintah, atau entitas sektor swasta yang telah diberikan tanggung jawab atas layanan tersebut.\n\tOperator bertanggung jawab setidaknya atas sebagian pengelolaan infrastruktur dan jasa terkait dan tidak hanya bertindak sebagai agen atas kepentingan pemberi konsesi.\n\tKontrak menetapkan harga awal yang akan dikenakan oleh operator dan mengatur perubahan harga selama periode perjanjian jasa.\n\tOperator diwajibkan untuk menyerahkan infrastruktur kepada pemberi konsesi pada akhir periode perjanjian dalam kondisi yang telah ditentukan, dengan sedikit atau tanpa imbalan tambahan, terlepas dari pihak yang awalnya mendanai infrastruktur.\n\nDalam ISAK 16 mengatur prinsip umum dalam pengakuan hak dan kewajiban terkait dengan konsesi jasa, DTP, JAA dan AJR tidak mengakui infrastruktur sebagai aset tetap namun mengakui sebagai aset keuangan, karena DTP, JAA dan AJR memiliki hak tanpa syarat untuk menerima kas dari pemberi konsesi melalui pembayaran kinerja berdasarkan perjanjian konsesi. Aset keuangan dicatat sebagai  Keuangan yang Diukur pada Biaya Perolehan Diamortisasi sesuai dengan PSAK 71,  Keuangan.\n\nISAK 22 memberikan panduan spesifik mengenai pengungkapan yang diperlukan atas perjanjian konsesi jasa.\n\nDTP, JAA dan AJR menghitung pendapatan yang terkait dengan jasa operasi sesuai dengan PSAK 72,  dari Kontrak dengan Pelanggan. DTP, JAA dan AJR mencatat kewajiban kontraktual untuk memelihara atau mengembalikan infrastruktur di lokasi operasi sesuai dengan PSAK 57, Provisi, Liabilitas Kontinjensi dan Aset Kontinjensi.",
    "ContractLiabilitiesTextBlock": "Grup sebagai Penyewa (Lessee)\nPada tanggal insepsi suatu kontrak, Grup menilai apakah suatu kontrak merupakan, atau mengandung, sewa. Suatu kontrak merupakan, atau mengandung sewa jika kontrak tersebut memberikan hak untuk mengendalikan penggunaan suatu aset identifikasian selama suatu jangka waktu untuk dipertukarkan dengan imbalan. Untuk menilai apakah suatu kontrak memberikan hak untuk mengendalikan suatu aset identifikasian, Grup menilai apakah:\na.Kontrak melibatkan penggunaan suatu aset identifikasian  ini dapat ditentukan secara eksplisit atau implisit dan secara fisik dapat dibedakan atau mewakili secara substantial seluruh kapasitas aset yang secara fisik dapat dibedakan. Jika pemasok memiliki hak substitusi substantif, maka aset tersebut tidak teridentifikasi;\nb.Grup memiliki hak untuk memperoleh secara substansial seluruh manfaat ekonomis dari penggunaan aset selama periode penggunaan; dan\nc.Grup memiliki hak untuk mengarahkan penggunaan aset identifikasian. Grup memiliki hak ini ketika hak pengambilan keputusan yang paling relevan untuk mengubah bagaimana dan untuk tujuan apa aset tersebut digunakan. Dalam kondisi tertentu di mana semua keputusan tentang bagaimana dan untuk tujuan apa aset digunakan telah ditentukan sebelumnya, Grup memiliki hak untuk mengarahkan penggunaan aset tersebut jika:\n\tGrup memiliki hak untuk  mengoperasikan aset; atau\n\tGrup mendesain aset dengan \ncara menetapkan sebelumnya bagaimana dan untuk tujuan apa aset akan digunakan.Pada tanggal insepsi atau pada saat penilaian kembali suatu kontrak yang mengandung suatu komponen sewa, Grup mengalokasikan imbalan dalam kontrak ke masing-masing komponen sewa berdasarkan harga tersendiri relatif dari komponen sewa.\nPembayaran sewa yang termasuk dalam indeks liabilitas sewa meliputi: pembayaran sewa tetap, sewa variabel yang bergantung pada indeks, jumlah yang akan dibayarkan dalam jaminan nilai residu dan harga eksekusi opsi beli, opsi perpanjangan atau penalti penghentikan jika Perseroan cukup pasti akan mengeksekusi opsi tersebut.Grup mengakui aset hak guna dan liabilitas sewa pada tanggal dimulainya sewa. Aset hak guna awalnya diukur pada biaya perolehan, yang terdiri dari jumlah pengukuran awal dari utang sewa disesuaikan dengan pembayaran sewa yang dilakukan pada atau sebelum tanggal permulaan, ditambah dengan biaya langsung awal yang dikeluarkan, dan estimasi biaya untuk membongkar dan memindahkan aset pendasar atau untuk merestorasi aset pendasar atau tempat di mana aset berada, dikurangi insentif sewa yang diterima.\nJika sewa mengalihkan kepemilikan aset pendasar pada akhir masa sewa atau jika biaya perolehan aset hak guna merefleksikan penyewa akan mengeksekusi opsi beli, maka penyewa menyusutkan aset hak guna dari tanggal permulaan hingga akhir umur manfaat aset pendasar. \nLiabilitas sewa awalnya diukur pada nilai kini atas pembayaran sewa yang belum dibayar pada tanggal permulaan, didiskontokan menggunakan suku bunga implisit dalam sewa atau, jika suku bunga tersebut tidak dapat ditentukan, digunakan suku bunga pinjaman inkremental Grup. Umumnya, Grup menggunakan suku bunga pinjaman inkremental sebagai suku bunga diskonto.\nSetelah tanggal permulaan, Grup mengukur liabilitas sewa dengan:\na. Meningkatkan jumlah tercatat untuk merefleksikan bunga atas liabilitas sewa;\nb. Mengurangi jumlah tercatat untuk merefleksikan sewa yang telah dibayar;\nc. Mengukur kembali jumlah tercatat untuk merefleksikan penilaian kembali atau modifikasi sewa atau untuk merefleksikan pembayaran sewa tetap secara substansi revisian.\nSetelah tanggal permulaan, Grup mengukur liabilitas sewa dengan:\na.\tMeningkatkan jumlah tercatat untuk merefleksikan bunga atas liabilitas sewa;\nb.\tMengurangi jumlah tercatat untuk merefleksikan sewa yang telah dibayar;\nc.\tMengukur kembali jumlah tercatat untuk merefleksikan penilaian kembali atau modifikasi sewa atau untuk merefleksikan pembayaran sewa tetap secara substansi revisian.\nLiabilitas sewa diukur kembali ketika ada perubahan pembayaran sewa masa depan yang timbul dari perubahan indeks atau suku bunga, jika ada perubahan estimasi Grup atas jumlah yang diperkirakan akan dibayar dalam jaminan nilai residual, atau jika Grup mengubah penilaiannya apakah akan mengeksekusi opsi beli, perpanjangan atau penghentian.\nKetika liabilitas sewa diukur kembali dengan cara ini, penyesuaian terkait dilakukan terhadap jumlah tercatat aset hak guna, atau dicatat dalam laba rugi jika jumlah tercatat aset hak guna telah berkurang menjadi nol.\nGrup menerapkan pengecualian untuk sewa jangka pendek dan sewa aset bernilai rendah berdasarkan sewa per sewa.\nSelanjutnya, pembayaran atas kontrak yang termasuk ke dalam pengecualian, yakni pembayaran atas sewa jangka pendek dan sewa aset bernilai rendah diakui pada metode garis lurus dan dibebankan pada laba rugi. Pembayaran sewa terkait dengan sewa yang dikecualikan tersebut diakui sebagai beban dengan menggunakan metode garis lurus selama masa sewa.\nSewa jangka pendek adalah sewa dengan masa sewa kurang dari atau sama dengan 12 bulan. Sewa aset bernilai rendah adalah sewa untuk perlengkapan umum seperti komputer, laptop, telepon genggam, dan perlengkapan kantor lainnya, serta aset lain yang harga barunya tidak lebih dari plafon nilai rendah yang ditetapkan oleh Grup.\nGrup sebagai Pesewa (Lessor)\nGrup mengakui aset berupa piutang sewa pembiayaan di laporan keuangan sebesar jumlah yang sama dengan investasi sewa neto. Penerimaan piutang sewa diperlukan sebagai pembayaran pokok dan pendapatan keuangan. Pengakuan pendapatan keuangan didasarkan pada suatu pola yang mencerminkan suatu tingkat pengembalian periodik yang konstan atas investasi neto Grup sebagai lessor dalam sewa pembiayaan.\nGrup menyajikan aset sebagai sewa operasi di laporan posisi keuangan sesuai sifat aset tersebut. Biaya langsung awal sehubungan proses negosiasi dan pengaturan sewa operasi ditambahkan dalam jumlah tercatat dari aset sewaan dan diakui sebagai beban selama masa sewa dengan dasar yang sama dengan pendapatan sewa. Sewa kontinjen, apabila ada, diakui sebagai pendapatan pada periode terjadinya. Pendapatan sewa operasi diakui sebagai pendapatan atas dasar garis lurus selama masa sewa.",
    "AdoptionOfNewAccountingStandardsTextBlock": "i.\tPenerapan Standar Akuntansi Keuangan () Baru dan Revisi, serta Interpretasi Standar Akuntansi Keuangan () yang berlaku efektif untuk tahun buku yang dimulai pada atau setelah tanggal \n1 Januari 2022 \nStandar dan amendemen standar berikut efektif untuk periode yang dimulai pada atau setelah tanggal \n1 Januari 2022, dengan penerapan dini diperkenankan yaitu:\n\tPSAK 22 (Amendemen 2019): Kombinasi Bisnis tentang Definisi Bisnis;\n\tAmendemen PSAK 57: Provisi, Liabilitas Kontinjensi, dan Aset Kontinjensi tentang Kontrak Merugi - Biaya Memenuhi Kontrak;\n\n\tAmendemen PSAK 16: Aset Tetap tentang Hasil Sebelum Penggunaan yang Diintensikan;\n\tPSAK 69 (Penyesuaian Tahunan 2020): Agrikultur;\n\tPSAK 71 (Penyesuaian Tahunan 2020): Instrumen Keuangan; dan\n\tPSAK 73 (Penyesuaian Tahunan 2020): Sewa.\n\nImplementasi dari standar-standar tersebut tidak berdampak signifikan terhadap jumlah yang dilaporkan di periode berjalan atau tahun sebelumnya.",
    "AccountingStandardsIssuedButNotYetEffectiveTextBlock": "Amendemen atas standar yang berlaku efektif untuk periode yang dimulai pada atau setelah 1 Januari 2023, dengan penerapan dini diperkenankan yaitu:\n\tAmendemen PSAK 1: Penyajian Laporan Keuangan tentang Pengungkapan Kebijakan Akuntansi;\n \n\tAmendemen PSAK 1: Penyajian Laporan Keuangan tentang Klasifikasi Liabilitas sebagai Jangka Pendek atau Jangka Panjang; \n\n\tAmendemen PSAK 25: Kebijakan Akuntansi, Perubahan Estimasi\nAkuntansi, dan Kesalahan tentang Definisi Estimasi Akuntansi; \n\tAmendemen PSAK 46:  Pajak Penghasilan tentang  Pajak Tangguhan terkait Aset dan Liabilitas yang timbul dari Transaksi Tunggal; dan\n\tRevisi PSAK 107: Akuntansi Ijarah.\nStandar baru yang berlaku efektif untuk periode yang dimulai pada atau setelah 1 Januari 2025, dengan penerapan dini diperkenankan yaitu:\n\tPSAK 74: Kontrak Asuransi; dan\n\tAmendemen PSAK 74: Kontrak Asuransi tentang Penerapan Awal PSAK 74 dan PSAK 71  Informasi Komparatif.\nHingga tanggal laporan keuangan konsolidasian ini diotorisasi, Grup masih melakukan evaluasi atas dampak potensial dari penerapan standar baru dan amendemen standar tersebut.",
    "DisposalsInPropertyPlantAndEquipment": "25391722984",
    "ReclassificationsOfPropertyPlantAndEquipment": "-311196465",
    "AdditionInPropertyPlantAndEquipment": "125853380230",
    "RevaluationOfPropertyPlantAndEquipment": "223362035319",
    "DisclosureofNotesforPropertyPlantandEquipmentTextBlock": "Pada tanggal 31 Maret 2025, Perusahaan telah mengasuransikan sebagian aset tetap yang dimiliki kepada perusahaan asuransi pihak ketiga yaitu Asuransi Estika Jasatama, Asuransi BRI Insurance, Asuransi Buana Independent, Asuransi Sompo Insurance Indonesia, Asuransi Tugu Pratama Indonesia, Asuransi Ramayana, dan Asuransi Binagriya Upakarta dengan nilai total pertanggungan sebesar Rp506.492.141.167 untuk risiko kebakaran, property all risk, dan industrial all risk.\nManajemen berpendapat bahwa nilai pertanggungan tersebut cukup untuk menutupi kerugian yang mungkin timbul.\nPada tanggal 31 Desember 2023, Perusahaan mereklasifikasi aset tetap ke properti investasi senilai Rp56.188.000.000 (Catatan 17).\nBerdasarkan penelaahan Manajemen, tidak terdapat peristiwa atau perubahan keadaan yang mengindikasikan penurunan nilai aset tetap, sehingga Manajemen tidak membentuk cadangan penurunan nilai aset tetap pada \n31 Desember 2024 dan 2023.",
    "AdditionInRightofUseAssets": "32591894008",
    "ReclassificationsOfRightofUseAssets": "-23298708300",
    "PartyName": "Lainnya",
    "TradeReceivablesGross": "778053816366",
    "AllowanceForImpairmentOfTradeReceivables": "723090980225",
    "TradeReceivablesNet": "695139624733",
    "CounterpartyName": "Lain-lain/ Others (di bawah/ below Rp 1 Milyar/ Billion)",
    "AdditionOfAllowanceForImpairmentOfTradeReceivables": "183416254557",
    "ReductionOfMovementOfAllowanceForImpairmentOfTradeReceivables": "206135038852",
    "LandUnderDevelopmentInventory": "2147977780190",
    "UndevelopedLandInventory": "3913949638964",
    "BuildingUnderConstruction": "2187719543010",
    "BuildingAvailableforSale": "1366282491080",
    "RealEstateAssetsgross": "9615929453244",
    "RealEstateAssets": "9615929453244",
    "RawAndIndirectMaterial": "176719775975",
    "OtherInventories": "96701301583",
    "InventoriesGross": "273421077558",
    "Inventories": "273421077558",
    "TotalBondsPayableGross": "4440774664140",
    "BondName": "Obligasi II Adhi Commuter Properti Tahun\n2023 Seri B",
    "DueDateForBondPayable": "8 Desember / December 8, 2028",
    "InterestRate": "0.0825",
    "InterestRateType": "Tetap",
    "TotalSukukGross": "499100000000",
    "UnamortizedSukukIssuanceCost": "230685764972",
    "Sukuk": "268414235028",
    "SukukName": "Sukuk Ijarah Adhi Commuter Properti Tahun 2023",
    "DueDateForSukuk": "26 Oktober / October 26, 2031",
    "ProfitSharingRate": "0,722% per\ntahun",
    "RawInventory": "337673450183",
    "PurcahsedRawInventory": "985645748029",
    "RawInventoryUsed": "948057760078",
    "ProjectImplementationCosts": "149641929407",
    "Subcontractor": "707761563804",
    "WagesAndDirectLabor": "267490679829",
    "RentCost": "79316251846",
    "OtherManufacturingOverhead": "336132620288",
    "ProductionCost": "2409084553406",
    "CostOfGoodsManufactured": "2409084553406",
    "DisclosureofNotesforCostofGoodsSoldTextBlock": "Pada 31 Maret 2025 dan 31 Desember 2024, tidak terdapat pembelian dari satu pemasok yang\nnilainya melebihi 10% dari total beban pokok penjualan dan beban langsung konsolidasian.",
    "DisclosureofNotesforLongTermBankLoansTextBlock": "BTN\nPT Adhi Commuter Properti dan PT Adhi Persada Properti menandatangani perjanjian kredit dengan PT Bank Tabungan Negara (Persero) Tbk untuk mendanai sejumlah proyek properti. Terdapat sejumlah kontrak yang tercantum pada Catatan atas Laporan Keuangan Perusahaan, termasuk Informasi berkaitan dengan rate, dan tanggal berakhirnya perjanjian kredit.\n\nJTRUST\nBerdasarkan Akta Perjanjian Kredit No. 6 tanggal 26 Agustus 2022 oleh Notaris Gamal Wahidin, S.H., dan Surat Persetujuan Pemberian Kredit (SP2K) tertanggal \n24 Agustus 2022 No. 015/JTRUST-JKT/SPK-CSME/VIII/2022 tentang Persetujuan Fasilitas Kredit, APP memperoleh plafon pinjaman sebesar Rp150.000.000.000 yang dicairkan secara bertahap atau disebut Kredit Angsuran Berjangka (KAB) sebesar Rp75.500.000.000 (KAB-1) dan Rp77.500.000.000 (KAB-2) dengan suku bunga 9,75% dan jangka waktu fasilitas 60 bulan yang jatuh tempo pada tanggal 26 Agustus 2027.\n\nPT INDONESIA INFRASTRUCTURE FINANCE\nBerdasarkan Perjanjian No. PF.02/IV/IIF-TL/2023 tanggal 18 April 2023, ADCP memperoleh Fasilitas Pinjaman Berjangka Senior. Jangka waktu pinjaman 4 (empat) tahun sampai tanggal Maret 2027. Suku bunga 10% per tahun\n\n\nBerdasarkan Akta Perjanjian Pembiayaan No. 18 tanggal 14 Juni 2023 dibuat oleh Notaris Fathiah Helmi, S.H., DTP memperoleh fasilitas pinjaman berjangka senior dengan limit sebesar Rp325.000.000.000. Jangka waktu fasilitas ini maksimal 16 tahun terhitung sejak 14 Juni 2023. Fasilitas pembiayaan ini dikenakan suku bunga sebesar 10% per tahun hingga tahun ke-7 (tujuh) dan sejak tahun ke-8 (delapan) dikenakan suku bunga sebesar JIBOR 6 (enam) bulan ditambah marjin atau sebesar 10% per tahun, mana yang lebih tinggi.",
    "DisclosureofNotesforShortTermBankLoansTextBlock": "Bank Mandiri\nPerusahaan memperoleh Kredit ModKerja (KMK) Revolving dari PT Bank Mandiri (Persero) Tbk berdasarkan Perjanjian KMK, No. KP/COD/024/PKKMK/ 2005, Akta No. 46 tanggal 14 September 2005 yang telah diperpanjang berdasarkan Perubahan Perjanjian KMK addendum No. XVIII tanggal 19 April 2021 dengan plafond sebesar Rp130.000.000.000 dan tingkat suku bunga mengambang sebesar 8,50% per tahun dengan jangka waktu 1 (satu) tahun terhitung sejak tanggal 26 April 2021 sampai dengan 25 April 2024.\n\nPerusahaan memperoleh Kredit Modal Kerja (KMK) Transaksional dari PT Bank Mandiri (Persero) Tbk berdasarkan Perjanjian KMK, No. KP/COD/024/PK-KMK/2005, Akta No. 46 tanggal \n14 September 2005 yang telah diperpanjang berdasarkan Perubahan Perjanjian KMK addendum No. XX tanggal \n8 Mei 2023 dengan plafond sebesar Rp600.000.000.000 dan tingkat suku bunga mengambang sebesar 8,50% per tahun dengan jangka waktu 1 (satu) tahun terhitung sejak tanggal 26 April 2023 sampai dengan 25 April 2024. Fasilitas ini dikenakan biaya provisi sebesar 0,20% per tahun dari limit kredit.\nPerusahaan memperoleh Fasilitas Non Cash Loan dari PT Bank Mandiri (Persero) Tbk berdasarkan Perjanjian KMK, No. KP-COD/029/PNCL/2006, Akta No. 72 tanggal 13 November 2006 yang telah diperpanjang berdasarkan Perubahan Perjanjian KMK addendum No. XXIII tanggal 8 Mei 2023 dengan limit kredit sebesar Rp4.300.000.000.000, terdiri dari Fasilitas LC/SKBDN (sub limit dari fasilitas NCL) sebesar Rp200.000.000.000, Fasilitas Trust Receipt (Sub limit dari fasilitas LC/SKBDN) sebesar Rp90.000.000.000 dan sisanya merupakan Jaminan Bank dan KMK Subkontraktor. Perpanjangan waktu dari fasilitas ini berjangka waktu 1 (satu) tahun terhitung sejak tanggal 26 April 2023 sampai dengan 25 April 2024 dengan tingkat suku bunga sesuai dengan suku bunga T/R trade finance rate yang berlaku pada Bank Mandiri. Fasilitas ini dikenakan biaya provisi sebesar 0,50% per tahun dari limit kredit.\nPerusahaan memperoleh Fasilitas Supplier Financing dari PT Bank Mandiri (Persero) Tbk berdasarkan Perjanjian KMK, No. KP-COD/029/PNCL/2006, Akta No. 72 tanggal 13 November 2006 yang telah diperpanjang berdasarkan addendum No. XXIII tanggal 8 Mei 2023 dengan limit \nkredit sebesar Rp1.500.000.000.000. Perpanjangan waktu dari fasilitas ini berjangka waktu 1 (satu) tahun terhitung sejak tanggal 26 April 2023 sampai dengan 25 April 2024 dengan tingkat suku bunga 7,50% per tahun yang dapat berubah sewaktu-waktu sesuai ketentuan Bank Mandiri.\nPerusahaan memperoleh Kredit Modal Kerja (KMK) Transaksional dari PT Bank Mandiri (Persero) Tbk berdasarkan Perjanjian KMK, No. KP/COD/024/PK-KMK/2005, Akta No. 46 tanggal \n14 September 2005 yang telah diperpanjang berdasarkan Perubahan Perjanjian KMK addendum No. XX tanggal \n8 Mei 2023 dengan plafond sebesar Rp600.000.000.000 dan tingkat suku bunga mengambang sebesar 8,50% per tahun dengan jangka waktu 1 (satu) tahun terhitung sejak tanggal 26 April 2023 sampai dengan 25 April 2024. Fasilitas ini dikenakan biaya provisi sebesar 0,20% per tahun dari limit kredit.\nPerusahaan memperoleh Fasilitas Non Cash Loan dari PT Bank Mandiri (Persero) Tbk berdasarkan Perjanjian KMK, No. KP-COD/029/PNCL/2006, Akta No. 72 tanggal 13 November 2006 yang telah diperpanjang berdasarkan Perubahan Perjanjian KMK addendum No. XXIII tanggal 8 Mei 2023 dengan limit kredit sebesar Rp4.300.000.000.000, terdiri dari Fasilitas LC/SKBDN (sub limit dari fasilitas NCL) sebesar Rp200.000.000.000, Fasilitas Trust Receipt (Sub limit dari fasilitas LC/SKBDN) sebesar Rp90.000.000.000 dan sisanya merupakan Jaminan Bank dan KMK Subkontraktor. Perpanjangan waktu dari fasilitas ini berjangka waktu 1 (satu) tahun terhitung sejak tanggal 26 April 2023 sampai dengan 25 April 2024 dengan tingkat suku bunga sesuai dengan suku bunga T/R trade finance rate yang berlaku pada Bank Mandiri. Fasilitas ini dikenakan biaya provisi sebesar 0,50% per tahun dari limit kredit.\nPerusahaan memperoleh Fasilitas Supplier Financing dari PT Bank Mandiri (Persero) Tbk berdasarkan Perjanjian KMK, No. KP-COD/029/PNCL/2006, Akta No. 72 tanggal 13 November 2006 yang telah diperpanjang berdasarkan addendum No. XXIII tanggal 8 Mei 2023 dengan limit \nkredit sebesar Rp1.500.000.000.000. Perpanjangan waktu dari fasilitas ini berjangka waktu 1 (satu) tahun terhitung sejak tanggal 26 April 2023 sampai dengan 25 April 2024 dengan tingkat suku bunga 7,50% per tahun yang dapat berubah sewaktu-waktu sesuai ketentuan Bank Mandiri.\n\nPT Bank Rakyat Indonesia (Persero) Tbk\nBerdasarkan Akta Perjanjian Kredit No. 5 tanggal 11 Mei 2016, yang dibuat oleh Notaris Sriyani Burlian, S.H., yang telah beberapa kali dilakuan perubahan, terakhir berdasarkan Addendum Perjanjian Kredit Nomor: 05/2023, tanggal 24 Agustus 2023. Perusahaan memperoleh Kredit Modal Kerja Konstruksi (KMKK) dari PT Bank Rakyat Indonesia (Persero) Tbk berdasarkan Perjanjian KMKK, Akta No. 5 tanggal 11 Mei 2016 yang telah beberapa kali dilakukan perubahan, terakhir berdasarkan Addendum Perjanjian Kredit Nomor: 05/2023, tanggal 24 Agustus 2023, dengan plafond sebesar Rp700.000.000.000 dan tingkat bunga sebesar 8,50% per tahun. Perpanjangan fasilitas ini terhitung sejak penandatanganan perubahan perjanjian kredit sampai dengan 11 Mei 2024. \nPerusahaan juga memperoleh Fasilitas Kredit Jangka Pendek (KJP) dengan plafond sebesar Rp300.000.000.000 yang bersifat interchangeable dengan fasilitas BG/SBLC, KMKI, Import Line, SCF A/P dan SCF A/R dengan total penggunaan seluruh fasilitas tersebut maksimal sebesar Rp.3.300.000.000.000. Tujuan fasilitas ini adalah untuk operasional perusahaan. Suku bunga atas fasilitas ini ditentukan oleh Bank dan Penalty Rate sebesar 2% dihitung dari besarnya tunggakan pokok dan/atau bunga. Fasilitas ini memiliki jangka waktu mulai 11 Mei 2023 sampai dengan 11 Mei 2024.\nPerusahaan juga memperoleh Fasilitas Bank Garansi BG/SBLC dengan plafond sebesar Rp4.000.000.000.000 yang bersifat interchangeable dengan fasilitas KMKI, Import Line, KJP, SCF A/P dan SCF A/R dengan total penggunakaan seluruh fasilitas tersebut maksimal sebesar Rp4.000.000.000.000. Jangka waktu fasilitas ini sampai dengan \n11 Mei 2024.\nPerusahaan juga memperoleh Fasilitas Kredit Modal Kerja Impor (KMKI) dengan plafond sebesar Rp500.000.000.000 yang bersifat interchangeable dengan fasilitas Import Line dan BG/SBLC, KJP, SCF A/P dan SCF A/R dengan total penggunaan KMKI ditambah Import Line maksimal sebesar Rp500.000.000.000, dan total penggunaan seluruh fasilitas tersebut maksimal sebesar Rp4.000.000.000.000. Suku bunga atas fasilitas ini adalah sebesar 9,25% p.a dan penalty rate sebesar 2% p.a. Jangka waktu fasilitas ini sampai dengan 11 Mei 2024.\nPerusahaan juga memperoleh Fasilitas Import Line dengan plafond sebesar Rp450.000.000.000 yang bersifat interchangeable dengan fasilitas KMKI dan BG/SBLC, KJP, SCF A/P dan SCF A/R dengan total penggunaan KMKI ditambah Import Line maksimal sebesar Rp500.000.000.000, dan total penggunaan seluruh fasilitas tersebut maksimal sebesar Rp4.000.000.000.000. Transit Interest Import Line untuk L/C dan SKBDN Valas sebesar 5% p.a dan untuk SKBDN Rupiah sebesar 8,5% p.a. Jangka waktu fasilitas ini sampai dengan 11 Mei 2024.\n\nPT Bank Negara Indonesia (Persero) Tbk\nBerdasarkan Surat Persetujuan Fasilitas Kredit No. BIN/2.2/894/R tanggal \n10 Desember 2015 perihal Persetujuan Fasilitas Kredit, terakhir diperbaharui dengan No. BIN/2.2/748/R tanggal 19 Desember 2017. Perusahaan memperoleh Kredit Modal Kerja (KMK) Transaksional dari PT Bank Negara Indonesia (Persero) Tbk berdasarkan Perjanjian KMK, No. BIN/2.2/748/R tanggal 19 Desember 2017 yang telah diperpanjang berdasarkan Perubahan Perjanjian KMK addendum No. 01/BIN/PK/2020 tanggal 21 Desember 2023 dengan plafond sebesar sebesar Rp750.000.000.000 dan tingkat bunga sebesar 8,50% per tahun. Perpanjangan sementara fasilitas ini berjangka waktu \n1 (satu) tahun yang terhitung sejak tanggal 22 Desember 2023 sampai dengan \n21 Desember 2024. \nPerusahaan memperoleh Kredit Modal Kerja (KMK) Revolving dari \nPT Bank Negara Indonesia (Persero) Tbk berdasarkan Perjanjian KMK, No. 164 tanggal 22 Desember 2015 dari notaris Arry Supratno, S.H., yang telah diperpanjang berdasarkan dengan persetujuan perubahan perjanjian kredit No. 11-163 tanggal 21 Desember 2023 sebesar Rp50.000.000.000 dan dikenakan bunga sebesar 8,5% per tahun. Perpanjangan fasilitas ini berjangka waktu 1 (satu) tahun yang terhitung sejak tanggal 22 Desember 2023 sampai dengan \n21 Desember 2024. \nPerusahaan memperoleh fasilitas \nKredit Non-cash Loan sebesar Rp7.100.000.0000 yang terdiri dari LC/SKBDN, GB/SBLC, SCF/OAF dan T/R. Fasilitas tersebut berjangka waktu 1 (satu) tahun yang terhitung sejak tanggal \n22 Desember 2023 sampai dengan 21 Desember 2024\n\nPT Bank Tabungan Negara (Persero) Tbk\nBerdasarkan Akta Kerjasama Pemberian Line Facility dari PT Bank Tabungan Negara (Persero) Tbk, akta No. 22 tanggal 15 Desember 2016 yang dibuat di hadapan Notaris Ashoya Ratam, S.H., M.Kn., yang telah diperbaharui berdasarkan Perjanjian No. 22/PKS/DIR/2022 tanggal 6 Agustus 2022. Perusahaan memperoleh fasilitas KMK Kontraktor dengan batas maksimal kredit sebesar Rp750.000.000.000. Pembaharuan fasilitas berjangka waktu 3 (tiga) tahun. Fasilitas ini dikenakan biaya provisi sebesar 0,5%, dengan tingkat bunga sebesar 9% (adjustable rate).\n\n\nPT Bank Pembangunan Daerah Jawa Barat dan Banten Tbk (BJB)\nPerusahaan memperoleh Fasilitas Perbankan dari BJB, berdasarkan Akta Perjanjian Pemberian Fasilitas Perbankan No. 13 tanggal 19 Juni 2020 yang dibuat di hadapan Notaris  PPAT Fessy Farizqoh Alwi, S.H., M.Kn., yang di addendum berdasarkan SPPK No. No. 423/DKO-KO2/2023 tanggal 16 Juni 2023 di mana jangka waktu perjanjian selama 1 (satu) tahun sejak tanggal 19 Juni 2023 sampai dengan 19 Juni 2024. Diperpanjang berdasarkan SPPK \nNo. 423/DKO-KO2/2023 tanggal 13 Juni 2023 di mana jangka waktu perjanjian selama 1 (satu) tahun sejak tanggal 19 Juni 2023 sampai dengan 19 Juni 2024.\n\nPT Bank CIMB Niaga Tbk\nPerusahaan memperoleh Kredit Modal Kerja (KMK) dari PT CIMB Niaga Tbk berdasarkan Perjanjian KMK, No. 90/CBG/JKT/04 tanggal 30 Maret 2004 yang telah diperpanjang terakhir kali berdasarkan Perubahan Perjanjian KMK adendum ke dua puluh (22) tanggal 22 Desember 2023. Perpanjangan waktu perjanjian terhitung sampai dengan \n14 Maret 2024. \n\nPT Sarana Multi Infrastruktur (Persero)\nBerdasarkan Akta Perjanjian Pembiayaan antara PT Sarana Multi Infrastruktur (Persero) Tbk No. 06 tanggal 14 Maret 2016 dibuat oleh Notaris Ir. Nanette Cahyanie Handari Adi Warsito, S.H., yang telah terakhir kali diubah dengan Perjanjian Perubahan Kesebelas Terhadap Perjanjian Pembiayaan No. PERJ- /SMI/0623 tertanggal 14 Juni 2023, Perusahaan memperoleh Fasilitas Pembiayaan Modal Kerja dengan limit sebesar Rp85.000.000.000. Perpanjangan fasilitas ini terhitung sejak 14 Juni 2023 sampai dengan 14 Juni 2024.\nTerhadap fasilitas pembiayaan tersebut dikenakan suku bunga sebesar 8,25% per tahun dan Facility Fee sebesar 0,30% per tahun dari limit pembiayaan yang dibayarkan secara sekaligus.\n\nPT Bank Permata Tbk\nPerusahaan memperoleh Fasilitas Perbankan dari PT Bank Permata Tbk, berdasarkan Perjanjian Perjanjian Pemberian Fasilitas Perbankan No. 57 tanggal 24 September 2019 yang dibuat dihadapan Notaris  PPAT Ashoya Ratam, S.H., MKn. Di mana telah dilakukan perubahan ketiga atas Perjanjian Pemberian Fasilitas Perbankan No. 16 tanggal 21 September 2022 yang dibuat dihadapan Notaris Indra Wiguna, SH, MKn, dengan jangka waktu perjanjian selama 1 (satu) tahun sampai dengan 24 September 2023.\nPerusahaan memperoleh fasilitas kredit berupa Fasilitas Revolving Loan (Fasilitas RL) yang bertujuan untuk pembiayaan modal kerja sehubungan dengan aktivitas usaha perusahaan. Limit pinjaman atas fasilitas ini adalah sebesar Rp200.000.000.000. Suku bunga mengambang atas fasilitas ini sebesar 8,5% per tahun.\n\nSindikasi PT Bank Mandiri (Persero Tbk, PT Bank Negara Indonesia (Persero) Tbk, PT Bank Pembangunan Daerah Papua, dan PT Bank Pembangunan Daerah Sumatera Utara\nBerdasarkan Surat Penawaran Pemberian Kredit (SPPK) dengan Nomor CBG.CB2/ SCD.SPPK.094/2021 pada PT Bank Mandiri (Persero) Tbk, Nomor KPS3/3.1/257/R pada PT Bank Negara Indonesia (Persero) Tbk, Nomor 40/BKK/KORPORASI/VII/2021 pada PT Bank Pembangunan Daerah Papua, dan Nomor 004/DKr-Kr/SPPK/L/2021 pada PT Bank Pembangunan Daerah Sumatera Utara, Perusahaan memperoleh fasilitas kredit dari Sindikasi yang terdiri dari PT Bank Mandiri (Persero Tbk, PT Bank Negara Indonesia (Persero) Tbk, PT Bank Pembangunan Daerah Papua, dan PT Bank Pembangunan Daerah Sumatera Utara yang telah diubah berdasarkan Surat Perpanjangan Jangka Waktu dan Tenor dengan Nomor CBG.CTS/9837/2022 tanggal 22 November 2022 pada PT Bank Mandiri, Nomor COB3/3.1/411/R tanggal 24 November 2022 pada PT Bank Negara Indonesia (Persero) Tbk, Nomor 02/66/BKK/2022 tanggal\n24 November 2022 pada PT Bank Pembangunan Daerah Papua, Nomor 1872/DKr-KKK/L/2022 tanggal 28 November 2022."
  }
}