{
  "emiten": "Astra Agro Lestari Tbk",
  "laporan_keuangan": {
    "measure": "shares",
    "identifier": "aali_maker2",
    "instant": "2024-12-31",
    "startDate": "2024-01-01",
    "endDate": "2024-12-31",
    "explicitMember": "idx-cor:OtherCurrencyMember",
    "EntityName": "Astra Agro Lestari Tbk",
    "EntityCode": "AALI",
    "EntityIdentificationNumber": "AA298",
    "EntityMainIndustry": "Umum / General",
    "SelectedAccountingStandards": "PSAK",
    "Sector": "D. Consumer Non-Cyclicals",
    "Subsector": "D2. Food & Beverage",
    "Industry": "D23. Agricultural Products",
    "Subindustry": "D232. Plantations & Crops",
    "ControllingShareholderInformation": "National Corporation",
    "TypeOfEntity": "Local Company - Indonesia Jurisdiction",
    "TypeOfListedSecurities": "Saham / Stock",
    "TypeOfBoardOnWhichTheEntityIsListed": "Utama / Main",
    "WhetherTheFinancialStatementsAreOfAnIndividualEntityOrAGroupOfEntities": "Entitas grup / Group entity",
    "PeriodOfFinancialStatementsSubmissions": "Kuartal I / First Quarter",
    "DateOfBoardOfDirectorsStatementLetter": "2025-04-28",
    "CurrentPeriodStartDate": "2025-01-01",
    "CurrentPeriodEndDate": "2025-03-31",
    "PriorYearEndDate": "2024-12-31",
    "PriorPeriodStartDate": "2024-01-01",
    "PriorPeriodEndDate": "2024-03-31",
    "Prior2YearEndDate": "2023-12-31",
    "DescriptionOfPresentationCurrency": "Rupiah / IDR",
    "LevelOfRoundingUsedInFinancialStatements": "Jutaan / In Million",
    "TypeOfReportOnFinancialStatements": "Tidak Diaudit / Unaudit",
    "WhetherInComplianceWithBAPEPAMLKVIIIG11RulesConcerningResponsibilitiesOfBoardOfDirectorsOnFinancialStatements": "Ya / Yes",
    "WhetherInComplianceWithBAPEPAMLKVIIIATwoRulesConcerningIndependenceOfAccountantProvidingAuditServicesInCapitalMarket": "Ya / Yes",
    "CashAndCashEquivalents": "3236012000000",
    "TradeReceivablesThirdParties": "204714000000",
    "TradeReceivablesRelatedParties": "165899000000",
    "OtherReceivablesThirdParties": "39941000000",
    "OtherReceivablesRelatedParties": "24000000",
    "CurrentInventories": "3699970000000",
    "CurrentBiologicalAssets": "260936000000",
    "OtherCurrentAdvances": "72921000000",
    "CurrentPrepaidTaxes": "753221000000",
    "CurrentAssets": "8433638000000",
    "OtherNonCurrentReceivablesRelatedParties": "489000000",
    "InvestmentsInJointVentures": "410417000000",
    "DeferredTaxAssets": "494411000000",
    "PlantationAssetsMature": "6032744000000",
    "PlantationAssetsImmature": "1432184000000",
    "PlasmaPlantations": "1508274000000",
    "PropertyPlantAndEquipment": "8982236000000",
    "NonCurrentClaimsForTaxRefund": "1879762000000",
    "Goodwill": "55951000000",
    "OtherNonCurrentNonFinancialAssets": "88864000000",
    "NonCurrentAssets": "20359587000000",
    "Assets": "28793225000000",
    "TradePayablesThirdParties": "689838000000",
    "TradePayablesRelatedParties": "21605000000",
    "OtherPayablesThirdParties": "240768000000",
    "OtherPayablesRelatedParties": "0",
    "CurrentAdvancesFromCustomersThirdParties": "146447000000",
    "CurrentAdvancesFromCustomersRelatedParties": "4000000",
    "CurrentAccruedExpenses": "138469000000",
    "ShortTermPostEmploymentBenefitObligations": "84617000000",
    "TaxesPayable": "226368000000",
    "CurrentMaturitiesOfBankLoans": "1689537000000",
    "CurrentLiabilities": "3237653000000",
    "DeferredTaxLiabilities": "223803000000",
    "LongTermBankLoans": "1500000000000",
    "LongTermPostEmploymentBenefitObligations": "621453000000",
    "OtherNonCurrentFinancialLiabilities": "8254000000",
    "NonCurrentLiabilities": "2353510000000",
    "Liabilities": "5591163000000",
    "CommonStocks": "962344000000",
    "AdditionalPaidInCapital": "3878995000000",
    "OtherComponentsOfEquity": "-33444000000",
    "AppropriatedRetainedEarnings": "192500000000",
    "UnappropriatedRetainedEarnings": "17641523000000",
    "EquityAttributableToEquityOwnersOfParentEntity": "22641918000000",
    "NonControllingInterests": "560144000000",
    "Equity": "23202062000000",
    "LiabilitiesAndEquity": "28793225000000",
    "SalesAndRevenue": "4799927000000",
    "CostOfSalesAndRevenue": "4217718000000",
    "GrossProfit": "582209000000",
    "SellingExpenses": "136228000000",
    "GeneralAndAdministrativeExpenses": "207145000000",
    "FinanceIncome": "35956000000",
    "InterestAndFinanceCosts": "74486000000",
    "GainsLossesOnChangesInForeignExchangeRates": "-2639000000",
    "ShareOfProfitLossOfJointVenturesAccountedForUsingEquityMethod": "18429000000",
    "OtherIncome": "147685000000",
    "OtherExpenses": "31139000000",
    "ProfitLossBeforeIncomeTax": "332642000000",
    "TaxBenefitExpenses": "-92764000000",
    "ProfitLossFromContinuingOperations": "239878000000",
    "ProfitLoss": "239878000000",
    "GainsLossesOnCashFlowHedgesBeforeTax": "13356000000",
    "OtherComprehensiveIncomeBeforeTax": "13356000000",
    "TaxOnOtherComprehensiveIncome": "2938000000",
    "OtherComprehensiveIncomeAfterTax": "10418000000",
    "ComprehensiveIncome": "250296000000",
    "ProfitLossAttributableToParentEntity": "230529000000",
    "ProfitLossAttributableToNonControllingInterests": "9349000000",
    "ComprehensiveIncomeAttributableToParentEntity": "240947000000",
    "ComprehensiveIncomeAttributableToNonControllingInterests": "9349000000",
    "BasicEarningsLossPerShareFromContinuingOperations": "119.78",
    "DilutedEarningsLossPerShareFromContinuingOperations": "119.78",
    "BalanceBeforeRestatementAtBeginningOfPeriod": "22566006000000",
    "EquityPositionBeginningOfThePeriod": "22566006000000",
    "ProfitLossChangesInEquity": "239878000000",
    "DistributionsOfCashDividends": "25417000000",
    "EquityPositionEndOfThePeriod": "22816302000000",
    "OtherComprehensiveIncome": "10418000000",
    "ReceiptsFromCustomers": "4868384000000",
    "PaymentsToSuppliersForGoodsAndServices": "3552624000000",
    "CashGeneratedFromUsedInOperations": "1315760000000",
    "InterestsReceivedFromOperatingActivities": "35956000000",
    "IncomeTaxesRefundedPaidFromOperatingActivities": "-100858000000",
    "OtherCashInflowsOutflowsFromOperatingActivities": "-153407000000",
    "NetCashFlowsReceivedFromUsedInOperatingActivities": "1097451000000",
    "PaymentsForAcquisitionOfPlantationAssets": "120827000000",
    "PaymentsForAcquisitionOfPropertyPlantAndEquipment": "57296000000",
    "ReceiptsFromReceivablesFromRelatedParties": "-857000000",
    "NetCashFlowsReceivedFromUsedInInvestingActivities": "-178980000000",
    "DividendsPaidFromFinancingActivities": "0",
    "InterestsPaidFromFinancingActivities": "72766000000",
    "OtherCashInflowsOutflowsFromFinancingActivities": "91915000000",
    "NetCashFlowsReceivedFromUsedInFinancingActivities": "19149000000",
    "NetIncreaseDecreaseInCashAndCashEquivalents": "937620000000",
    "CashAndCashEquivalentsCashFlows": "3067128000000",
    "EffectOfExchangeRateChangesOnCashAndCashEquivalents": "40000000000",
    "BasisOfPreparationOfConsolidatedFinancialStatementsTextBlock": "Laporan keuangan konsolidasian disusun berdasarkan konsep biaya perolehan, kecuali seperti yang dinyatakan pada Catatan 2h dan 2v, serta menggunakan dasar akrual, kecuali untuk laporan arus kas konsolidasian.\r\n\r\nLaporan arus kas konsolidasian disusun menggunakan metode langsung dengan mengklasifikasikan arus kas atas dasar aktivitas operasi, investasi dan pendanaan.\r\n\r\nPenyusunan laporan keuangan konsolidasian sesuai dengan Standar Akuntansi Keuangan Indonesia mengharuskan manajemen untuk membuat estimasi dan asumsi yang mempengaruhi jumlah aset dan liabilitas dan pengungkapan aset dan liabilitas kontinjensi pada tanggal laporan keuangan konsolidasian serta jumlah pendapatan dan beban selama periode pelaporan. Hasil yang sebenarnya mungkin berbeda dari jumlah yang diestimasi.\r\n\r\nMata uang fungsional Perusahaan dan semua entitas anak Perusahaan adalah Rupiah. Seluruh angka dalam laporan keuangan konsolidasian ini, kecuali dinyatakan lain, dibulatkan menjadi jutaan Rupiah yang terdekat.",
    "PrinciplesOfConsolidationTextBlock": "Laporan keuangan konsolidasian menggabungkan aset dan liabilitas pada tanggal laporan posisi keuangan dan hasil usaha untuk tahun yang berakhir pada tanggal-tanggal tersebut dari Perusahaan dan entitas di mana Perusahaan memiliki pengendalian ketika Perusahaan terekspos atau memiliki hak atas imbal hasil variabel dari keterlibatannya dengan entitas dan memiliki kemampuan untuk mempengaruhi imbal hasil tersebut melalui kekuasaannya atas entitas. Perusahaan menggunakan metode akuisisi untuk mencatat akuisisi entitas anak. Biaya perolehan termasuk nilai wajar imbalan kontinjensi pada tanggal akuisisi.\r\n\r\nKepentingan nonpengendali atas total laba/rugi komprehensif entitas anak diidentifikasi sesuai proporsinya dan disajikan sebagai bagian dari total laba/rugi komprehensif yang dapat diatribusikan pada laporan laba/rugi dan penghasilan komprehensif lain konsolidasian. Kepentingan nonpengendali atas aset neto entitas anak diidentifikasi pada tanggal kombinasi bisnis yang selanjutnya disesuaikan dengan proporsi atas perubahan ekuitas entitas anak dan disajikan sebagai bagian dari ekuitas pada laporan posisi keuangan konsolidasian.\r\n\r\nBila pengendalian atas suatu entitas diperoleh dalam tahun berjalan, hasil usaha entitas tersebut dimasukkan dalam laporan laba rugi dan penghasilan komprehensif lain konsolidasian sejak tanggal pengendalian dimulai. Bila pengendalian berakhir dalam tahun berjalan, hasil usaha entitas tersebut dimasukkan ke dalam laporan laba rugi dan penghasilan komprehensif lain konsolidasian untuk bagian tahun dimana pengendalian masih berlangsung.\r\n\r\nKebijakan akuntansi yang dipakai dalam penyajian laporan keuangan konsolidasian dalam semua hal yang material telah diterapkan secara konsisten oleh entitas anak.\r\n\r\nSeluruh transaksi dan saldo yang material antara perusahaan-perusahaan yang dikonsolidasikan telah dieliminasi dalam penyajian laporan keuangan konsolidasian.\r\n\r\nGoodwill merupakan selisih lebih yang tidak teridentifikasi antara jumlah harga perolehan investasi dengan proporsi nilai wajar aset bersih entitas anak pada tanggal akuisisi. Goodwill tidak diamortisasi dan dilakukan uji penurunan nilai setiap tahun.\r\n\r\nTransaksi restrukturisasi antar entitas sepengendali dicatat dengan menggunakan metode yang serupa dengan metode penyatuan kepemilikan. Selisih antara nilai perolehan investasi dengan proporsi nilai buku aset bersih entitas anak yang diakuisisi dicatat dalam akun  modal disetor dalam bagian ekuitas pada laporan posisi keuangan konsolidasian.\r\n\r\nVentura bersama adalah suatu entitas dimana Perusahaan memiliki pengendalian bersama dengan satu venturer atau lebih. Ventura bersama dicatat dengan menggunakan metode ekuitas.",
    "CashAndCashEquivalentsTextBlock": "Kas dan setara kas mencakup kas, bank dan investasi jangka pendek yang jatuh tempo dalam waktu tiga bulan atau kurang sejak tanggal perolehan.",
    "TradeAndOtherReceivablesTextBlock": "Piutang usaha dan piutang lain-lain pada awalnya diakui sebesar nilai wajar dan selanjutnya diukur pada biaya perolehan diamortisasi dengan menggunakan metode suku bunga efektif, kecuali jika efek diskontonya tidak material, setelah dikurangi penyisihan penurunan nilai yang diukur berdasarkan kerugian kredit ekspektasian dengan menelaah kolektibilitas saldo piutang secara individual atau kolektif dan mempertimbangkan informasi makroekonomi yang berorientasi ke masa depan dan relevan yang dilakukan pada setiap akhir periode pelaporan. Penyisihan penurunan nilai dihapuskan pada saat piutang tersebut dipastikan tidak tertagih. Pemulihan dari jumlah yang disisihkan sebelumnya dikreditkan ke akun yang sama.",
    "InventoriesTextBlock": "Persediaan dinyatakan sebesar nilai yang lebih rendah antara harga perolehan dan nilai realisasi bersih. \r\n\r\nHarga perolehan barang jadi terdiri dari semua biaya yang terjadi di perkebunan termasuk selisih antara estimasi nilai wajar dikurangi biaya untuk menjual dari aset biologis dengan estimasi biaya yang terjadi untuk menghasilkan aset biologis, dan alokasi biaya tidak langsung perkebunan dengan luas hektar tertanam sebagai dasar alokasi dan biaya pengolahan. \r\n\r\nNilai realisasi bersih adalah estimasi harga penjualan dalam kegiatan usaha biasa dikurangi taksiran biaya penyelesaian dan beban penjualan.\r\n\r\nHarga perolehan barang jadi ditentukan dengan metode rata rata tertimbang. Harga perolehan bahan penunjang ditentukan dengan metode rata-rata bergerak.\r\n\r\nPenyisihan untuk penurunan nilai persediaan ditentukan berdasarkan penelaahan terhadap keadaan persediaan.",
    "BearerPlantsTextBlock": "Merupakan tanaman belum menghasilkan dan tanaman menghasilkan yang digunakan dan diharapkan menghasilkan produk agrikultur untuk jangka waktu lebih dari satu periode. \r\n\r\nTanaman belum menghasilkan dinyatakan sebesar harga perolehan yang meliputi biaya persiapan lahan, penanaman, pemupukan dan pemeliharaan termasuk kapitalisasi biaya pinjaman yang digunakan untuk membiayai pengembangan tanaman belum menghasilkan dan biaya tidak langsung lainnya yang dialokasikan berdasarkan luas hektar tertanam. Pada saat tanaman sudah menghasilkan, akumulasi harga perolehan tersebut akan direklasifikasi ke tanaman menghasilkan. \r\n\r\nPenyusutan tanaman menghasilkan dimulai pada tahun tanaman tersebut menghasilkan dengan menggunakan metode garis lurus selama taksiran masa manfaat ekonomis yaitu 20 tahun. Tanaman kelapa sawit dinyatakan menghasilkan bila telah berumur tiga sampai dengan empat tahun yang pada umumnya telah menghasilkan tandan buah segar (TBS) rata rata empat sampai dengan enam ton per hektar dalam satu tahun. Tanaman karet dinyatakan menghasilkan bila telah berumur lima sampai dengan enam tahun. \r\n\r\nUmur manfaat ditelaah pada setiap tanggal neraca dan jika perlu disesuaikan dengan mempertimbangkan beberapa aspek termasuk dampak potensial yang timbul dari perubahan iklim.",
    "FixedAssetsTextBlock": "Semua kelompok aset tetap dinyatakan berdasarkan harga perolehan (Model Biaya) dikurangi akumulasi penyusutan dan penurunan nilai, kecuali tanah tidak disusutkan. Beban yang timbul sehubungan perolehan hak atas tanah diakui sebagai bagian dari harga perolehan tanah. Penyusutan dihitung dengan menggunakan metode garis lurus selama taksiran masa manfaat ekonomis sebagai berikut:\r\n\r\nPrasarana jalan dan jembatan 5 dan 20 tahun\r\nBangunan, instalasi dan mesin 20 tahun\r\nMesin dan peralatan 5 tahun dan 20 tahun\r\nAlat pengangkutan 5 tahun\r\nPeralatan kantor dan perumahan 5 tahun \r\n\r\nNilai residu, metode penyusutan dan masa manfaat ekonomis aset tetap ditinjau kembali dan disesuaikan, jika perlu, pada setiap tanggal laporan posisi keuangan dengan mempertimbangkan beberapa aspek termasuk dampak potensial yang timbul dari perubahan iklim.\r\n\r\nBiaya-biaya setelah perolehan awal diakui sebagai bagian dari nilai tercatat aset tetap atau sebagai aset yang terpisah hanya apabila kemungkinan besar manfaat ekonomis sehubungan dengan aset tersebut di masa mendatang akan mengalir ke Grup dan biaya perolehannya dapat diukur secara andal. Jumlah tercatat komponen yang diganti, dihapusbukukan. Biaya pemeliharaan dan perbaikan lainnya dibebankan di laporan laba rugi dan penghasilan komprehensif lain konsolidasian pada saat terjadinya.\r\n\r\nApabila aset tetap tidak digunakan lagi atau dijual, maka nilai tercatat dan akumulasi penyusutannya dikeluarkan dari laporan keuangan konsolidasian, serta keuntungan dan kerugian yang dihasilkan diakui dalam laporan laba rugi dan penghasilan komprehensif lain konsolidasian.\r\n\r\nAset dalam penyelesaian dinyatakan sebesar harga perolehan dan disajikan sebagai bagian dari aset tetap. Akumulasi harga perolehan akan direklasifikasi ke masing masing aset tetap pada saat aset tersebut selesai dikerjakan dan siap digunakan, dan penyusutan mulai dibebankan pada saat itu.",
    "BiologicalAssetsTextBlock": "Aset biologis terdiri atas produk agrikultur bertumbuh. \r\n\r\nProduk agrikultur bertumbuh berupa produk panen yang tumbuh pada tanaman produktif sampai dengan saat untuk dipanen. \r\n\r\nAset biologis diukur pada nilai wajar dikurangi dengan biaya untuk menjual. Keuntungan atau kerugian yang timbul saat pengakuan awal dan perubahan nilai wajar dicatat dalam laba rugi pada saat periode terjadinya.",
    "PlasmaPlantationsTextBlock": "Biaya-biaya yang terjadi dalam pengembangan perkebunan plasma sampai perkebunan tersebut siap diserah-terimakan dikapitalisasi ke akun perkebunan plasma dan dinyatakan sebesar harga perolehan. Selanjutnya perkebunan plasma diukur pada biaya perolehan diamortisasi.\r\n\r\nSelisih antara akumulasi biaya pengembangan perkebunan plasma dengan nilai serah-terimanya dibebankan pada laporan laba rugi dan penghasilan komprehensif lain konsolidasian.",
    "ImpairmentOfNon-FinancialAssetsTextBlock": "Aset tetap dan aset tidak lancar lainnya, termasuk aset takberwujud, ditelaah untuk mengetahui apakah telah terjadi penurunan nilai bilamana terdapat kejadian atau perubahan keadaan yang mengindikasikan bahwa nilai tercatat aset tersebut tidak dapat diperoleh kembali. Kerugian akibat penurunan nilai diakui sebesar selisih antara nilai tercatat aset dengan nilai yang dapat diperoleh kembali dari aset tersebut.\r\n\r\nNilai yang dapat diperoleh kembali adalah nilai yang lebih tinggi antara nilai wajar dikurangi biaya untuk menjual dan nilai pakai aset. Dalam rangka mengukur penurunan nilai, aset dikelompokkan hingga unit terkecil yang menghasilkan arus kas terpisah.\r\n\r\nSetiap tanggal pelaporan, aset nonkeuangan, selain goodwill, yang telah mengalami penurunan nilai ditelaah untuk menentukan apakah terdapat kemungkinan pemulihan penurunan nilai. Nilai yang dapat terpulihkan langsung diakui dalam laba rugi, tetapi tidak boleh melebihi akumulasi rugi penurunan nilai yang telah diakui sebelumnya.",
    "TradePayablesAndOtherLiabilitiesTextBlock": "Utang usaha dan liabilitas lain-lain pada awalnya diakui sebesar nilai wajar dan selanjutnya diukur pada biaya perolehan diamortisasi dengan menggunakan metode suku bunga efektif, kecuali jika efek diskontonya tidak material.",
    "RevenueAndExpenseRecognitionTextBlock": "Dalam menentukan pengakuan pendapatan, Grup melakukan analisa transaksi melalui lima langkah analisa berikut: \r\n1.  Mengindentifikasi kontrak dengan pelanggan, dengan kriteria sebagai berikut: (a) kontrak telah disetujui oleh pihak-pihak terkait dalam kontrak; (b) Grup bisa mengidentifikasi hak dari pihak-pihak terkait dan jangka waktu pembayaran dari barang yang akan dialihkan; (c) kontrak memiliki substansi komersial; (d) besar kemungkinan Grup akan menerima imbalan atas barang yang dialihkan.\r\n\r\n2.  Mengidentifikasi kewajiban pelaksanaan dalam kontrak ke pelanggan.\r\n\r\n3.  Menentukan harga transaksi, setelah dikurangi diskon, retur, potongan penjualan, pajak ekspor dan pungutan ekspor, yang berhak diperoleh suatu entitas sebagai kompensasi atas diserahkannya barang yang dijanjikan ke pelanggan.\r\n\r\n4.  Mengalokasikan harga transaksi kepada setiap kewajiban pelaksanaan dengan menggunakan dasar harga jual dari setiap barang yang dijanjikan di kontrak.\r\n\r\n5.  Mengakui pendapatan ketika kewajiban pelaksanaan telah dipenuhi (sepanjang waktu atau pada suatu waktu tertentu).\r\n\r\nPendapatan diakui pada titik waktu tertentu. Pendapatan dari penjualan barang jadi diakui pada saat pengendalian atas barang jadi telah berpindah kepada pelanggan. \r\n\r\nBeban diakui pada saat terjadinya (basis akrual).",
    "ForeignCurrencyTranslationTextBlock": "Transaksi dalam mata uang asing dijabarkan ke mata uang Rupiah dengan menggunakan kurs yang berlaku pada tanggal transaksi. Pada tanggal laporan posisi keuangan, aset dan liabilitas moneter dalam mata uang asing dijabarkan dengan kurs yang berlaku saat itu.\r\n\r\nKeuntungan dan kerugian selisih kurs yang timbul dari transaksi dalam mata uang asing dan penjabaran aset dan liabilitas moneter dalam mata uang asing, diakui pada laporan laba rugi dan penghasilan komprehensif lain konsolidasian.\r\n\r\nTidak terdapat selisih kurs yang dihasilkan dan diakui pada penghasilan komprehensif lainnya untuk tujuan konsolidasi dikarenakan seluruh laporan keuangan entitas anak menggunakan mata uang Rupiah.\r\n\r\nMata uang asing utama yang digunakan adalah dolar Amerika Serikat (AS$), dimana kurs tengah Bank Indonesia pada tanggal laporan posisi keuangan konsolidasian adalah Rp 16.588 (Rupiah penuh) (31 Desember 2024: Rp 16.162) (Rupiah penuh) untuk setiap satu AS$.",
    "TransactionsWithRelatedPartiesTextBlock": "Perusahaan dan entitas anak mempunyai transaksi dengan pihak berelasi. Definisi pihak berelasi yang dipakai adalah sesuai dengan Pernyataan Standar Akuntansi Keuangan (PSAK) No. 224, Pengungkapan pihak-pihak berelasi.\r\n\r\nSeluruh transaksi yang material dengan pihak berelasi telah diungkapkan dalam catatan atas laporan keuangan konsolidasian.",
    "IncomeTaxesTextBlock": "Beban pajak penghasilan terdiri dari pajak penghasilan kini dan pajak penghasilan tangguhan. Pajak tersebut diakui dalam laba rugi, kecuali apabila pajak tersebut terkait dengan transaksi atau kejadian yang diakui ke penghasilan komprehensif lain atau langsung ke ekuitas.\r\n\r\nSemua perbedaan temporer antara jumlah tercatat aset dan liabilitas dengan dasar pengenaan pajaknya diakui sebagai pajak tangguhan dengan menggunakan balance sheet liability method. Tarif pajak yang berlaku atau yang secara substantif berlaku saat ini dipakai untuk menentukan pajak tangguhan.\r\n\r\nPengakuan pajak tangguhan atas perbedaan temporer yang dapat berupa aset atau liabilitas dan pengakuan aset pajak tangguhan dari akumulasi rugi pajak disajikan dalam jumlah bersih untuk masing masing entitas. \r\n\r\nAset pajak tangguhan diakui apabila besar kemungkinan jumlah penghasilan kena pajak di masa mendatang akan memadai untuk dikompensasi dengan perbedaan temporer yang dapat dikurangkan dan saldo rugi pajak yang masih dapat dimanfaatkan.",
    "BorrowingsTextBlock": "Pada saat pengakuan awal, pinjaman diakui sebesar nilai wajar, dikurangi dengan biaya-biaya transaksi yang terjadi. Selanjutnya, pinjaman diukur pada biaya perolehan diamortisasi dengan menggunakan metode suku bunga efektif.\r\n\r\nBiaya transaksi diakui sepanjang besar kemungkinan sebagian atau seluruh fasilitas akan ditarik dan akan ditangguhkan sampai penarikan pinjaman terjadi. Sepanjang tidak terdapat bukti bahwa besar kemungkinan sebagian atau seluruh fasilitas akan ditarik, biaya transaksi tersebut dikapitalisasi sebagai pembayaran di muka untuk jasa likuiditas dan diamortisasi selama periode fasilitas yang terkait.\r\n\r\nBiaya pinjaman yang tidak dapat diatribusikan secara langsung pada suatu aset kualifikasian, jumlah yang dikapitalisasi ditentukan dengan mengalikan tingkat kapitalisasi terhadap jumlah yang dikeluarkan untuk memperoleh aset kualifikasian. Tingkat kapitalisasi dihitung berdasarkan rata-rata tertimbang biaya pinjaman yang dibagi dengan jumlah pinjaman yang tersedia selama periode.\r\n\r\nPinjaman diklasifikasikan sebagai liabilitas jangka pendek kecuali Grup memiliki diskresi dan niat untuk memperpanjang sesuai persyaratan perjanjian dan akan jatuh tempo dalam waktu lebih dari 12 bulan setelah periode pelaporan.",
    "ProvisionsTextBlock": "Provisi diakui apabila Grup memiliki kewajiban hukum maupun konstruktif sebagai akibat peristiwa masa lalu, dan besar kemungkinan penyelesaian kewajiban tersebut mengakibatkan arus keluar sumber daya dan jumlahnya dapat diestimasi secara andal. Provisi tidak diakui untuk kerugian operasi masa depan.",
    "EmployeeBenefitsTextBlock": "Imbalan kerja jangka pendek\r\n\r\nImbalan kerja jangka pendek diakui pada saat terutang kepada karyawan.\r\n\r\nImbalan pensiun dan imbalan pascakerja lainnya\r\n\r\nGrup memiliki program imbalan pasti dan iuran pasti.\r\n\r\nKewajiban imbalan pensiun merupakan nilai kini kewajiban imbalan pasti pada tanggal laporan posisi keuangan dikurangi dengan nilai wajar aset program. Kewajiban imbalan pasti dihitung sekali setahun oleh aktuaris independen dengan menggunakan metode projected unit credit, dimana imbalan program diatribusikan pada periode jasa yang menghasilkan imbalan.\r\n\r\nNilai kini kewajiban imbalan pasti ditentukan dengan mendiskontokan estimasi arus kas masa depan dengan menggunakan tingkat bunga obligasi pemerintah jangka panjang pada tanggal laporan posisi keuangan dalam mata uang Rupiah sesuai dengan mata uang di mana imbalan tersebut akan dibayarkan dan yang memiliki jangka waktu yang sama dengan kewajiban imbalan pensiun yang bersangkutan.\r\n\r\nGrup diharuskan menyediakan imbalan pensiun minimum yang diatur dalam UU Cipta Kerja No. 11/2020 (UUCK) yang merupakan kewajiban imbalan kerja. Jika imbalan pensiun sesuai dengan UUCK lebih besar dari program pensiun yang ada, selisih tersebut diakui sebagai bagian dari kewajiban imbalan pensiun.\r\n\r\nKeuntungan dan kerugian aktuarial yang timbul dari penyesuaian dan perubahan dalam asumsi-asumsi aktuarial diakui seluruhnya melalui penghasilan komprehensif lain dan dilaporkan dalam saldo laba.\r\n\r\nBiaya jasa lalu yang timbul dari amandemen atau kurtailmen program diakui sebagai beban dalam laba rugi pada saat terjadinya. \r\n\r\nKeuntungan atau kerugian dari kurtailmen dan penyelesaian program manfaat pasti diakui ketika kurtailmen dan penyelesaian tersebut terjadi.\r\n\r\nGrup memberikan imbalan pascakerja lainnya, seperti uang pisah, uang penghargaan, uang kompensasi dan masa persiapan pensiun.\r\n\r\nImbalan kerja jangka panjang lainnya\r\n\r\nHak atas imbalan ini pada umumnya diberikan apabila karyawan bekerja hingga mencapai usia pensiun atau memenuhi masa kerja tertentu. Estimasi biaya imbalan ini dicadangkan sepanjang masa kerja karyawan, dengan menggunakan metode akuntansi yang sama dengan metode yang digunakan dalam perhitungan program pensiun imbalan pasti. \r\n\r\nImbalan jangka panjang lain seperti cuti berimbalan jangka panjang dan penghargaan jubilee diberikan berdasarkan peraturan Grup dan dihitung dengan metode projected unit credit dan didiskontokan ke nilai kini.",
    "EarningsPerShareTextBlock": "Laba per saham dasar dihitung dengan membagi laba yang dapat diatribusikan kepada pemilik Perusahaan dengan rata-rata tertimbang jumlah saham yang beredar dalam tahun yang bersangkutan. \r\n\r\nLaba per saham dilusian dihitung dengan membagi laba yang dapat diatribusikan kepada pemilik Perusahaan dengan rata rata tertimbang jumlah saham yang beredar ditambah dengan rata rata tertimbang jumlah saham yang akan diterbitkan atas konversi efek berpotensi saham yang bersifat dilutif.",
    "DividendsTextBlock": "Pembagian dividen kas final diakui sebagai liabilitas ketika dividen kas tersebut disetujui Rapat Umum Pemegang Saham Perusahaan. Pembagian dividen kas interim diakui sebagai liabilitas ketika dividen kas diputuskan oleh Rapat Direksi dan disetujui oleh Dewan Komisaris.",
    "SegmentReportingTextBlock": "Segmen operasi dilaporkan dengan cara yang konsisten dengan pelaporan internal yang diberikan kepada pengambil keputusan operasional yang bertanggung jawab untuk mengalokasikan sumber daya, menilai kinerja segmen operasi dan membuat keputusan strategis.",
    "DerivativeFinancialInstrumentsTextBlock": "Grup hanya melakukan kontrak instrumen keuangan derivatif untuk melindungi eksposur yang mendasarinya (underlying). Instrumen keuangan derivatif diukur sebesar nilai wajarnya.\r\n\r\nMetode pengakuan keuntungan atau kerugian yang timbul tergantung dari apakah derivatif tersebut dimaksudkan sebagai instrumen lindung nilai untuk tujuan akuntansi dan sifat dari item yang dilindung nilai. Grup menentukan derivatif sebagai lindung nilai atas risiko suku bunga dan nilai tukar mata uang asing sehubungan dengan liabilitas yang diakui dan penerimaan kas dalam mata uang asing dari transaksi penjualan (lindung nilai atas arus kas).\r\n\r\nPerubahan nilai wajar derivatif yang ditetapkan dan memenuhi kriteria lindung nilai atas arus kas untuk tujuan akuntansi, bagian efektifnya, diakui di penghasilan komprehensif lain dan disajikan sebagai komponen ekuitas lain. Ketika instrumen derivatif tersebut kadaluarsa atau tidak lagi memenuhi kriteria untuk akuntansi lindung nilai, maka keuntungan atau kerugian kumulatif di ekuitas, diakui pada laba rugi.\r\n\r\nPerubahan nilai wajar derivatif yang tidak memenuhi kriteria untuk tujuan akuntansi lindung nilai diakui pada laba rugi.\r\n\r\nNilai wajar instrumen keuangan derivatif diklasifikasikan sebagai aset atau liabilitas tidak lancar jika sisa jatuh tempo instrumen keuangan derivatif lebih dari 12 bulan.\r\n\r\nPengukuran nilai wajar atas cross currency interest rate swaps ditentukan berdasarkan tingkat suku bunga dan nilai tukar kuotasian yang diberikan oleh bank atas kontrak yang dimiliki Grup pada tanggal laporan posisi keuangan yang dihitung berdasarkan tingkat suku bunga pasar dan nilai tukar yang dapat diobservasi.\r\n\r\nPerubahan atas nilai wajar dari kontrak derivatif yang ditetapkan sebagai instrumen lindung nilai, yang secara efektif menghapus variabilitas arus kas dari transaksi terkait, dicatat di penghasilan komprehensif lain. Nilai ini kemudian diakui dalam laba rugi sebagai penyesuaian atas beban atau keuntungan terkait yang dilindung nilai pada periode yang sama dimana beban atau keuntungan tersebut mempengaruhi laba rugi.",
    "TheImplementationOfNewStatementsOfAccountingStandardsTextBlock": "Standar akuntansi yang telah dipublikasikan dan relevan terhadap kegiatan operasi Grup adalah sebagai berikut:\r\n\r\nBerlaku efektif untuk tahun buku yang dimulai pada atau setelah tanggal 1 Januari 2025\r\n\r\nGrup menerapkan standar revisi yang berlaku efektif pada tahun 2025, namun tidak menimbulkan dampak signifikan pada laporan keuangan konsolidasian. Perubahan kebijakan akuntansi Grup telah dibuat seperti yang disyaratkan, sesuai dengan ketentuan transisi dalam masing-masing standar.\r\n\r\n- PSAK No. 103\t: Kombinasi bisnis/Business combination\r\n- PSAK No. 107\t: Instrument keuangan: Pengungkapan/ Financial instruments: Disclosure\r\n- PSAK No. 109\t: Instrument keuangan/Financial instruments\r\n- PSAK No. 115\t: Pendapatan dari kontrak dengan pelanggan/Revenue from customers contract\r\n- PSAK No. 117\t: Kontrak asuransi/Insurance contract\r\n- PSAK No. 201\t: Penyajian laporan keuangan/Presentation of financial statements  \r\n- PSAK No. 207\t: Laporan arus kas/Cashflow statements \r\n- PSAK No. 216\t: Aset tetap/Fixed asset\r\n- PSAK No. 219 \t: Imbalan Kerja/Employee benefits \r\n- PSAK No. 221 \t: Pengaruh perubahan kurs valuta asing/Effect of changes in foreign exchange rates\r\n- PSAK No. 228\t: Investasi pada Entitas Asosiasi dan Ventura Bersama/Investment in Associated entities and Joint ventures \r\n- PSAK No. 232\t: Instrument keuangan: Penyajian/Financial instruments: Presentation\r\n- PSAK No. 236\t: Penurunan nilai aset/Asset impairment\r\n- PSAK No. 237\t: Provisi, liabilitas kontinjensi, dan aset kontijensi/Provisions, Contingent Liabilities and Contingent Assets",
    "AccountingStandardsIssuedButNotYetEffectiveTextBlock": "Belum berlaku efektif untuk tahun buku yang dimulai pada tanggal 1 Januari 2025:\r\n\r\n- PSAK No. 107\t: Instrument keuangan: Pengungkapan terkait klasifikasi dan pengukuran instrumen keuangan/ Financial instruments: Disclosure regarding to classification and remeasurement of  financial instruments\r\n- PSAK No. 109\t: Instrument keuangan/Financial instruments\r\n\r\nGrup masih mempelajari dampak yang mungkin timbul atas penerbitan standar akuntansi keuangan tersebut.",
    "AdditionInPropertyPlantAndEquipment": "936251000000",
    "DisposalsInPropertyPlantAndEquipment": "98078000000",
    "ReclassificationsOfPropertyPlantAndEquipment": "0",
    "DisclosureofNotesforPropertyPlantandEquipmentTextBlock": "Penyusutan aset tetap dialokasikan sebagai berikut:\n\n31 Maret 2025\nBeban produksi  192,628\nBeban umum dan administrasi  39,566\nBeban penjualan 19,478\nTanaman belum menghasilkan  2,472\nJumlah  254,144\n\n31 Maret 2024\nBeban produksi  179,452\nBeban umum dan administrasi  39,738\nTanaman belum menghasilkan  7,597\nBeban penjualan  7,189\nJumlah  233,976\n\nBangunan, mesin dan alat pengangkutan diasuransikan terhadap risiko kebakaran dan risiko lainnya dengan nilai pertanggungan sejumlah Rp 15.493 miliar (31 Desember 2024: Rp 15.493 miliar) yang menurut manajemen memadai untuk menutupi kemungkinan kerugian atas risiko-risiko tersebut.\n\nDari sisi anggaran biaya konstruksi pada tanggal laporan posisi keuangan, aset dalam penyelesaian rata-rata telah mencapai persentase penyelesaian kurang lebih 87% dan diperkirakan akan selesai pada tahun 2025-2026 (31 Desember 2024: kurang lebih 82% dan diperkirakan akan selesai pada tahun 2025).\n\nHak atas tanah berupa Hak Guna Usaha (HGU) dan Hak Guna Bangunan (HGB) dengan masa berlaku sampai dengan tahun antara 2025 dan 2099.\n\nNilai wajar aset tetap pada tanggal laporan posisi keuangan adalah sebesar Rp 13.831 miliar (31 Desember 2024: Rp 13.990 miliar). Perbedaan signifikan terhadap nilai tercatat aset tetap pada aset tanah dan bangunan, sedangkan terhadap aset tetap lainnya tidak berbeda signifikan. Nilai wajar tanah dan bangunan berdasarkan hirarki nilai wajar Tingkat 2 (transaksi pasar yang dapat diobservasi).\n\nJumlah harga perolehan aset tetap yang telah disusutkan penuh dan masih digunakan adalah sebesar Rp 4.603 miliar (31 Desember 2024: Rp 4.581 miliar).\n\nManajemen berpendapat bahwa penyisihan penurunan nilai aset tetap sudah mencukupi.",
    "SalesAndRevenueMoreThan10Percent": "4799927000000",
    "PartyName": "Lainnya",
    "TradeReceivablesGross": "165899000000",
    "AllowanceForImpairmentOfTradeReceivables": "0",
    "TradeReceivablesNet": "165899000000",
    "CounterpartyName": "PT Kreasijaya Adhikarya",
    "WorkInProcess": "65744000000",
    "RawAndIndirectMaterial": "981460000000",
    "PalmKernel": "427708000000",
    "CrudePalmOilandPalmKernelOil": "2223983000000",
    "OtherInventories": "1075000000",
    "InventoriesGross": "3699970000000",
    "Inventories": "3699970000000",
    "DisclosureofNotesforInventoriesTextBlock": "Berdasarkan penelaahan atas kondisi dan nilai persediaan, manajemen berkeyakinan bahwa tidak ada persediaan yang mengalami penurunan nilai.\n\nBarang jadi dan bahan penunjang diasuransikan terhadap risiko kebakaran dan risiko lainnya dengan nilai pertanggungan sejumlah Rp 1.636 miliar (31 Desember 2024: Rp 1.636 miliar). Manajemen berkeyakinan bahwa nilai pertanggungan tersebut memadai untuk menutupi kemungkinan kerugian atas risiko-risiko tersebut.",
    "TradePayables": "21605000000",
    "CounterpartyNameTradePayable": "Lainnya",
    "WagesAndDirectLabor": "87837000000",
    "Depreciation": "300746000000",
    "RepairsAndMaintenance": "993238000000",
    "OtherManufacturingOverhead": "2442966000000",
    "ProductionCost": "3824787000000",
    "CostOfGoodsManufactured": "3824787000000",
    "FinishGoodsInventory": "1286358000000",
    "Overhead": "43857000000",
    "DisclosureofNotesforCostofGoodsSoldTextBlock": "Tidak ada pembelian dari satu pemasok pihak ketiga maupun satu pihak berelasi yang melebihi 10% dari pendapatan bersih.",
    "TotalBankLoanGross": "3189537000000",
    "BankLoans": "3189537000000",
    "DisclosureofNotesforLongTermBankLoansTextBlock": "a. PT Bank Mandiri (Persero) Tbk\n\nBerdasarkan perubahan perjanjian fasilitas pinjaman dengan PT Bank Mandiri (Persero) Tbk. tertanggal 25 Juni 2021 yang merupakan bagian dari perjanjian kredit tertanggal 26 November 2019, Perusahaan memperoleh fasilitas berupa fasilitas kredit bersifat committed dan revolving dengan pagu maksimum Rp 750 miliar.\n\nPada tanggal yang sama, Perusahaan juga menandatangani perjanjian fasilitas pinjaman dengan PT Bank Mandiri (Persero) Tbk berupa fasilitas kredit bersifat uncommitted dan revolving dengan pagu maksimum Rp 250 miliar.\n\nSuku bunga tahunan untuk komitmen ini adalah 1,5% diatas JIBOR.\n\nTidak ada jaminan atas fasilitas ini dan telah berakhir pada tanggal 25 November 2024.\n\nPerikatan keuangan atas fasilitas ini adalah rasio Consolidated Net Borrowings terhadap Consolidated Capital Employed untuk periode yang relevan tidak melebihi dari 1,5:1.\n\nPada tanggal 5 Juli 2024, Perusahaan menandatangani perjanjian fasilitas pinjaman dengan PT Bank Mandiri (Persero) Tbk berupa fasilitas kredit bersifat committed dan non revolving dengan pagu maksimum Rp 1.500 miliar.\n\nJumlah pinjaman pada tanggal 31 Maret 2025 dalam mata uang Rupiah dengan tingkat suku bunga tetap tahunan sebesar 6,50%.\n\nTidak ada jaminan atas fasilitas ini dan akan berakhir pada tanggal 4 Juli 2027.\n\nPerikatan keuangan atas fasilitas ini adalah rasio Consolidated Net Borrowings terhadap Consolidated Capital Employed untuk periode yang relevan tidak melebihi dari 1,5:1.\n\nGrup telah memenuhi batasan-batasan yang diwajibkan dalam perjanjian.\n\nb. PT Bank Rakyat Indonesia (Persero) Tbk\n\nPada tanggal 15 September 2022, Perusahaan menandatangani perjanjian fasilitas pinjaman dengan PT Bank Rakyat Indonesia (Persero) Tbk dengan fasilitas kredit bersifat committed dengan pagu maksimum Rp 1.000 miliar. Seluruh pinjaman ini telah ditarik penuh pada tanggal 30 September 2022.\n\nJumlah pinjaman pada tanggal 31 Maret 2025 dalam mata uang Rupiah dengan tingkat suku bunga tetap tahunan sebesar 6,2%.\n\nTidak ada jaminan atas fasilitas ini dan akan berakhir 36 bulan sejak tanggal perjanjian dan wajib dilunasi selambat-lambatnya pada tanggal 15 September 2025.\n\nPerikatan keuangan atas fasilitas ini adalah Total Ratio Debt Net Worth untuk periode yang relevan tidak melebihi dari 1,5.\n\nGrup telah memenuhi batasan-batasan yang diwajibkan dalam perjanjian.\n\nc. PT Bank Pan Indonesia Tbk\n\nPada tanggal 9 September 2022, Perusahaan menandatangani perjanjian fasilitas pinjaman dengan PT Bank Pan Indonesia Tbk dengan fasilitas kredit bersifat committed dengan pagu maksimum Rp 600 miliar. Seluruh pinjaman ini telah ditarik penuh pada tanggal 3 Oktober 2022.\n\nTidak ada jaminan atas fasilitas ini dan akan berakhir 3 tahun sejak tanggal perjanjian.\n\nJumlah pinjaman pada tanggal 31 Maret 2025 dalam mata uang Rupiah dengan tingkat suku bunga tetap tahunan sebesar 6,25%.\n\nd. PT Bank Shinhan Indonesia \n\nPada tanggal 16 September 2022, Perusahaan menandatangani perjanjian fasilitas pinjaman dengan PT Bank Shinhan Indonesia dengan fasilitas kredit bersifat committed dengan pagu maksimum Rp 100 miliar. Seluruh pinjaman ini telah ditarik penuh pada tanggal 3 Oktober 2022.\n\nJumlah pinjaman pada tanggal 31 Maret 2025 dalam mata uang Rupiah dengan tingkat suku bunga tetap tahunan sebesar 6,25%.\n\nTidak ada jaminan atas fasilitas ini dan akan berakhir 36 bulan sejak tanggal penarikan.\n\nPembayaran angsuran fasilitas kredit sesuai dengan tanggal jatuh tempo dengan rincian sebesar Rp 5 miliar pada 3 Oktober 2023, Rp 5 miliar pada 3 Oktober 2024 dan Rp 90 miliar pada 3 Oktober 2025.\n\ne. Bank of China (Hong Kong) Limited\n\nBerdasarkan perubahan perjanjian fasilitas bergulir dengan Bank of China (Hong Kong) Limited, Cabang Jakarta, tertanggal 24 Mei 2021, yang merupakan bagian dari perjanjian kredit tertanggal 24 Mei 2018, Perusahaan memperoleh fasilitas komitmen pinjaman berupa revolving loan facility dengan pagu maksimum Rp 700 miliar.\n\nSuku bunga tahunan untuk fasilitas ini dalam Rupiah adalah 0,8% diatas JIBOR.\n\nTidak ada jaminan atas fasilitas ini dan telah berakhir pada tanggal 24 Mei 2024.\n\nPerikatan keuangan atas fasilitas ini adalah rasio Consolidated Net Borrowings terhadap Consolidated Capital Employed untuk periode yang relevan tidak melebihi dari 1,5:1.\n\nf. PT Bank Permata Tbk\n\nBerdasarkan perubahan perjanjian fasilitas pinjaman dengan PT Bank Permata Tbk  tertanggal 7 Juni 2021 yang merupakan bagian dari perjanjian kredit tertanggal 8 November 2019, Perusahaan memperoleh fasilitas kredit jangka pendek bersifat uncommitted dan bergulir dengan pagu maksimum sebesar Rp 500 miliar. Jatuh tempo pinjaman adalah 3 bulan setelah penarikan.\n\nSuku bunga tahunan untuk komitmen ini adalah 1,5% diatas JIBOR.\n\nTidak ada jaminan atas fasilitas ini dan telah berakhir pada tanggal 8 November 2024.\n\nPerikatan keuangan atas fasilitas ini adalah rasio Consolidated Net Borrowings terhadap Consolidated Capital Employed untuk periode yang relevan tidak melebihi dari 1,5:1.\n\ng. PT Bank Maybank Indonesia Tbk\n\nPada tanggal 28 Maret 2023, Perusahaan menandatangani perjanjian fasilitas pinjaman dengan PT Bank Maybank Indonesia Tbk dengan fasilitas kredit bersifat uncommitted dengan pagu maksimum Rp 500 miliar.\n\nSuku bunga tahunan untuk komitmen ini adalah 0,8% diatas JIBOR.\n\nTidak ada jaminan atas fasilitas ini dan akan berakhir 36 bulan sejak tanggal perjanjian. Pada 31 Maret 2025, fasilitas pinjaman ini tidak digunakan oleh Grup.\n\nPerikatan keuangan atas fasilitas ini adalah rasio Consolidated Net Borrowings terhadap Consolidated Capital Employed untuk periode yang relevan tidak melebihi dari 1,5:1.\n\nh. PT Bank SMBC Indonesia Tbk\n\nPada tanggal 3 Juli 2023, Perusahaan menandatangani perjanjian fasilitas pinjaman dengan PT Bank SMBC Indonesia Tbk dengan fasilitas kredit bersifat uncommitted dengan pagu maksimum Rp 500 miliar.\n\nSuku bunga tahunan untuk komitmen ini adalah 0,6% diatas JIBOR.\n\nTidak ada jaminan atas fasilitas ini dan akan berakhir 36 bulan sejak tanggal perjanjian. Pada 31 Maret 2025, fasilitas pinjaman ini tidak digunakan oleh Grup.\n\nPerikatan keuangan atas fasilitas ini adalah rasio Consolidated Net Borrowings terhadap Consolidated Capital Employed untuk periode yang relevan tidak melebihi dari 1,5:1.\n\ni. Pembiayaan Pinjaman Bersama\n\nPada tanggal 23 Agustus 2019, Perusahaan menandatangani perjanjian fasilitas pinjaman bersama dengan beberapa pihak pemberi pinjaman berupa komitmen term loan facility dan revolving facility dengan pagu maksimum masing-masing AS$ 150 juta dan AS$ 50 juta dengan suku bunga tahunan sebesar 1,15% diatas LIBOR (neto dari potongan pajak).\n\nKomitmen term loan facility telah ditarik penuh pada tanggal 30 Agustus 2019.\n\nPada tanggal 9 Pebruari 2023, fasilitas pinjaman berupa revolving facility dengan pagu AS$ 50 juta telah ditutup.\n\nBerdasarkan perubahan perjanjian fasilitas pinjaman bersama tertanggal 27 Juni 2023, suku bunga tahunan untuk komitmen ini adalah 1,30% diatas Term SOFR (neto dari potongan pajak).\n\nTidak ada jaminan atas fasilitas pinjaman bersama ini dan jumlah pinjaman yang ditarik telah jatuh tempo pada 30 Agustus 2024.\n\nPerikatan keuangan atas fasilitas ini adalah rasio Consolidated Net Borrowings terhadap Consolidated Capital Employed untuk periode yang relevan tidak melebihi dari 1,5:1.",
    "DueDateForLogTermBankLoan": "36 bulan sejak tanggal penarikan (3 Oktober 2022)",
    "InterestRateLongTermBankLoan": "Suku bunga tetap tahunan 6,25%"
  }
}