{
  "emiten": "PT Aspirasi Hidup Indonesia Tbk",
  "laporan_keuangan": {
    "measure": "shares",
    "identifier": "aces_maker",
    "instant": "2024-12-31",
    "startDate": "2024-01-01",
    "endDate": "2024-12-31",
    "explicitMember": "idx-cor:OtherCurrencyMember",
    "EntityName": "PT Aspirasi Hidup Indonesia Tbk",
    "EntityCode": "ACES",
    "EntityIdentificationNumber": "AA492",
    "EntityMainIndustry": "Umum / General",
    "SelectedAccountingStandards": "PSAK",
    "Sector": "E. Consumer Cyclicals",
    "Subsector": "E7. Retailing",
    "Industry": "E74. Specialty Retail",
    "Subindustry": "E743. Home Improvement Retail",
    "ControllingShareholderInformation": "National Corporation",
    "TypeOfEntity": "Local Company - Indonesia Jurisdiction",
    "TypeOfListedSecurities": "Saham / Stock",
    "TypeOfBoardOnWhichTheEntityIsListed": "Utama / Main",
    "WhetherTheFinancialStatementsAreOfAnIndividualEntityOrAGroupOfEntities": "Entitas grup / Group entity",
    "PeriodOfFinancialStatementsSubmissions": "Kuartal I / First Quarter",
    "CurrentPeriodStartDate": "2025-01-01",
    "CurrentPeriodEndDate": "2025-03-31",
    "PriorYearEndDate": "2024-12-31",
    "PriorPeriodStartDate": "2024-01-01",
    "PriorPeriodEndDate": "2024-03-31",
    "Prior2YearEndDate": "2023-12-31",
    "DescriptionOfPresentationCurrency": "Rupiah / IDR",
    "LevelOfRoundingUsedInFinancialStatements": "Satuan Penuh / Full Amount",
    "TypeOfReportOnFinancialStatements": "Tidak Diaudit / Unaudit",
    "WhetherInComplianceWithBAPEPAMLKVIIIG11RulesConcerningResponsibilitiesOfBoardOfDirectorsOnFinancialStatements": "Ya / Yes",
    "WhetherInComplianceWithBAPEPAMLKVIIIATwoRulesConcerningIndependenceOfAccountantProvidingAuditServicesInCapitalMarket": "Ya / Yes",
    "CashAndCashEquivalents": "1875124407889",
    "OtherCurrentFinancialAssets": "27102245066",
    "TradeReceivablesThirdParties": "32730193840",
    "TradeReceivablesRelatedParties": "12173496585",
    "CurrentInventories": "3396280224516",
    "CurrentPrepaidExpenses": "28953716130",
    "OtherCurrentAdvances": "508710714219",
    "CurrentPrepaidTaxes": "68540862325",
    "CurrentAssets": "5949615860570",
    "ReceivablesFromRelatedParties": "5560059306",
    "InvestmentsInAssociates": "0",
    "OtherNonCurrentFinancialAssets": "72409296091",
    "DeferredTaxAssets": "67927925329",
    "InvestmentProperties": "302376169708",
    "PropertyPlantAndEquipment": "424329629143",
    "RightOfUseAssets": "1088575142596",
    "OtherNonCurrentNonFinancialAssets": "140082166735",
    "NonCurrentAssets": "2241795949664",
    "Assets": "8191411810234",
    "TradePayablesThirdParties": "144134045054",
    "TradePayablesRelatedParties": "46985130842",
    "OtherPayablesRelatedParties": "15984579202",
    "CurrentAdvancesFromCustomersThirdParties": "64035634223",
    "OtherCurrentFinancialLiabilities": "78797285900",
    "CurrentAccruedExpenses": "87195055186",
    "ShortTermPostEmploymentBenefitObligations": "7610210688",
    "TaxesPayable": "60371452328",
    "CurrentDeferredRevenue": "76379981636",
    "CurrentMaturitiesOfFinanceLeaseLiabilities": "291892933630",
    "CurrentLiabilities": "873386308689",
    "LongTermFinanceLeaseLiabilities": "628276653654",
    "LongTermPostEmploymentBenefitObligations": "173661069000",
    "OtherNonCurrentFinancialLiabilities": "3753911323",
    "NonCurrentLiabilities": "805691633977",
    "Liabilities": "1679077942666",
    "CommonStocks": "171203897000",
    "AdditionalPaidInCapital": "400825625040",
    "TreasuryStocks": "0",
    "DifferenceDueToChangesOfEquityInSubsidiaryAssociates": "239797199",
    "AppropriatedRetainedEarnings": "482594713034",
    "UnappropriatedRetainedEarnings": "5421062781733",
    "EquityAttributableToEquityOwnersOfParentEntity": "6475926814006",
    "NonControllingInterests": "36407053562",
    "Equity": "6512333867568",
    "LiabilitiesAndEquity": "8191411810234",
    "SalesAndRevenue": "1992527663684",
    "CostOfSalesAndRevenue": "1025841685411",
    "GrossProfit": "966685978273",
    "SellingExpenses": "545222966924",
    "GeneralAndAdministrativeExpenses": "184556485303",
    "InterestAndFinanceCosts": "9949471853",
    "OtherIncome": "27812849244",
    "OtherExpenses": "421351693",
    "ProfitLossBeforeIncomeTax": "254348551744",
    "TaxBenefitExpenses": "-51040511225",
    "ProfitLossFromContinuingOperations": "203308040519",
    "ProfitLoss": "203308040519",
    "ComprehensiveIncome": "203308040519",
    "ProfitLossAttributableToParentEntity": "204819955708",
    "ProfitLossAttributableToNonControllingInterests": "-1511915189",
    "ComprehensiveIncomeAttributableToParentEntity": "204819955708",
    "ComprehensiveIncomeAttributableToNonControllingInterests": "-1511915189",
    "BasicEarningsLossPerShareFromContinuingOperations": "11.97",
    "BalanceBeforeRestatementAtBeginningOfPeriod": "6186397789088",
    "EquityPositionBeginningOfThePeriod": "6186397789088",
    "ProfitLossChangesInEquity": "203308040519",
    "EquityPositionEndOfThePeriod": "6389705829607",
    "ReceiptsFromCustomers": "2367135224116",
    "PaymentsToSuppliersForGoodsAndServices": "1849756870842",
    "PaymentsForSalariesAndAllowances": "332925796396",
    "CashGeneratedFromUsedInOperations": "184452556878",
    "InterestsReceivedFromOperatingActivities": "21174041868",
    "IncomeTaxesRefundedPaidFromOperatingActivities": "-82627387989",
    "NetCashFlowsReceivedFromUsedInOperatingActivitiesBeforeChangesInAssetsAndLiabilities": "122999210757",
    "NetCashFlowsReceivedFromUsedInOperatingActivities": "122999210757",
    "ProceedsFromDisposalOfPropertyPlantAndEquipment": "1029119005",
    "PaymentsForAcquisitionOfPropertyPlantAndEquipment": "86087477227",
    "PaymentsForAcquisitionOfIntangibleAssets": "7212900",
    "OtherCashInflowsOutflowsFromInvestingActivities": "0",
    "NetCashFlowsReceivedFromUsedInInvestingActivities": "-85058358222",
    "ProceedsFromBankLoans": "0",
    "PaymentsOfBankLoans": "0",
    "PaymentsOfFinanceLeaseLiabilities": "114120775467",
    "ProceedsFromDueToRelatedParties": "44653392410",
    "PaymentsOfDueToRelatedParties": "45713243530",
    "NetCashFlowsReceivedFromUsedInFinancingActivities": "-115180626587",
    "NetIncreaseDecreaseInCashAndCashEquivalents": "-77239774052",
    "CashAndCashEquivalentsCashFlows": "2239950794045",
    "EffectOfExchangeRateChangesOnCashAndCashEquivalents": "4816077957",
    "BasisOfPreparationOfConsolidatedFinancialStatementsTextBlock": "Laporan keuangan konsolidasian disusun dan disajikan berdasarkan asumsi kelangsungan usaha serta atas dasar akrual, kecuali laporan arus kas konsolidasian. Dasar pengukuran dalam penyusunan laporan keuangan konsolidasian ini adalah konsep biaya perolehan, kecuali beberapa akun tertentu yang didasarkan pengukuran lain sebagaimana dijelaskan dalam kebijakan akuntansi masing-masing akun tersebut. Biaya perolehan umumnya didasarkan pada nilai wajar imbalan yang diserahkan dalam pemerolehan aset. The consolidated financial statements have been prepared and presented based on going concern assumption and accrual basis of accounting, except for the consolidated statements of cash flows. Basis of measurement in preparation of these consolidated financial statement is the historical costs concept, except for certain accounts which have been prepared on the basis of other measurements as described in their respective policies. Historical cost is generally based on the fair value of the consideration given in exchange for assets.",
    "PrinciplesOfConsolidationTextBlock": "Laporan keuangan konsolidasian mencakup laporan keuangan Perusahaan dan entitas-entitas anak. Entitas anak adalah entitas yang dikendalikan oleh Grup, yakni Grup terekspos, atau memiliki hak, atas imbal hasil variabel dari keterlibatannya dengan entitas dan memiliki kemampuan untuk mempengaruhi imbal hasil tersebut melalui kemampuan kini untuk mengarahkan aktivitas relevan dari entitas (kekuasaan atas investee). Laporan keuangan Grup mencakup hasil usaha arus kas, aset dan liabilitas dari Perusahaan dan seluruh entitas anak yang, secara langsung dan tidak langsung, dikendalikan oleh Perusahaan. Entitas anak dikonsolidasikan sejak tanggal efektif akuisisi, yaitu tanggal dimana Grup secara efektif memperoleh pengendalian atas bisnis yang diakuisisi, sampai tanggal pengendalian berakhir. Entitas induk menyusun laporan keuangan konsolidasian dengan menggunakan kebijakan akuntasi yang sama untuk transaksi dan peristiwa lain dalam keadaan yang serupa. Seluruh transaksi, saldo, laba, beban, dan arus kas dalam intra kelompok usaha terkait dengan transaksi antar entitas dalam grup eliminasi secara penuh. The consolidated financial statements incorporate the financial statements of the Company and subsidiaries. A subsidiary is an entity controlled by the Group, ie the Group is exposed, or has rights, to variable returns from its involvement with the entity and has the ability to affect those returns through its current ability to direct the entity relevant activities (power over the investee). The Group fianncial statements incorporate the results, cash flows, assets, and liabilities of the Company and all of its directly and indirectly controlled subsidiaries. Subsidiaries are consolidated from the effective date of acquisition, which is the date on which the Group effectively obtains control of the acquired business, until that control ceases. A parent prepares consolidated financial statements using uniform accounting policies for like transactions and other events in similar circumtances. All intragroup transactions, balances, income, expenses and cash flows are eliminated in full on consolidation.",
    "CashAndCashEquivalentsTextBlock": "Kas dan setara kas termasuk kas, kas di bank (rekening giro), dan deposito jangka pendek dengan jangka waktu jatuh tempo 3 (tiga) bulan atau kurang sejak tanggal penempatannya dan tidak digunakan sebagai jaminan dan tidak dibatasi penggunaannya. Cash and cash equivalents are cash on hand, cash in banks (demand deposits) and time deposits with maturity periods of three months or less at the time of placement that are not used as collateral or are not restricted.",
    "InventoriesTextBlock": "Persediaan dinyatakan berdasarkan jumlah terendah antara biaya perolehan dan nilai realisasi neto. Biaya persediaan terdiri dari seluruh biaya pembelian, biaya konversi, dan biaya lain yang timbul sampai persediaan berada dalam kondisi dan lokasi saat ini. Biaya perolehan ditentukan dengan metode rata-rata tertimbang. Nilai realisasi neto merupakan taksiran harga jual dalam kegiatan usaha biasa dikurangi estimasi biaya penyelesaian dan estimasi biaya yang diperlukan untuk membuat penjualan. Inventories are carried at the lower of cost and net realizable value. The cost of inventories comprise all costs of purchase, costs of conversion and other costs incurred in bringing the inventories to their present location and condition. Cost is determined using the weighted average method. Net realisable value is the estimated selling price in the ordinary course of business less the estimated costs of completion and the estimated costs necessary to make the sale.",
    "FixedAssetsTextBlock": "Aset tetap pada awalnya diakui sebesar biaya perolehan yang meliputi harga perolehannya dan setiap biaya yang dapat diatribusikan langsung untuk membawa aset ke kondisi dan lokasi yang diinginkan agar aset siap digunakan sesuai intensi manajemen. Fixed assets are initially recognized at cost, which comprises its purchase price and any cost directly attributable in bringing the assets to the location and condition necessary for it to be capable of operating in the manner intended by management.",
    "ImpairmentOfNon-FinancialAssetsTextBlock": "Pada setiap akhir periode pelaporan, Grup menilai apakah terdapat indikasi aset mengalami penurunan nilai. Jika terdapat indikasi tersebut, Grup mengestimasi jumlah terpulihkan aset tersebut. Jumlah terpulihkan ditentukan atas suatu aset individual, dan jika tidak memungkinkan, Grup menentukan jumlah terpulihkan dari unit penghasil kas dari aset tersebut.At the end of each reporting period, the Group assess whether there is any indication that an asset may be impaired. If any such indication exists, the Group shall estimate the recoverable amount of the asset. Recoverable amount is determined for an individual asset, if its is not possible, the Group determines the recoverable amount of the asset cash-generating unit.",
    "RevenueAndExpenseRecognitionTextBlock": "Pendapatan dari penjualan barang diakui pada saat pengendalian atas barang telah berpindah kepada pelanggan. Pendapatan jasa diakui pada saat pelanggan menerima dan mengonsumsi manfaat dari jasa tersebut. Beban diakui pada saat terjadinya dengan dasar akrual. Revenue from the sale of goods is recognised when the control of goods has been transferred to the customer. Revenue from the rendering of services is recognized when the customer has received and consumed benefit from the services. Expenses are recognized as incurred on an accruals basis.",
    "ForeignCurrencyTranslationTextBlock": "Dalam menyiapkan laporan keuangan, setiap entitas di dalam grup mencatat dengan menggunakan mata uang dari lingkuangan ekonomi utama di mana entitas beroperasi ( uang fungsional). Mata uang fungsional Perusahaan dan sebagian besar entitas anak adalah Rupiah. Transaksi-transaksi  selama tahun berjalan dalam mata uang asing dicatat dalam Rupiah dengan kurs spot antara Rupiah dan valuta asing pada tanggal transaksi. Pada akhir periode pelaporan, pos moneter dalam mata uang asing dijabarkan ke dalam Rupiah menggunakan kurs penutup, yaitu kurs tengah Bank Indonesia pada 31 Maret 2025 dan 31 Desember 2024. In preparing financial statements, each of the entities within the Group record by using the currency of the primary economic environtment in which the entity operates ( functional currency). The functional currency of the Company and most of the subsidiares are Rupiah. Transaction during the year in foreign currencies are recorded in Rupiah by applying to the foreign currency amount the spot exchange rate between Rupiah and the foreign currency at the date of transactions. At the end of reporting period, foreign currency monetary items are translated to Rupiah using the closing rate, ie middle rate of Bank of Indonesia at March 31, 2025 and December 31, 2024.",
    "IncomeTaxesTextBlock": "Beban pajak adalah jumlah gabungan pajak kini dan pajak tangguhan yang diperhitungkan dalam menentukan laba rugi pada suatu periode. Pajak kini dan pajak tangguhan diakui dalam laba rugi, kecuali pajak penghasilan yang timbul dari transaksi atau peristiwa yang diakui dalam penghasilan komprehensif lain atau secara langsung di ekuitas. Dalam hal ini, pajak tersebut masing-masing diakui dalam penghasilan komprehensif lain atau ekuitas. Jumlah pajak kini untuk periode berjalan dan periode sebelumnya yang belum dibayar diakui sebagai liabilitas. Jika jumlah pajak yang telah dibayar untuk periode berjalan dan periode-periode sebelumnya melebihi jumlah pajak yang terutang untuk periode tersebut, maka kelebihannya diakui sebagai aset. Liabilitas (aset) pajak kini untuk periode berjalan dan periode sebelumnya diukur sebesar jumlah yang diperkirakan akan dibayar kepada (direstitusi dari) otoritas perpajakan, yang dihitung menggunakan tarif pajak (dan undang-undang pajak) yang telah berlaku atau secara substantif telah berlaku pada akhir periode pelaporan. Tax expense is the aggregate amount included in the determination of profit or loss for the period in respect of current tax and deferred tax. Current tax and deferred tax is recognized in profit or loss, except for income tax arising from transactions or events that are recognized in other comprehensive income or directly in equity. In this case, the tax is recognized in other comprehensive income or equity, respectively. Current tax for current and prior periods shall, to the extent unpaid, be recognized as a liability. If the amount already paid in respect of current and prior periods exceeds the amount due for those periods, the excess shall be recognized as an asset. Current tax liabilities (assets) for the current and prior periods shall be measured at the amount expected to be paid to (recovered from) the taxation authorities, using the tax rates (and tax laws) that have been enacted or substantively enacted by the end of the reporting period.",
    "EmployeeBenefitsTextBlock": "Imbalan kerja jangka pendek diakui ketika pekerja telah memberikan jasanya dalam suatu periode akuntansi, sebesar jumlah tidak terdiskonto dari imbalan kerja jangka pendek yang diharapkan akan dibayar sebagai imbalan atas jasa tersebut.\r\nImbalan kerja jangka pendek mencakup antara lain upah, gaji, bonus dan insentif.\r\nImbalan pascakerja seperti pensiun, uang pisah dan uang penghargaan masa kerja. Grup memberikan imbalan pascakerja minimum kepada karyawan yang berhak  berdasarkan Peraturan Pemerintah No.6 Tahun 2023 mulai berlaku pada 31 Maret 2023 yang telah berubah dari sebelumnya Undang-Undang No. 35 tahun 2021 tentang Ketenagakerjaan.\r\nShort-term employee benefits are recognized when an employee has rendered service during accounting period, at the undiscounted amount of  short-term employee benefits expected to be paid in exchange for that service.\r\nShort-term employee benefits include such as wages, salaries, bonus and incentive.\r\nPost-employment benefits such as retirement, severance and service payments. The Group provides minimum post-employment benefits to eligible employees based on Government Regulation No.6 of 2023 which is effective on March 31, 2023 which has changed from the previous Law No. 35 year 2021 concerning Labor Law.",
    "EarningsPerShareTextBlock": "Laba per saham dasar dihitung dengan membagi laba atau rugi yang dapat diatribusikan kepada pemegang saham biasa entitas induk dengan jumlah rata-rata tertimbang saham biasa yang beredar dalam suatu periode.\r\nBasic earnings per share is computed by dividing the profit or loss attributable to ordinary equity holders of the parent by the weighted average number of ordinary shares outstanding during the period.",
    "SegmentReportingTextBlock": "Grup menyajikan segmen operasi berdasarkan informasi keuangan yang digunakan oleh pengambil keputusan operasional dalam menilai kinerja segmen dan menentukan alokasi sumber daya yang dimilikinya. Segmetasi berdasarkan aktivitas dari setiap kegiatan operasi entitas legal di dalam Grup.\r\nThe Group presented operating segments based on the financial information used by the chief operating decision maker in assessing the performance of segments and in the allocation of resources. The segments are based on the activities of each of the operating legal entities within the Group.",
    "DerivativeFinancialInstrumentsTextBlock": "Bila nilai wajar aset keuangan dan liabilitas keuangan yang tercatat pada laporan posisi keuangan tidak tersedia di pasar aktif, ditentukan dengan menggunakan berbagai teknik penilaian termasuk penggunaan model matematika. Masukan (input) untuk model ini berasal dari data pasar yang bisa diamati sepanjang data tersebut tersedia. Bila data pasar yang bisa diamati tersebut tidak tersedia, pertimbangan Manajemen diperlukan untuk menentukan nilai wajar. Pertimbangan tersebut mencakup pertimbangan likuiditas dan masukan model seperti volatilitas untuk transaksi derivatif yang berjangka waktu panjang dan tingkat diskonto, tingkat pelunasan dipercepat, dan asumsi tingkat gagal bayar. Pengungkapan lebih lanjut tentang nilai wajar.\r\nWhere the fair values of financial assets and financial liabilities recorded on the statement of financial position cannot be derived from active markets, they are determined using a variety of valuation techniques that include the use of mathematical models. The inputs to these models are derived from observable market data where possible, but where observable market data are not available, judgment is required to establish fair values. The judgments include considerations of liquidity and model inputs such as volatility for long term derivatives and discount rates, prepaymentrates, and default rate assumptions. The other disclosure on fair value.",
    "BusinessCombinationTextBlock": "Transaksi kombinasi bisnis entitas sepengendali, berupa pengalihan bisnis yang dilakukan dalam rangka reorganisasi entitas-entitas yang berada dalam suatu kelompok usaha yang sama, bukan merupakan perubahan kepemilikan dalam arti substansi ekonomi, sehingga transaksi tersebut tidak dapat menimbulkan laba atau rugi bagi Grup secara keseluruhan ataupun bagi entitas individual dalam Grup.\r\nBusiness combination of entities under common control transactions, such as transfers of business conducted within the framework of the reorganization of the entities that are in the same group, not a change of ownership in terms of economic substance, so that the transaction can not result in a gain or loss for the Group as a whole or the individual entity within the Group.",
    "ForeignCurrencyTransactionsAndBalancesTextBlock": "Dalam menyiapkan laporan keuangan, setiap entitas di dalam grup mencatat dengan menggunakan mata uang dari lingkuangan ekonomi utama di mana entitas beroperasi ( uang fungsional). Mata uang fungsional Perusahaan dan sebagian besar entitas anak adalah Rupiah.\r\nTransaksi-transaksi  selama tahun berjalan dalam mata uang asing dicatat dalam Rupiah dengan kurs spot antara Rupiah dan valuta asing pada tanggal transaksi. Pada akhir periode pelaporan, pos moneter dalam mata uang asing dijabarkan ke dalam Rupiah menggunakan kurs penutup, yaitu kurs tengah Bank Indonesia pada 31 Maret 2025 dan 31 Desember 2024.\r\nIn preparing financial statements, each of the entities within the Group record by using the currency of the primary economic environtment in which the entity operates ( functional currency). The functional currency of the Company and most of the subsidiares are Rupiah.\r\nTransaction during the year in foreign currencies are recorded in Rupiah by applying to the foreign currency amount the spot exchange rate between Rupiah and the foreign currency at the date of transactions. At the end of reporting period, foreign currency monetary items are translated to Rupiah using the closing rate, ie middle rate of Bank of Indonesia at March 31, 2025 and December 31, 2024.",
    "RightOfUseAssetsTextBlock": "Grup menerapkan satu pendekatan pengakuan dan pengukuran bagi seluruh sewa, kecuali untuk sewa jangka pendek dan sewa aset bernilai rendah. Grup mengakui liabilitas sewa untuk melakukan pembayaran sewa dan aset hak guna yang merupakan hak untuk menggunakan aset pendasar.\r\nGrup mengakui aset hak guna pada tanggal dimulainya sewa (yaitu tanggal aset tersedia untuk digunakan). Aset hak guna diukur pada harga perolehan, dikurangi akumulasi penyusutan dan penurunan nilai, dan disesuaikan untuk setiap pengukuran kembali liabilitas sewa. Biaya perolehan aset hak guna mencakup jumlah liabilitas sewa yang diakui, biaya langsung yang timbul di awal, dan pembayaran sewa yang dilakukan pada atau sebelum tanggal mulai dikurangi setiap insentif sewa yang diterima. Aset hak guna disusutkan dengan metode garis lurus selama periode yang lebih pendek antara sewa dan estimasi masa manfaat aset.\r\nThe Group applies a single recognition and measurement approach for all leases, except for short-term leases and leases of low-value assets. The Group recognizes lease liabilities to make lease payments and right of use assets representing the the right to use the underlying assets.\r\nThe Group recognizes right-of-use assets at the commencement date of the lease (i.e., the date underlying assets is available for use). right-of-use assets are measure at cost, less any accumulated depreciation and impairment losses, and adjusted for any remeasurement of lease liabilities. The cost of right-of-use assets includes the amount of lease liabilities recognized, intitial direct costs incurred, and lease payments made at or before the commencement date less any lease incentives received. Right-of-use assets are depreciated on a straght-line basis over the shorter period of the lease term and the estimated useful lives of the assets.",
    "InvestmentPropertiesTextBlock": "Properti investasi adalah properti (tanah atau bangunan atau bagian dari suatu bangunan atau kedua-duanya) yang dikuasai oleh pemilik atau penyewa melalui sewa pembiayaan untuk menghasilkan sewa atau untuk kenaikan nilai atau kedua-duanya, dan tidak untuk digunakan dalam produksi atau penyediaan barang atau jasa atau untuk tujuan administratif; atau dijual dalam kegiatan usaha sehari-hari.\r\nInvestment properties are properties (land or a building or part of a building or both) held by the owner or the lessee under a finance lease to earn rentals or for capital appreciation or supply of goods or services or for administrative putposes; or sale in the daily business activities.",
    "InvestmentInAssociatesTextBlock": "Entitas asosiasi adalah entitas dimana Grup memiliki kekuasaan untuk berpartisipasi dalam keputusan kebijakan keuangan dan operasional investee, tetapi tidak mengendalikan atau mengendalikan bersama atas kebijakan tersebut (pengaruh signifikan).\r\nAssociates are entities which the Group has the power to participate in the financial and operating policy decisions of the investee but is not control or joint control over those policies (significant influence).",
    "IntangibleAssetsTextBlock": "Aset takberwujud diukur sebesar nilai perolehan pada pegakuan awal. Setelah pengakuan awal, aset takberwujud dicatat pada biaya perolehan dikurangi akumulasi amortisasi dan akumulasi rugi penurunan nilai.Intangible asset is measured on initial recognition at cost. After initial recognition, intangible asset is carried at cost less any accumulated amortization and any accumulated impairment loss.",
    "PrepaidExpensesTextBlock": "Biaya dibayar di muka diamortisasi selama masa manfaatnya dengan menggunakan metode garis lurus.  Prepaid expenses are amortized over their beneficial periods by using the straight-line method.",
    "FinancialInstrumentsTextBlock": "Grup ini mengakui aset keuangan atau liabilitas keuangan dalam laporan posisi keuangan konsolidasian, jika dan hanya jika, Grup menjadi salah satu pihak dalam ketentuan pada kontrak instrumen tersebut. Pada saat pengakuan awal aset keuangan atau liabilitas keuangan, Grup mengukur pada nilai wajarnya. Dalam hal aset keuangan atau liabilitas keuangan tidak diukur pada nilai wajar melalui laba rugi, nilai wajar tersebut ditambah atau  dikurang dengan biaya transaksi yang dapat diatribusikan secara langsung dengan perolehan atau penerbitan aset keuangan atau liabilitas keuangan tersebut. Biaya transaksi yang dikeluarkan sehubungan dengan perolehan aset keuangan dan penerbitan liabilitas keuangan yang diklasifikasikan pda nilai wajar melalui laba rugi dibebankan segera. Aset keuangan Grup diklasifikasikan sebagai berikut: aset keuangan yang diukur pada biaya perolehan yang diamortisasi, aset keuangan yang diukur pada nilai wajar melalui penghasilan komprehensif lain, aset keuangan yang diukur pada nilai wajar melalui laba rugi.\r\nThe Grup recognize a financial assets or a financial liabilities in the consolidated statement of financial position when, and only when, it becomes a party o the contractual provisions of the instrument. At initial recognition, the Group measure all financial assets and financial liabilities at its fair value. In the case of a financial assets or financial liability not at fair value through profit or loss, fair value plus or minus with the transaction cost that are directly attributtable to the acquisition or issue of the financial asset or financial liability transaction costs incurred on acquisition of a financial asset and issue of a financial liability classified at fair value through profit or loss are expensed immediately.\r\nThe Group financial assets are classified into the following specified categories: financial assets at amortized costs, financial assets at fair value through other comprehensive income, and financial assets at fair value  through profit or loss.",
    "AdditionInPropertyPlantAndEquipment": "123535162228",
    "DisposalsInPropertyPlantAndEquipment": "40286542079",
    "ReclassificationsOfPropertyPlantAndEquipment": "0",
    "DisclosureofNotesforPropertyPlantandEquipmentTextBlock": "Aset tetap Perusahaan telah diasuransikan kepada PT Asuransi Multi Artha Guna Tbk terhadap risiko kebakaran dan risiko lainnya dengan nilai pertanggungan sebesar Rp. 1,081,101,000,000 per 31 Maret 2025 dan Rp.1,020,601,000,000 per  31 Desember 2024.  Manajemen berpendapat bahwa nilai pertanggungan tersebut cukup untuk menutupi kemungkinan kerugian atas aset tetap yang dipertanggungkan.\r\nTotal tercatat bruto dari setiap aset tetap yang telah disusutkan penuh dan masih digunakan sebesar Rp.950,486,475,684.- dan Rp1,057,043,924,588 pada 31 Maret 2025 dan 31 Desember 2024.\r\nThe Company fixed assets have been insured to PT Asuransi Multi Artha Guna Tbk against risk of fire and other associated risks with a total sum insured Rp.1,081,101,000,000 per March 31, 2025, and Rp.1,020,601,000,000 per  December 31, 2024. Management believes that the insured amount is adequate to cover possible losses from such risk.\r\nTotal gross carrying amount of all fixed assets that have been fully depreciated and still in use amounting to Rp.950,486,475,684 dan Rp1,057,043,924,588 as of March 31, 2025 and December 31, 2024.",
    "AdditionInRightofUseAssets": "368769702140",
    "DisposalsInRightofUseAssets": "298064903628",
    "PartyName": "PT. NUSA PRIMA PANGAN",
    "TradeReceivablesGross": "44904009425",
    "AllowanceForImpairmentOfTradeReceivables": "17999640",
    "TradeReceivablesNet": "44903690425",
    "AdditionOfAllowanceForImpairmentOfTradeReceivables": "319000",
    "ReductionOfMovementOfAllowanceForImpairmentOfTradeReceivables": "17999640",
    "LiveStocksInventoriesGross": "0",
    "LivestockInventories": "0",
    "RealEstateAssetsgross": "0",
    "RealEstateAssets": "0",
    "FinishedGoods": "3396280224516",
    "InventoriesGross": "3396280224516",
    "Inventories": "3396280224516",
    "DisclosureofNotesforInventoriesTextBlock": "Pada tanggal 31 Maret 2025 dan 31 Desember 2024 persediaan telah diasuransikan kepada PT Asuransi Multi Artha Guna Tbk terhadap risiko kebakaran dan risiko lainnya dengan jumlah pertanggungan masing-masing sebesar Rp3,000,859,000,000 untuk tahun 2025 dan Rp2,962,359,000,000 untuk tahun 2024.\r\nAs of March 31, 2025 and December 31, 2024, respectively, inventories have been insured to PT.Asuransi Multi Artha Guna Tbk  against risk of fire and other associated risk with a total sum insured of Rp.3,000,859,000,000 for the year of 2025 and Rp2,962,359,000,000 for the year of 2024, respectively.",
    "TradePayables": "46985130842",
    "CostOfGoodsManufactured": "0",
    "FinishGoodsInventory": "3021255858337",
    "PurcahsedFinishGoodsInventory": "1382149595282",
    "DisclosureofNotesforCostofGoodsSoldTextBlock": "Pembelian kepada pihak berelasi untuk periode yang berakhir pada 31 Maret 2025 dan 31 Maret 2024 masing-masing sebesar Rp66,744,458,871,- dan Rp81,787,626,385,- atau setara dengan 4.28% dan 5.53 % dari jumlah pembelian termasuk pembelian barang konsinyasi.\r\nPersentase pembelian import untuk periode yang berakhir pada tanggal 31 Maret 2025 dan 31 Maret 2024 masing-masing sebesar 88.44% dan 79.23% dari jumlah pembelian. \r\nThe purchases from related parties for one year-month periods ended March 31, 2025 and March 31, 2024 are amounted to Rp 66,744,458,871,- and Rp 81,787,626,385,- or equivalent to 4.28% and 5.53% of the total purchases include consignment purchases respectively.\r\nThe percentage of imported purchases for periods March 31, 2025 and March 31, 2024 are 88.44% and 79.23% from total purchases, respectively."
  }
}