{
  "emiten": "Akasha Wira International Tbk  Tbk",
  "laporan_keuangan": {
    "measure": "shares",
    "identifier": "Fany Soegiarto",
    "instant": "2024-12-31",
    "startDate": "2024-01-01",
    "endDate": "2024-12-31",
    "explicitMember": "idx-cor:OtherCurrencyMember",
    "EntityName": "Akasha Wira International Tbk  Tbk",
    "EntityCode": "ADES",
    "EntityIdentificationNumber": "AA195",
    "EntityMainIndustry": "Umum / General",
    "SelectedAccountingStandards": "PSAK",
    "Sector": "D. Consumer Non-Cyclicals",
    "Subsector": "D2. Food & Beverage",
    "Industry": "D21. Beverages",
    "Subindustry": "D212. Soft Drinks",
    "ControllingShareholderInformation": "Foreign Corporation",
    "TypeOfEntity": "Foreign Company",
    "TypeOfListedSecurities": "Saham / Stock",
    "TypeOfBoardOnWhichTheEntityIsListed": "Pengembangan / Development",
    "WhetherTheFinancialStatementsAreOfAnIndividualEntityOrAGroupOfEntities": "Entitas tunggal / Single entity",
    "PeriodOfFinancialStatementsSubmissions": "Kuartal I / First Quarter",
    "DateOfBoardOfDirectorsStatementLetter": "2025-04-29",
    "CurrentPeriodStartDate": "2025-01-01",
    "CurrentPeriodEndDate": "2025-03-31",
    "PriorYearEndDate": "2024-12-31",
    "PriorPeriodStartDate": "2024-01-01",
    "PriorPeriodEndDate": "2024-03-31",
    "Prior2YearEndDate": "2023-12-31",
    "DescriptionOfPresentationCurrency": "Rupiah / IDR",
    "LevelOfRoundingUsedInFinancialStatements": "Jutaan / In Million",
    "TypeOfReportOnFinancialStatements": "Tidak Diaudit / Unaudit",
    "WhetherInComplianceWithBAPEPAMLKVIIIG11RulesConcerningResponsibilitiesOfBoardOfDirectorsOnFinancialStatements": "Ya / Yes",
    "WhetherInComplianceWithBAPEPAMLKVIIIATwoRulesConcerningIndependenceOfAccountantProvidingAuditServicesInCapitalMarket": "Ya / Yes",
    "CashAndCashEquivalents": "858294000000",
    "ShortTermInvestments": "35697000000",
    "TradeReceivablesThirdParties": "326374000000",
    "OtherReceivablesThirdParties": "5930000000",
    "CurrentInventories": "234517000000",
    "CurrentPrepaidExpenses": "21983000000",
    "OtherCurrentAdvances": "68851000000",
    "CurrentAssets": "1551646000000",
    "NonCurrentFinancialAssetsAmortizedCost": "207688000000",
    "PropertyPlantAndEquipment": "745409000000",
    "IntangibleAssetsOtherThanGoodwill": "4000000",
    "OtherNonCurrentNonFinancialAssets": "27307000000",
    "NonCurrentAssets": "1145228000000",
    "Assets": "2696874000000",
    "TradePayablesThirdParties": "169746000000",
    "CurrentAccruedExpenses": "143191000000",
    "ShortTermPostEmploymentBenefitObligations": "4959000000",
    "TaxesPayable": "65750000000",
    "CurrentMaturitiesOfFinanceLeaseLiabilities": "143000000",
    "CurrentLiabilities": "383789000000",
    "DeferredTaxLiabilities": "15159000000",
    "LongTermFinanceLeaseLiabilities": "7000000",
    "NonCurrentDeposits": "25000000",
    "LongTermPostEmploymentBenefitObligations": "39393000000",
    "NonCurrentLiabilities": "54584000000",
    "Liabilities": "438373000000",
    "CommonStocks": "589897000000",
    "AdditionalPaidInCapital": "5068000000",
    "ReserveOfRemeasurementsOfDefinedBenefitPlans": "14787000000",
    "AppropriatedRetainedEarnings": "213952000000",
    "UnappropriatedRetainedEarnings": "1434797000000",
    "EquityAttributableToEquityOwnersOfParentEntity": "2258501000000",
    "Equity": "2258501000000",
    "LiabilitiesAndEquity": "2696874000000",
    "SalesAndRevenue": "463541000000",
    "CostOfSalesAndRevenue": "221819000000",
    "GrossProfit": "241722000000",
    "SellingExpenses": "70868000000",
    "GeneralAndAdministrativeExpenses": "17344000000",
    "DividendsIncome": "37000000",
    "InterestIncome": "8881000000",
    "InterestAndFinanceCosts": "38000000",
    "GainsLossesOnChangesInForeignExchangeRates": "2344000000",
    "GainsLossesOnChangesInFairValueOfMarketableSecurities": "-1147000000",
    "OtherIncome": "1510000000",
    "OtherExpenses": "2000000",
    "ProfitLossBeforeIncomeTax": "166205000000",
    "TaxBenefitExpenses": "-34801000000",
    "ProfitLossFromContinuingOperations": "131404000000",
    "ProfitLoss": "131404000000",
    "ComprehensiveIncome": "131404000000",
    "ProfitLossAttributableToParentEntity": "131404000000",
    "ComprehensiveIncomeAttributableToParentEntity": "131404000000",
    "BasicEarningsLossPerShareFromContinuingOperations": "0.000223",
    "BalanceBeforeRestatementAtBeginningOfPeriod": "1729808000000",
    "EquityPositionBeginningOfThePeriod": "1729808000000",
    "ProfitLossChangesInEquity": "131404000000",
    "EquityPositionEndOfThePeriod": "1861212000000",
    "ReceiptsFromCustomers": "410383000000",
    "PaymentsToSuppliersForGoodsAndServices": "196678000000",
    "PaymentsForSalariesAndAllowances": "39804000000",
    "PaymentsForGeneralAndAdministrativeExpense": "54113000000",
    "CashGeneratedFromUsedInOperations": "119788000000",
    "InterestInvestmentIncomeFeesAndCommissionsReceived": "8880000000",
    "PaymentsOfInterestAndBonusFeesAndCommissions": "38000000",
    "IncomeTaxesRefundedPaidFromOperatingActivities": "-33715000000",
    "OtherCashInflowsOutflowsFromOperatingActivities": "-2263000000",
    "NetCashFlowsReceivedFromUsedInOperatingActivitiesBeforeChangesInAssetsAndLiabilities": "92652000000",
    "NetCashFlowsReceivedFromUsedInOperatingActivities": "92652000000",
    "PaymentsForAdvancesForPurchaseOfPropertyPlantAndEquipment": "8868000000",
    "ProceedsFromDisposalOfPropertyPlantAndEquipment": "560000000",
    "PaymentsForAcquisitionOfPropertyPlantAndEquipment": "5801000000",
    "WithdrawalPlacementOfShortTermInvestments": "-12732000000",
    "WithdrawalPlacementOfBondsAndOrSukuk": "-17105000000",
    "NetCashFlowsReceivedFromUsedInInvestingActivities": "-43946000000",
    "PaymentsOfConsumerFinancingPayables": "220000000",
    "NetCashFlowsReceivedFromUsedInFinancingActivities": "-220000000",
    "NetIncreaseDecreaseInCashAndCashEquivalents": "48486000000",
    "CashAndCashEquivalentsCashFlows": "802788000000",
    "EffectOfExchangeRateChangesOnCashAndCashEquivalents": "794000000",
    "CashAndCashEquivalentsTextBlock": "Kas dan setara kas terdiri dari kas dan kas pada bank dan semua deposito berjangka yang tidak dibatasi penggunaannya (termasuk deposito on call) yang jatuh tempo dalam jangka waktu tiga bulan atau kurang sejak tanggal penempatan dan deposito yang jatuh tempo dalam jangka waktu lebih dari tiga bulan digunakan untuk kebutuhan kas jangka pendek dan tidak memiliki risiko perubahan nilai yang signifikan sebagai akibat penarikan dini. Kas merupakan alat pembayaran yang siap dan bebas dipergunakan untuk membiayai kegiatan umum Perusahaan.   \n\nKas dan setara kas yang telah ditentukan penggunaannya atau yang tidak dapat digunakan secara bebas tidak tergolong dalam kas dan setara kas.",
    "TradeAndOtherReceivablesTextBlock": "Pada saat pengakuan awal piutang usaha diukur pada nilai wajarnya dan selanjutnya diukur pada biaya perolehan diamortisasi dengan menggunakan metode bunga efektif apabila dampak pendiskontoan signifikan, dikurangi dengan penyisihan  atas penurunan nilai.\n\nPiutang usaha dihentikan pengakuannya ketika hak kontraktual Perusahaan atas arus kas yang berasal dari piutang usaha tersebut kadaluarsa, yaitu ketika aset ditransfer dan ketika seluruh risiko dan manfaat atas kepemilikan aset keuangan telah ditransfer kepada pihak lain.\n\nPiutang usaha dihentikan pengakuannya ketika hak kontraktual Perusahaan atas arus kas yang berasal dari piutang usaha tersebut kadaluarsa, yaitu ketika aset ditransfer dan ketika seluruh risiko dan manfaat atas kepemilikan aset keuangan telah ditransfer kepada pihak lain.",
    "InventoriesTextBlock": "Persediaan awalnya diakui sebesar nilai perolehan dan selanjutnya diukur pada nilai yang lebih rendah antara biaya perolehan maupun nilai realisasi bersih. Biaya perolehan ditentukan dengan menggunakan metode Masuk Pertama, Keluar Pertama untuk persediaan                  air minum dalam kemasan dan metode Rata-rata Tertimbang untuk persediaan kosmetik. Biaya perolehan mencakup biaya pembelian, biaya konversi dan biaya-biaya lainnya yang terjadi di dalam membawa persediaan ke lokasi dan kondisi saat ini. Biaya perolehan tidak termasuk biaya pinjaman.\n\nNilai realisasi bersih adalah estimasi harga jual dalam kegiatan usaha biasa dikurangi estimasi biaya penyelesaian dan estimasi biaya yang diperlukan untuk membuat penjualan.\nPenyisihan untuk persediaan usang dan tidak lancar ditentukan berdasarkan penelaahan terhadap keadaan persediaan pada akhir tahun.",
    "FixedAssetsTextBlock": "Awalnya suatu aset tetap diukur sebesar biaya perolehan, yang terdiri dari harga perolehannya dan biaya-biaya yang dapat diatribusikan secara langsung untuk membawa aset ke lokasi dan kondisi yang diinginkan agar aset siap digunakan sesuai dengan keinginan dan maksud manajemen, serta estimasi awal biaya pembongkaran dan pemindahan aset tetap dan restorasi lokasi aset.\nAset dalam penyelesaian dinyatakan sebesar biaya perolehan dan dipindahkan ke aset tetap yang bersangkutan pada saat selesai dan siap digunakan.\nPerusahaan memilih untuk menerapkan model biaya, sehingga aset tetap Perusahaan dicatat sebesar biaya perolehan dikurangi akumulasi penyusutan dan akumulasi rugi penurunan nilai aset. Tanah diakui sebesar biaya perolehan dan tidak disusutkan.\nBiaya-biaya setelah perolehan awal seperti penggantian komponen dan inspeksi yang signifikan, diakui dalam jumlah tercatat aset tetap jika besar kemungkinan manfaat ekonomis di masa depan akan mengalir ke Perusahaan dan biaya tersebut dapat diukur secara andal. Sisa jumlah tercatat biaya komponen yang diganti atau biaya inspeksi terdahulu dihentikan pengakuannya. Biaya perawatan sehari-hari aset tetap diakui sebagai beban pada saat terjadinya.",
    "TradePayablesAndOtherLiabilitiesTextBlock": "Utang usaha pada awalnya diukur sebesar nilai wajar dan selanjutnya diukur pada biaya perolehan diamortisasi dengan menggunakan metode bunga efektif.",
    "RevenueAndExpenseRecognitionTextBlock": "Pengakuan pendapatan harus memenuhi lima (5) langkah analisa sebagai berikut:\n1.\tIdentifikasi kontrak dengan pelanggan.\n2.\tIdentifikasi kewajiban pelaksanaan dalam kontrak. Kewajiban pelaksanaan merupakan janji-janji dalam kontrak untuk menyerahkan barang atau jasa yang memiliki karakteristik berbeda ke pelanggan.\n3.\tPenetapan harga transaksi. Harga transaksi merupakan jumlah imbalan yang berhak diperoleh suatu entitas sebagai kompensasi atas diserahkannya barang atau jasa yang dijanjikan ke pelanggan.\nJika imbalan yang dijanjikan di kontrak mengandung suatu jumlah yang bersifat variabel, maka Perusahaan membuat estimasi jumlah imbalan tersebut sebesar jumlah yang diharapkan berhak diterima atas diserahkannya barang atau jasa yang dijanjikan ke pelanggan dikurangi dengan estimasi jumlah jaminan kinerja jasa yang akan dibayarkan selama periode kontrak.\n4.\tAlokasi harga transaksi ke setiap kewajiban pelaksanaan dengan menggunakan dasar harga jual berdiri sendiri relatif dari setiap barang atau jasa berbeda yang dijanjikan di kontrak. Ketika tidak dapat diamati secara langsung, harga jual berdiri sendiri relative diperkirakan berdasarkan biaya yang diharapkan ditambah marjin.\n5.\tPengakuan pendapatan ketika kewajiban pelaksanaan telah dipenuhi dengan menyerahkan barang atau jasa yang dijanjikan ke pelanggan (ketika pelanggan telah memiliki kendali atas barang atau jasa tersebut).\n\nBiaya berkurang dalam manfaat ekonomi selama periode akuntansi dalam bentuk outflow atau penurunan aset atau kewajiban yang mengakibatkan penurunan ekuitas, selain yang berkaitan dengan distribusi kepada peserta ekuitas. Beban diakui sesuai dengan masa manfaatnya.\nBeban barang yang terjual termasuk biaya material langsung, tenaga kerja dan biaya manufaktur. Hal ini diakui ketika barang dikirim atau ketika biaya yang dikeluarkan.\nPengeluaran penjualan terdiri dari beban yang berkaitan dengan pengembangan dan pelaksanaan kegiatan promosi pemasaran dan semua beban yang berhubungan dengan penjualan dan penyervisan produk perusahaan. Beban ini umumnya diakui ketika layanan diberikan atau biaya yang dikeluarkan.\nBiaya yang dikeluarkan dalam administrasi umum dari operasi sehari-hari Perusahaan dan umumnya diakui ketika layanan diberikan atau biaya yang dikeluarkan.",
    "ForeignCurrencyTranslationTextBlock": "Transaksi dalam mata uang asing dijabarkan terhadap mata uang fungsional Perusahaan dengan nilai tukar pada tanggal transaksi.",
    "TransactionsWithRelatedPartiesTextBlock": "i. Orang atau anggota keluarga dekatnya mempunyai relasi dengan entitas pelapor jika orang tersebut:\no memiliki pengendalian atau pengendalian bersama atas entitas pelapor;\no memiliki pengaruh signifikan atas entitas pelapor; atau\no merupakan personil manajemen kunci entitas pelapor atau entitas induk dari entitas pelapor.\nii.\tSuatu entitas berelasi dengan entitas pelapor jika memenuhi salah satu dari kondisi berikut:\no\tEntitas dan entitas pelapor adalah anggota dari Grup yang sama (artinya entitas induk, entitas anak, dan entitas anak berikutnya saling berelasi dengan entitas lain);\no\tSatu entitas adalah entitas asosiasi atau ventura bersama dari entitas lain (atau entitas asosiasi atau ventura bersama yang merupakan anggota suatu Perusahaan, yang mana entitas lain tersebut adalah anggotanya);\no\tKedua entitas tersebut adalah ventura bersama dari pihak ketiga yang sama;\no\tSatu entitas adalah ventura bersama dari entitas ketiga dan entitas yang lain adalah entitas asosiasi dari entitas ketiga;\no\tEntitas tersebut adalah suatu program imbalan pascakerja untuk imbalan kerja dari salah satu entitas pelapor atau entitas yang terkait dengan entitas pelapor. Apabila entitas pelapor adalah entitas yang menyelenggarakan program tersebut, maka entitas sponsor juga berelasi dengan entitas pelapor;\no\tEntitas dikendalikan atau dikendalikan bersama oleh seseorang yang diidentifikasi pada huruf i)\no\tOrang yang diidentifikasikan dalam huruf i) memiliki pengaruh signifikan atas entitas atau merupakan personil manajemen kunci entitas (atau entitas induk dari entitas).\no\tentitas, atau anggota dari kelompok yang              mana entitas merupakan bagian dari kelompok tersebut, menyediakan jasa personal manajemen kunci kepada entitas pelapor atau kepada entitas induk dari entitas pelapor.\no\tEntitas dan entitas pelapor adalah anggota dari KU yang sama (artinya entitas induk, entitas anak, dan entitas anak berikutnya saling berelasi dengan entitas lain);",
    "IncomeTaxesTextBlock": "Perusahaan menerapkan PSAK 212 (Revisi 2010) [dahulu PSAK 46 (Revisi 2010)], Pajak Penghasilan yang mengatur mengenai perlakuan akuntansi untuk pajak penghasilan dalam menghitung konsekuensi pajak kini dan masa depan untuk pemulihan (penyelesaian) jumlah tercatat aset (liabilitas) yang diakui dalam laporan posisi keuangan.  \nBeban pajak final diakui proporsional dengan jumlah pendapatan menurut akuntansi yang diakui pada tahun berjalan. Selisih antara jumlah pajak penghasilan final yang dibayar dengan jumlah yang dibebankan pada perhitungan laba rugi, diakui sebagai pajak dibayar di muka atau utang pajak. Bila penghasilan telah dikenakan pajak penghasilan final, perbedaan antara nilai tercatat aset dan liabilitas dengan dasar pengenaan pajaknya tidak diakui sebagai aset atau liabilitas tangguhan.\nBeban pajak kini ditentukan berdasarkan laba kena pajak dalam tahun yang bersangkutan yang dihitung berdasarkan tarif pajak yang berlaku.\nPajak tangguhan ditentukan dengan menggunakan tarif pajak yang telah diberlakukan dan diharapkan berlaku pada saat aset pajak tangguhan direalisasi atau liabilitas pajak tangguhan diselesaikan.  Perubahan nilai tercatat aset dan liabilitas pajak tangguhan yang disebabkan oleh perubahan tarif pajak dibebankan pada laporan laba rugi dan penghasilan komprehensif lain tahun berjalan.",
    "ProvisionsTextBlock": "Perusahaan mengakui provisi apabila memiliki kewajiban kini (baik secara hukum maupun konstruktif) sebagai akibat peristiwa masa lalu apabila besar kemungkinan penyelesaian kewajiban tersebut mengakibatkan arus keluar sumber daya dan dapat diestimasi dengan andal.",
    "EmployeeBenefitsTextBlock": "Biaya jasa diakui dalam laba atau rugi, dan termasuk biaya jasa saat ini dan masa lalu, serta kurtailmen keuntungan dan kerugian.\nBeban bunga neto (pendapatan) diakui dalam laba rugi dan dihitung dengan menerapkan tingkat diskonto untuk mengukur kewajiban imbalan pasti (aset) pada awal periode tahunan hingga pembayaran manfaat selama periode.\nKeuntungan atau kerugian yang timbul dari perubahan manfaat skema atau kurtailmen diakui secara langsung dalam laba rugi.\nSesuai dengan Undang-undang Ketenagakerjaan Republik Indonesia No. 11/2020 dan Peraturan Pemerintah Nomor 35/2021, Perusahaan diwajibkan untuk memberikan imbalan kerja bagi karyawan pada saat pemutusan hubungan kerja atau pada saat karyawan pensiun. Imbalan tersebut terutama berdasarkan masa kerja dan kompensasi karyawan pada saat pemutusan hubungan kerja atau pensiun. \nPada bulan April 2022, Dewan Standar Akuntansi Keuangan Ikatan Akuntan Indonesia menerbitkan materi penjelasan melalui siaran pers atas persyaratan pengatribusian imbalan pada periode jasa sesuai PSAK 24 - Imbalan Kerja yang diadopsi dari IAS 19, Employee Benefits. Materi penjelasan tersebut menyampaikan informasi bahwa pola fakta umum dari program pensiun berbasis undang-undang ketenagakerjaan yang berlaku di Indonesia saat ini memiliki pola fakta serupa dengan yang ditanggapi dan disimpulkan dalam IFRS Intepretation Committee Agenda Decision (IFRIC AD) Attributing Benefit to Periods of Service (IAS 19). \nDengan menerapkan materi penjelasan tersebut maka Perusahaan mengubah kebijakan akuntansi menyangkut atribusi imbalan kerja pada periode jasa dari yang diterapkan saat ini.\nAsumsi utama aktuaria yang digunakan oleh Kantor Konsultan Aktuaria Nandi dan Sutama, aktuaris independen, dengan menggunakan  metode    Unit  Credit.",
    "EarningsPerShareTextBlock": "Laba per saham dihitung berdasarkan rata-rata tertimbang saham beredar/ditempatkan dalam tahun yang bersangkutan.",
    "DividendsTextBlock": "Perusahaan menetapkan jumlah modal yang dibutuhkan yang seimbang dengan risiko. Perusahaan mengelola struktur permodalan dan membuat pertimbangan terhadap jumlah modal yang dibutuhkan terkait dengan perubahan kondisi ekonomi dan karakteristik risiko aset yang mendasarinya. Untuk memelihara atau menyesuaikan struktur permodalan, Perusahaan mungkin menyesuaikan jumlah dividen yang dibayarkan kepada pemegang saham, imbal hasil modal kepada pemegang saham, menerbitkan saham-saham baru, atau menjual aset untuk mengurangi utang.",
    "SegmentReportingTextBlock": "Perusahaan mengidentifikasikan bahwa ada dua segmen usaha, yaitu pengolahan dan pendistribusian air minum dalam kemasan serta manufaktur dan perdagangan makanan dan produk-produk kosmetik, dan dua segmen  geografis, yaitu Indonesia dan Luar Negeri. Informasi keuangan yang digunakan manajemen untuk mengevaluasi kinerja segmen disajikan pada Catatan 31.",
    "TheImplementationOfNewStatementsOfAccountingStandardsTextBlock": "Berikut ini adalah standar revisi yang telah diterbitkan dan berlaku efektif pada tahun 2024 namun tidak menimbulkan dampak material terhadap laporan keuangan Perusahaan:\n\n-\tPSAK 107  (dahulu PSAK 60) Laporan Keuangan: Pengungkapan;\n-\tPSAK 116 (dahulu PSAK 73) Sewa;\n-\tPSAK 201 (dahulu PSAK 1) Penyajian Laporan Keuangan; dan,\n-\tPSAK 207 (dahulu SFAS 2) Laporan Arus Kas.",
    "DeterminationOfFairValueTextBlock": "Penentuan nilai wajar instrumen keuangan memerlukan adanya estimasi-estimasi tertentu. Dalam pasar yang tidak aktif, manajemen menggunakan teknik penilaian tertentu untuk menentukan nilai wajar. Manajemen memilih teknik penilaian yang dapat memaksimumkan penggunaan parameter yang dapat diamati dan meminimalkan penggunaan yang tidak dapat diamati dalam menentukan nilai wajar. Ketika menentukan nilai wajar dengan cara tersebut di atas, manajemen juga memasukkan unsur kondisi pasar saat ini serta membuat penyesuaian risiko yang dianggap tepat akan dibuat oleh pelaku pasar.",
    "ForeignCurrencyTransactionsAndBalancesTextBlock": "Aset dan liabilitas moneter yang didenominasikan dalam mata uang asing ditranslasikan menjadi mata uang fungsional dengan nilai tukar pada setiap akhir periode pelaporan. Nilai tukar yang digunakan sebagai tolok ukur adalah nilai tukar yang ditetapkan oleh Bank Indonesia. Aset dan liabilitas non-moneter yang diukur pada nilai wajar di dalam mata uang asing ditranslasikan menjadi mata uang fungsional pada nilai tukar ketika nilai wajar ditetapkan.\n\nAset dan liabilitas moneter yang didenominasikan dalam mata uang asing ditranslasikan menjadi mata uang fungsional dengan nilai tukar pada setiap akhir periode pelaporan. Nilai tukar yang digunakan sebagai tolok ukur adalah nilai tukar yang ditetapkan oleh Bank Indonesia. Aset dan liabilitas non-moneter yang diukur pada nilai wajar di dalam mata uang asing ditranslasikan menjadi mata uang fungsional pada nilai tukar ketika nilai wajar ditetapkan.\nKeuntungan dan kerugian nilai tukar mata uang asing yang timbul akibat penyelesaian unsur-unsur moneter atau dari translasi unsur-unsur moneter yang didenominasi di dalam mata uang asing pada akhir periode pelaporan, diakui di dalam laba rugi.",
    "PlacementsWithBankIndonesiaAndOtherBanksTextBlock": "Penempatan bank jangka pendek adalah penempatan dalam bentuk deposito berjangka yang jatuh temponya lebih dari tiga bulan tetapi tidak lebih dari satu tahun. Hal ini dinyatakan sebesar biaya perolehan diamortisasi dengan menggunakan suku bunga efektif dikurangi penyisihan kerugian penurunan nilai.",
    "RightOfUseAssetsTextBlock": "Perusahaan menyajikan aset hak-guna sebagai bagian dari  tetap - neto (Catatan 10). Tidak ada liabilitas sewa yang terkait dengan aset hak guna usaha ini karena seluruhnya telah dibayar di muka oleh Perusahaan.",
    "IntangibleAssetsTextBlock": "Aset tak berwujud yang dimiliki Perusahaan terdiri dari perangkat lunak yang memiliki masa umur manfaat ekonomis empat (4) tahun. Perangkat lunak pada awalnya diukur sebesar biaya perolehan yang mencakup semua biaya yang dapat diatribusikan secara langsung dalam mempersiapkan aset tersebut sehingga siap untuk digunakan. Setelah pengakuan awal, perangkat lunak diukur sebesar biaya perolehan dikurangi akumulasi amortisasi dan akumulasi rugi penurunan nilai aset.\nPengeluaran selanjutnya yang jumlahnya signifikan akan dikapitalisasi hanya jika pengeluaran tersebut menambah manfaat ekonomis aset yang bersangkutan di masa mendatang. Pengeluaran lainnya dibebankan pada saat terjadinya.",
    "PrepaidExpensesTextBlock": "Pengeluaran-pengeluaran yang memiliki manfaat untuk periode lebih dari satu tahun dicatat sebagai biaya dibayar di muka dan diamortisasi menggunakan metode garis lurus selama periode dimana manfaat itu terealisasi.",
    "ShareCapitalTextBlock": "Instrumen keuangan yang diterbitkan oleh Perusahaan di klasifikasikan sebagai ekuitas hanya sebatas ketika instrumen keuangan tersebut tidak memenuhi definisi aset atau liabilitas keuangan.\nSaham biasa Perusahaan diklasifikasikan sebagai instrumen ekuitas.\nTambahan modal disetor merupakan selisih antara nilai nominal saham dengan harga jual saham yang ditawarkan kepada masyarakat. Semua biaya yang berkaitan langsung dengan penerbitan saham dicatat sebagai pengurang tambahan modal disetor.\nPada tanggal 31 Desember 2023 dan 2022, seluruh saham Perusahaan telah tercatat pada Bursa Efek Indonesia. Seluruh saham yang diterbitkan oleh Perusahaan telah disetor penuh.",
    "FinancialInstrumentsTextBlock": "Instrumen keuangan adalah setiap kontrak yang memberikan kenaikan nilai aset keuangan dari satu entitas dan liabilitas keuangan atau instrumen ekuitas dari entitas lainnya.\nAset keuangan Perusahaan terutama terdiri dari kas dan setara kas, penempatan bank jangka pendek, investasi jangka pendek, piutang usaha, piutang non-usaha, investasi pada utang instrumen dan uang jaminan.\nLiabilitas keuangan Perusahaan terutama terdiri dari utang usaha, utang non-usaha dan akrual; uang jaminan pelanggan dan liabilitas sewa (lihat Catatan 35). Liabilitas keuangan diklasifikasikan sebagai liabilitas jangka panjang jika jatuh tempo melebihi 12 bulan dan sebagai liabilitas jangka pendek jika jatuh tempo yang tersisa kurang dari 12 bulan.",
    "EventsAfterReportingPeriodTextBlock": "Peristiwa setelah periode pelaporan yang memberikan bukti kondisi yang ada pada akhir periode pelaporan (adjusting events) tercermin dalam laporan keuangan. \n\n\nPeristiwa setelah periode pelaporan yang tidak berdampak pada laporan keuangan diungkapkan dalam catatan atas laporan keuangan apabila material.",
    "AccountingStandardsIssuedButNotYetEffectiveTextBlock": "Di bawah ini disajikan standar baru, amandemen dan interpretasi Pernyataan Standar Akuntansi Keuangan yang telah diterbitkan yang akan berlaku efektif sejak tanggal 2025:\n\n\tPSAK 117 (dahulu PSAK 74) Kontrak Asuransi;\n\tPSAK 221 (dahulu PSAK 10) Pengaruh Perubahan Kurs Valuta Asing;\n\tPSAK untuk Entitas Privat; dan,\n\tPSAK 370 (dahulu PSAK 70) Akuntasi Aset dan Liabilitas Pengampunan Pajak.\n\nPerusahaan sedang mempelajari dampak yang mungkin timbul atas penerbitan standar akuntansi keuangan tersebut terhadap laporan keuangannya.",
    "ConsumerFinancingLiabilitiesTextBlock": "Liabilitas sewa diukur pada nilai kini pembayaran sewa yang belum dibayar pada tanggal permulaan, didiskontokan dengan menggunakan suku bunga implisit dalam sewa atau jika suku bunga tersebut tidak dapat ditentukan, maka menggunakan suku bunga pinjaman inkremental.\nPembayaran sewa dialokasikan menjadi bagian pokok dan biaya bunga. Biaya bunga dibebankan pada laba rugi selama periode sewa sehingga menghasilkan tingkat suku bunga periodik yang konstan atas saldo liabilitas untuk setiap periode.",
    "AdditionInPropertyPlantAndEquipment": "55939000000",
    "ReclassificationsOfPropertyPlantAndEquipment": "-105863000000",
    "DisposalsInPropertyPlantAndEquipment": "3728000000",
    "DisclosureofNotesforPropertyPlantandEquipmentTextBlock": "Perusahaan memiliki beberapa bidang tanah yang terletak di Jakarta dan di Propinsi Jawa Timur, Jawa Barat dan Banten, dengan Hak Guna Bangunan yang akan berakhir antara tahun 2024 sampai dengan 2046. Manajemen Perusahaan berpendapat tidak terdapat masalah dengan perpanjangan hak atas tanah karena seluruh tanah diperoleh secara sah dan didukung dengan bukti kepemilikan yang memadai.\n\nAset dalam Penyelesaian\nPada tanggal 31 Maret 2025 dan 31 Desember 2024, persentase aset dalam penyelesaian masing-masing adalah 60% dan 39% dari total nilai kontrak.\n\nAset tetap diasuransikan terhadap risiko kebakaran, penjarahan, huru hara, pemogokan, tindak kejahatan, angin topan, badai dan banjir berdasarkan suatu paket polis gabungan dengan nilai pertanggungan sebesar Rp 348 milyar untuk tahun 2025 dan tahun 2024 kepada pihak ketiga, PT Asuransi Adira Dinamika, PT Lippo General Insurance Tbk, PT Asuransi Umum BCA dan PT Asuransi Wahana Tata, PT Asuransi FPG Indonesia. Manajemen menganggap jumlah pertanggungan tersebut memadai.\n\nPerusahaan melakukan peninjauan kembali atas masa manfaat dan nilai residu aset tetap, dan tidak terdapat perubahan masa manfaat maupun nilai residu untuk aset tetap pada tahun 2025 dan 2024.",
    "ServiceOrProductName": "Kosmetik",
    "TradeReceivablesGross": "353802000000",
    "AllowanceForImpairmentOfTradeReceivables": "25338000000",
    "TradeReceivablesNet": "326374000000",
    "AdditionOfAllowanceForImpairmentOfTradeReceivables": "2090000000",
    "FinishedGoods": "70192000000",
    "WorkInProcess": "4792000000",
    "RawAndIndirectMaterial": "159533000000",
    "InventoriesGross": "234517000000",
    "Inventories": "234517000000",
    "DisclosureofNotesforInventoriesTextBlock": "Jumlah persediaan yang dibebankan pada beban pokok penjualan adalah sebesar Rp 238.415 dan Rp 166.498 masing-masing untuk periode yang berakhir pada tanggal-tanggal 31 Maret 2025 dan 2024\n\nPersediaan Perusahaan telah diasuransikan terhadap kerugian akibat kebakaran, penjarahan, huru hara, pemogokan, kerusakan akibat kejahatan, angin topan, badai dan banjir sebesar Rp 87 miliar (rupiah penuh) pada tanggal 31 Maret 2025 dan 31 Desember 2024, yang dalam pendapat Manajemen, cukup untuk menutup kemungkinan kerugian yang timbul dari risiko tersebut.\n\nManajemen Perusahaan berkeyakinan bahwa persediaan dapat direalisasikan diatas nilai tercatat diatas, sehingga tidak perlu dilakukan penyisihan kerugian atas persediaan tersebut.",
    "TradePayables": "169746000000",
    "RawInventory": "54844000000",
    "PurcahsedRawInventory": "167659000000",
    "RawInventoryUsed": "169232000000",
    "WagesAndDirectLabor": "7986000000",
    "OtherManufacturingOverhead": "47335000000",
    "ProductionCost": "224553000000",
    "WipInventory": "2326000000",
    "CostOfGoodsManufactured": "226152000000",
    "FinishGoodsInventory": "58141000000",
    "PurcahsedFinishGoodsInventory": "992000000",
    "DisclosureofNotesforCostofGoodsSoldTextBlock": "Untuk periode yang berakhir pada tanggal-tanggal 31 Maret 2025 dan 2024, seluruh penjualan Perusahaan dilakukan dengan pihak ketiga.\n\nSeluruh penjualan Perusahaan memenuhi kewajibannya pada suatu waktu tertentu."
  }
}