{
  "emiten": "PT Adaro Andalan Indonesia Tbk",
  "laporan_keuangan": {
    "measure": "shares",
    "identifier": "aadi_maker",
    "instant": "2024-12-31",
    "startDate": "2024-01-01",
    "endDate": "2024-12-31",
    "explicitMember": "idx-cor:OtherCurrencyMember",
    "EntityName": "PT Adaro Andalan Indonesia Tbk",
    "EntityCode": "AADI",
    "EntityIdentificationNumber": "AB271",
    "EntityMainIndustry": "Umum / General",
    "SelectedAccountingStandards": "PSAK",
    "Sector": "A. Energy",
    "Subsector": "A1. Oil, Gas & Coal",
    "Industry": "A12. Coal",
    "Subindustry": "A121. Coal Production",
    "ControllingShareholderInformation": "National Corporation",
    "TypeOfEntity": "Local Company - Indonesia Jurisdiction",
    "TypeOfListedSecurities": "Saham / Stock",
    "TypeOfBoardOnWhichTheEntityIsListed": "Utama / Main",
    "WhetherTheFinancialStatementsAreOfAnIndividualEntityOrAGroupOfEntities": "Entitas grup / Group entity",
    "PeriodOfFinancialStatementsSubmissions": "Kuartal I / First Quarter",
    "DateOfBoardOfDirectorsStatementLetter": "2025-04-29",
    "CurrentPeriodStartDate": "2025-01-01",
    "CurrentPeriodEndDate": "2025-03-31",
    "PriorYearEndDate": "2024-12-31",
    "PriorPeriodStartDate": "2024-01-01",
    "PriorPeriodEndDate": "2024-03-31",
    "Prior2YearEndDate": "2023-12-31",
    "DescriptionOfPresentationCurrency": "Dollar Amerika / USD",
    "LevelOfRoundingUsedInFinancialStatements": "Ribuan / In Thousand",
    "TypeOfReportOnFinancialStatements": "Tidak Diaudit / Unaudit",
    "WhetherInComplianceWithBAPEPAMLKVIIIG11RulesConcerningResponsibilitiesOfBoardOfDirectorsOnFinancialStatements": "Ya / Yes",
    "WhetherInComplianceWithBAPEPAMLKVIIIATwoRulesConcerningIndependenceOfAccountantProvidingAuditServicesInCapitalMarket": "Ya / Yes",
    "CashAndCashEquivalents": "1518688000",
    "CurrentFinancialAssetsAtFairValueThroughProfitOrLoss": "52344000",
    "CurrentFinancialAssetsFairValueThroughOtherComprehensiveIncome": "10162000",
    "TradeReceivablesThirdParties": "304815000",
    "TradeReceivablesRelatedParties": "96693000",
    "OtherReceivablesThirdParties": "17063000",
    "OtherReceivablesRelatedParties": "546000",
    "CurrentInventories": "68549000",
    "CurrentPrepaidExpenses": "6584000",
    "OtherCurrentAdvances": "15157000",
    "CurrentPrepaidTaxes": "123110000",
    "OtherCurrentNonFinancialAssets": "341000",
    "CurrentAssets": "2214052000",
    "NonCurrentRestrictedFunds": "37488000",
    "OtherNonCurrentReceivablesThirdParties": "42853000",
    "InvestmentsInJointVentures": "758355000",
    "InvestmentsInAssociates": "129048000",
    "OtherNonCurrentAdvances": "65282000",
    "NonCurrentFinancialAssetsAtFairValueThroughProfitOrLoss": "4780000",
    "NonCurrentFinancialAssetsFairValueThroughOtherComprehensiveIncome": "483065000",
    "NonCurrentPrepaidExpenses": "7098000",
    "NonCurrentPrepaidTaxes": "32687000",
    "DeferredTaxAssets": "42223000",
    "PropertyPlantAndEquipment": "532512000",
    "MiningProperties": "416209000",
    "Goodwill": "737278000",
    "IntangibleAssetsOtherThanGoodwill": "2335000",
    "OtherNonCurrentNonFinancialAssets": "45165000",
    "NonCurrentAssets": "3778606000",
    "Assets": "5992658000",
    "TradePayablesThirdParties": "172642000",
    "TradePayablesRelatedParties": "295542000",
    "DividendsPayable": "16831000",
    "CurrentAccruedExpenses": "267135000",
    "ShortTermPostEmploymentBenefitObligations": "1436000",
    "TaxesPayable": "25351000",
    "CurrentMaturitiesOfBankLoans": "40884000",
    "CurrentMaturitiesOfFinanceLeaseLiabilities": "2656000",
    "OtherCurrentNonFinancialLiabilities": "50222000",
    "CurrentLiabilities": "872699000",
    "DeferredTaxLiabilities": "60440000",
    "NonCurrentDueToRelatedParties": "776335000",
    "LongTermBankLoans": "645705000",
    "LongTermFinanceLeaseLiabilities": "2352000",
    "NonCurrentProvisionsForRestorationAndRehabilitation": "206773000",
    "LongTermPostEmploymentBenefitObligations": "29068000",
    "OtherNonCurrentFinancialLiabilities": "35804000",
    "NonCurrentLiabilities": "1756477000",
    "Liabilities": "2629176000",
    "CommonStocks": "2519582000",
    "AdditionalPaidInCapital": "-96511000",
    "ReserveOfExchangeDifferencesOnTranslation": "-38741000",
    "ReserveForChangesInFairValueOfFairValueThroughOtherComprehensiveIncomeFinancialAssets": "12395000",
    "OtherReserves": "13547000",
    "OtherComponentsOfEquity": "148778000",
    "AppropriatedRetainedEarnings": "45000000",
    "UnappropriatedRetainedEarnings": "394841000",
    "EquityAttributableToEquityOwnersOfParentEntity": "2998891000",
    "NonControllingInterests": "364591000",
    "Equity": "3363482000",
    "LiabilitiesAndEquity": "5992658000",
    "SalesAndRevenue": "1265324000",
    "CostOfSalesAndRevenue": "881570000",
    "GrossProfit": "433009000",
    "SellingExpenses": "14804000",
    "GeneralAndAdministrativeExpenses": "60609000",
    "FinanceIncome": "27362000",
    "InterestAndFinanceCosts": "14027000",
    "GainsLossesOnChangesInForeignExchangeRates": "-6585000",
    "ShareOfProfitLossOfAssociatesAccountedForUsingEquityMethod": "19242000",
    "ShareOfProfitLossOfJointVenturesAccountedForUsingEquityMethod": "-4284000",
    "GainsLossesOnChangesInFairValueOfMarketableSecurities": "-2890000",
    "OtherIncome": "2172000",
    "OtherExpenses": "244000",
    "ProfitLossBeforeIncomeTax": "378342000",
    "TaxBenefitExpenses": "-66774000",
    "ProfitLossFromContinuingOperations": "311568000",
    "ProfitLoss": "311568000",
    "OtherAdjustmentsToOtherComprehensiveIncomeThatWillNotBeReclassifiedToProfitOrLossBeforeTax": "-3647000",
    "OtherComprehensiveIncomeThatWillNotBeReclassifiedToProfitOrLossBeforeTax": "-3647000",
    "GainsLossesOnExchangeDifferencesOnTranslationBeforeTax": "-6240000",
    "UnrealisedGainsLossesOnChangesInFairValueThroughOtherComprehensiveIncomeFinancialAssetsBeforeTax": "-23000",
    "ShareOfOtherComprehensiveIncomeOfAssociatesAccountedForUsingEquityMethodBeforeTax": "2788000",
    "ShareOfOtherComprehensiveIncomeOfJointVenturesAccountedForUsingEquityMethodBeforeTax": "-226000",
    "OtherComprehensiveIncomeThatMayBeReclassifiedToProfitOrLossBeforeTax": "-3678000",
    "OtherComprehensiveIncomeBeforeTax": "-7325000",
    "OtherComprehensiveIncomeAfterTax": "-7325000",
    "ComprehensiveIncome": "304243000",
    "ProfitLossAttributableToParentEntity": "276793000",
    "ProfitLossAttributableToNonControllingInterests": "34775000",
    "ComprehensiveIncomeAttributableToParentEntity": "270088000",
    "ComprehensiveIncomeAttributableToNonControllingInterests": "34155000",
    "BasicEarningsLossPerShareFromContinuingOperations": "0.0395",
    "DilutedEarningsLossPerShareFromContinuingOperations": "0.0395",
    "BalanceBeforeRestatementAtBeginningOfPeriod": "4790464000",
    "EquityPositionBeginningOfThePeriod": "4790464000",
    "ProfitLossChangesInEquity": "311568000",
    "OtherComprehensiveIncome": "-7325000",
    "DistributionsOfCashDividends": "21523000",
    "IncreaseDecreaseInEquityThroughTransactionsWithOwnersEquity": "-3000",
    "EquityPositionEndOfThePeriod": "5073184000",
    "ReceiptsFromCustomers": "1263749000",
    "PaymentsToSuppliersForGoodsAndServices": "657954000",
    "PaymentsForSalariesAndAllowances": "44975000",
    "PaymentsForRoyaltiesAndExploitationFees": "248295000",
    "CashGeneratedFromUsedInOperations": "312525000",
    "InterestsReceivedFromOperatingActivities": "27089000",
    "InterestsPaidFromOperatingActivities": "5946000",
    "IncomeTaxesRefundedPaidFromOperatingActivities": "85000",
    "PaymentsForCorporateIncomeTax": "54654000",
    "OtherCashInflowsOutflowsFromOperatingActivities": "38534000",
    "NetCashFlowsReceivedFromUsedInOperatingActivities": "317633000",
    "ProceedsFromDisposalOfPropertyPlantAndEquipment": "14000",
    "PaymentsForAcquisitionOfPropertyPlantAndEquipment": "69010000",
    "PaymentsForAcquisitionOfMiningProperties": "1542000",
    "PaymentsForAcquisitionOfIntangibleAssets": "179000",
    "WithdrawalPlacementOfFinancialAssetsFairValueThroughOtherComprehensiveIncome": "1041000",
    "WithdrawalPlacementOfRestrictedFundsFromInvestingActivities": "-771000",
    "PaymentsOfReceivablesFromRelatedParties": "257000",
    "NetCashFlowsReceivedFromUsedInInvestingActivities": "-70718000",
    "ProceedsFromBankLoans": "6487000",
    "PaymentsOfBankLoans": "4700000",
    "PaymentsOfFinanceLeaseLiabilities": "1290000",
    "ProceedsFromOtherBorrowings": "215000",
    "ProceedsFromDueToRelatedParties": "5593000",
    "PaymentsOfDueToRelatedParties": "10000000",
    "DividendsPaidFromFinancingActivities": "393640000",
    "OtherCashInflowsOutflowsFromFinancingActivities": "-70000",
    "NetCashFlowsReceivedFromUsedInFinancingActivities": "-397405000",
    "NetIncreaseDecreaseInCashAndCashEquivalents": "-150490000",
    "CashAndCashEquivalentsCashFlows": "2372792000",
    "EffectOfExchangeRateChangesOnCashAndCashEquivalents": "-11198000",
    "BasisOfPreparationOfConsolidatedFinancialStatementsTextBlock": "Laporan keuangan konsolidasian Grup telah disusun berdasarkan Pernyataan Standar Akuntansi Keuangan dan Peraturan No. VIII.G.7 tentang  dan Pengungkapan Laporan Keuangan Emiten atau Perusahaan Publik.\n\nLaporan keuangan konsolidasian Grup telah disusun berdasarkan konsep harga perolehan, kecuali untuk aset keuangan tertentu yang diakui berdasarkan nilai wajar, serta menggunakan dasar akrual kecuali untuk laporan arus kas konsolidasian.\n\nPenyusunan laporan keuangan konsolidasian berdasarkan Standar Akuntansi Keuangan di Indonesia memerlukan penggunaan estimasi dan asumsi akuntansi penting tertentu. Penyusunan laporan keuangan juga mengharuskan manajemen untuk membuat pertimbangan dalam proses penerapan kebijakan akuntansi Grup. Area-area yang memerlukan tingkat pertimbangan yang lebih tinggi atau kompleks, atau area dimana asumsi dan estimasi yang berdampak signifikan terhadap laporan keuangan konsolidasian diungkapkan dalam Catatan 3.",
    "PrinciplesOfConsolidationTextBlock": "i.\tEntitas anak\n\ni.1.\tKonsolidasi\n\nEntitas anak merupakan semua entitas (termasuk entitas yang terstruktur), dimana Grup memiliki pengendalian. Grup mengendalikan suatu entitas ketika Grup memiliki hak atas imbal hasil variabel dari keterlibatannya dengan suatu entitas dan memiliki kemampuan untuk mempengaruhi imbal hasil tersebut melalui kekuasaannya atas entitas tersebut.\n\nEntitas anak dikonsolidasi sejak tanggal pengendalian beralih kepada Grup dan tidak lagi dikonsolidasi sejak tanggal hilangnya pengendalian.\n\nSaldo, transaksi, penghasilan, dan beban intra kelompok usaha dieliminasi. Keuntungan dan kerugian hasil dari transaksi intra kelompok usaha yang diakui dalam aset juga dieliminasi. Kebijakan akuntansi entitas anak telah diubah seperlunya untuk memastikan konsistensi penerapan kebijakan oleh Grup.\n\ni.2. Akuisisi\n\nGrup menerapkan metode akuisisi untuk mencatat setiap kombinasi bisnis. Imbalan yang dialihkan untuk mengakuisisi entitas anak adalah nilai wajar seluruh aset yang dialihkan, liabilitas yang diakui oleh pihak pengakuisisi kepada pemilik sebelumnya dari entitas yang diakuisisi dan kepentingan ekuitas yang diterbitkan oleh Grup.\n\nImbalan yang dialihkan termasuk nilai wajar setiap aset dan liabilitas yang dihasilkan dari suatu kesepakatan imbalan kontinjensi. Aset teridentifikasi, liabilitas dan liabilitas kontinjensi yang diambil alih, yang diperoleh dalam kombinasi bisnis diukur pada awalnya sebesar nilai wajar pada tanggal akuisisi.\n\nGrup mengakui kepentingan non-pengendali pada pihak yang diakuisisi baik sebesar nilai wajar atau sebesar bagian proporsional kepentingan non-pengendali atas aset neto teridentifikasi pihak yang diakuisisi. Kepentingan non-pengendali disajikan di ekuitas dalam laporan posisi keuangan konsolidasian, terpisah dari ekuitas pemilik entitas induk.\n\nBiaya terkait akuisisi dibebankan pada saat terjadinya.\n\nJika kombinasi bisnis diperoleh secara bertahap, Grup akan mengukur kepentingan ekuitas yang sebelumnya dimiliki pada pihak yang diakuisisi sebesar nilai wajar pada tanggal akuisisi dan mengakui keuntungan atau kerugian yang dihasilkan, jika ada, dalam laba rugi. Imbalan kontinjensi yang masih harus dialihkan oleh Grup diakui sebesar nilai wajar pada tanggal akuisisi. Perubahan selanjutnya atas nilai wajar imbalan kontinjensi yang diakui sebagai aset atau liabilitas dan dicatat dalam laba rugi. Imbalan kontinjensi yang diklasifikasikan sebagai ekuitas tidak diukur kembali dan penyelesaian selanjutnya diperhitungkan dalam ekuitas.\n\nSelisih lebih antara imbalan yang dialihkan, jumlah setiap kepentingan non-pengendali dalam pihak yang diakuisisi, dan nilai wajar pada tanggal akuisisi dari kepemilikan ekuitas yang sebelumnya dimiliki oleh pihak pengakuisisi pada pihak yang diakuisisi, dibandingkan dengan nilai wajar bagian Grup atas aset bersih teridentifikasi yang diakuisisi, dicatat sebagai goodwill. Jika jumlah tersebut lebih kecil dari nilai wajar atas aset bersih teridentifikasi entitas anak yang diakuisisi dan pengukuran atas seluruh jumlah tersebut telah ditelaah, dalam hal pembelian dengan diskon, selisih tersebut diakui secara langsung dalam laba rugi.\n\nii. Perubahan kepemilikan atas entitas anak tanpa kehilangan pengendalian\n\nTransaksi dengan kepentingan non-pengendali yang tidak mengakibatkan hilangnya pengendalian dicatat sebagai transaksi ekuitas. Selisih antara nilai wajar imbalan yang dibayarkan dan bagiannya atas jumlah tercatat aset neto yang diperoleh dicatat dalam ekuitas. Keuntungan atau kerugian atas pelepasan kepada kepentingan non-pengendali juga dicatat pada ekuitas.\n\niii.\tPelepasan entitas anak\n\nKetika Grup kehilangan pengendalian atas entitas anak, Grup menghentikan pengakuan aset (termasuk setiap goodwill) dan liabilitas entitas anak pada nilai tercatatnya ketika pengendalian hilang. Jumlah yang sebelumnya diakui dalam penghasilan komprehensif lain juga direklasifikasi ke laba rugi atau dialihkan secara langsung ke saldo laba jika disyaratkan oleh PSAK lain.\n\nSisa investasi pada entitas anak terdahulu diakui sebesar nilai wajarnya. Setiap perbedaan antara nilai tercatat sisa investasi pada tanggal hilangnya pengendalian dan nilai wajarnya diakui dalam laba rugi.\n\niv. Akuntansi entitas asosiasi dan ventura bersama\n\nEntitas asosiasi adalah suatu entitas dimana Grup mempunyai pengaruh signifikan, tetapi tidak mengendalikan, dan biasanya Grup memiliki 20% atau lebih hak suara, tetapi tidak melebihi 50% hak suara. Investasi pada entitas asosiasi dicatat pada laporan keuangan konsolidasian menggunakan metode ekuitas dikurangi kerugian penurunan nilai, jika ada.\n\nVentura bersama merupakan pengaturan bersama antara beberapa pihak yang melakukan kesepakatan pengendalian bersama yang memiliki hak atas aset neto pengaturan tersebut. Ventura bersama ini menggunakan metode ekuitas dikurangi kerugian penurunan nilai, jika ada.\n\n-\tAkuisisi\n\nInvestasi pada entitas asosiasi atau ventura bersama pada awalnya diakui sebesar biaya perolehan. Biaya perolehan diukur berdasarkan nilai wajar aset yang diserahkan, instrumen ekuitas yang diterbitkan atau liabilitas yang timbul atau diambil alih pada tanggal akuisisi, ditambah biaya yang berhubungan langsung dengan akuisisi.\n\nGoodwill pada akuisisi entitas asosiasi atau ventura bersama merupakan selisih lebih yang terkait dengan biaya perolehan investasi pada entitas asosiasi atau ventura bersama dengan bagian Grup atas nilai wajar neto aset teridentifikasi dari entitas asosiasi atau ventura bersama dan dimasukkan dalam jumlah tercatat investasi.\n\n-\tMetode ekuitas\n\nDalam menerapkan metode ekuitas, bagian Grup atas laba rugi entitas asosiasi atau ventura bersama setelah perolehan diakui dalam laba rugi dan bagian Grup atas penghasilan komprehensif lain setelah tanggal perolehan diakui dalam penghasilan komprehensif lain. \n\nPerubahan dan penerimaan distribusi dari entitas asosiasi atau ventura bersama setelah tanggal perolehan disesuaikan terhadap nilai tercatat investasi.\n\nJika bagian Grup atas rugi entitas asosiasi atau ventura bersama-sama dengan atau melebihi kepentingannya pada entitas asosiasi atau ventura bersama, termasuk piutang tidak lancar tanpa jaminan, maka Grup menghentikan pengakuan bagiannya atas rugi lebih lanjut, kecuali Grup memiliki kewajiban untuk melakukan pembayaran atau telah melakukan pembayaran atas nama entitas asosiasi atau ventura bersama.\n\nKeuntungan yang belum direalisasi atas transaksi antara Grup dengan entitas asosiasi atau ventura bersama dieliminasi sebesar bagian Grup dalam entitas asosiasi atau ventura bersama tersebut. Kerugian yang belum direalisasi juga dieliminasi kecuali transaksi tersebut memberikan bukti penurunan nilai atas aset yang ditransfer. Kebijakan akuntansi entitas asosiasi atau ventura bersama akan disesuaikan, apabila diperlukan, agar konsisten dengan kebijakan akuntansi Grup.\n\nDividen yang akan diterima dari entitas asosiasi atau ventura bersama diakui sebagai pengurang jumlah tercatat investasi. \n\nPada setiap tanggal pelaporan, Grup menentukan apakah terdapat bukti objektif bahwa telah terjadi penurunan nilai atas investasi pada entitas asosiasi atau ventura bersama. Jika bukti tersebut ada, maka Grup menghitung besarnya penurunan nilai sebagai selisih antara jumlah yang terpulihkan dan nilai tercatat atas investasi pada entitas asosiasi atau ventura bersama dan mengakui selisih tersebut pada laba rugi.\n\n-\tPelepasan\n\nInvestasi pada entitas asosiasi atau ventura bersama dihentikan pengakuannya apabila Grup tidak lagi memiliki pengaruh signifikan atau pengendalian bersama. Grup mengukur investasi yang tersisa sebesar nilai wajar. Selisih antara jumlah tercatat investasi yang tersisa pada tanggal hilangnya pengaruh signifikan dan nilai wajarnya diakui dalam laba rugi.\n\nKeuntungan dan kerugian yang timbul dari pelepasan sebagian atau dilusi yang timbul pada investasi pada entitas asosiasi atau ventura bersama dimana pengaruh signifikan masih dipertahankan diakui dalam laba rugi dan hanya suatu bagian proporsional atas jumlah yang telah diakui sebelumnya pada penghasilan komprehensif lain yang direklasifikasi ke laba rugi.",
    "CashAndCashEquivalentsTextBlock": "Kas dan setara kas termasuk kas, kas di bank, dan deposito berjangka yang jatuh tempo dalam jangka waktu tiga bulan atau kurang pada saat penempatan yang tidak digunakan sebagai jaminan atau tidak dibatasi penggunaannya.\n\nLaporan arus kas konsolidasian disusun menggunakan metode langsung dengan mengklasifikasikan arus kas berdasarkan aktivitas operasi, investasi, dan pendanaan.",
    "TradeAndOtherReceivablesTextBlock": "Piutang usaha adalah jumlah terutang dari pelanggan atas penjualan batubara atau jasa yang diberikan dalam kegiatan usaha biasa. Piutang non-usaha merupakan jumlah terutang yang timbul dari transaksi di luar kegiatan usaha biasa. Jika piutang diperkirakan tertagih dalam satu tahun atau kurang, piutang tersebut diklasifikasikan sebagai aset lancar. Jika tidak, piutang tersebut disajikan sebagai aset tidak lancar pada laporan posisi keuangan konsolidasian.\n\nPiutang usaha pada awalnya diakui sebesar nilai wajar dan kemudian diukur sebesar biaya perolehan diamortisasi dengan menggunakan metode suku bunga efektif, jika efek pendiskontoan signifikan, dikurangi dengan cadangan kerugian.\n\nKerugian penurunan nilai piutang disajikan sebagai bagian dari beban usaha pada laba rugi. Jumlah yang selanjutnya dapat dipulihkan kembali atas piutang yang sebelumnya telah dihapusbukukan, dikreditkan terhadap item baris yang sama.\n\nLihat Catatan 2i untuk informasi lebih lanjut mengenai kebijakan penentuan jumlah cadangan kerugian piutang Grup.\n\nPiutang non-usaha dari pihak berelasi pada awalnya disajikan sebagai aset tidak lancar kecuali jika ada alasan tertentu untuk disajikan sebagai aset lancar pada laporan posisi keuangan konsolidasian.",
    "InventoriesTextBlock": "Persediaan batubara dinilai berdasarkan nilai terendah antara harga perolehan atau nilai realisasi neto. Harga perolehan ditentukan dengan metode rata-rata tertimbang yang mencakup biaya penambangan, biaya tenaga kerja langsung, biaya langsung lainnya, dan alokasi bagian biaya overhead tetap dan variabel yang berkaitan dengan kegiatan penambangan. Biaya tersebut tidak termasuk biaya pinjaman. Nilai realisasi neto adalah estimasi harga jual dalam kegiatan usaha biasa dikurangi estimasi biaya penyelesaian dan estimasi biaya yang diperlukan untuk membuat penjualan.\n\nPersediaan suku cadang, bahan bakar, dan perlengkapan dinilai dengan harga perolehan dikurangi dengan provisi persediaan usang dan bergerak lambat. Harga perolehan suku cadang dan perlengkapan ditentukan dengan metode rata-rata bergerak sedangkan harga perolehan untuk bahan bakar ditentukan dengan metode rata-rata tertimbang. Provisi persediaan usang dan bergerak lambat ditentukan berdasarkan estimasi penggunaan atau penjualan masing-masing jenis persediaan pada masa mendatang. Bahan pendukung kegiatan pemeliharaan dicatat sebagai beban produksi pada tahun digunakan.",
    "FixedAssetsTextBlock": "Grup menganalisis fakta dan keadaan untuk masing-masing jenis hak atas tanah dalam menentukan akuntansi untuk masing-masing hak atas tanah tersebut sehingga dapat merepresentasikan dengan tepat suatu kejadian atau transaksi ekonomis yang mendasarinya. Jika hak atas tanah tersebut tidak mengalihkan pengendalian atas aset pendasar kepada Grup, melainkan mengalihkan hak untuk menggunakan aset pendasar, Grup menerapkan perlakuan akuntansi atas transaksi tersebut sebagai sewa berdasarkan PSAK No. 116, . Jika hak atas tanah secara substansi menyerupai pembelian tanah, maka Grup menerapkan PSAK No. 216,  tetap yaitu hak atas tanah diakui sebesar harga perolehan dan tidak disusutkan.\n\nPada awalnya, semua aset tetap diakui sebesar harga perolehan dan setelahnya dicatat sebesar harga perolehan dikurangi akumulasi penyusutan dan akumulasi kerugian penurunan nilai. Aset tetap, kecuali aset tetap AI, LSA, SCM, MIP, PCS, PC dan RC, disusutkan hingga mencapai estimasi nilai sisa menggunakan metode garis lurus selama estimasi masa manfaatnya sebagai berikut:\n\n\t\tTahun/Years\t\n\nBangunan\t\t10 - 30\t\t\nInfrastruktur\t\t3 - 30\t\nMesin, peralatan operasional,\t\n\tdan kendaraan\t\t4 - 20\t\t\nKapal\t\t5 - 25\t\nPeralatan kantor\t\t3 - 10\n\nAset tetap AI, LSA, SCM, MIP, PCS, PC dan RC disusutkan menggunakan metode garis lurus selama periode yang lebih rendah antara estimasi masa manfaat aset, umur tambang, atau masa jangka waktu lisensi atau kontrak yang relevan. Estimasi umur manfaat aset tetap adalah sebagai berikut:\n\n\t\tTahun/Years\t\n\nBangunan\t\t10 - 20\nInfrastruktur\t\t4 - 20\nMesin, peralatan operasional,\n\tdan kendaraan\t\t4 - 16\nPeralatan kantor \t\t4 - 8\nFasilitas peremukan dan pengolahan \t\t4 - 20\nJalan dan jembatan\t\t10 - 20\n\nBiaya-biaya yang terjadi setelah pengakuan awal diakui sebagai bagian nilai tercatat aset atau sebagai aset terpisah, sebagaimana mestinya, hanya jika kemungkinan besar Grup akan mendapatkan manfaat ekonomis di masa depan berkenaan dengan aset tersebut dan biaya perolehan aset dapat diukur dengan andal. Nilai tercatat komponen yang digantikan dihapuskan. Biaya perbaikan dan pemeliharaan dibebankan dalam laba rugi dalam tahun buku ketika biaya-biaya tersebut terjadi.\n\nMasa manfaat, nilai sisa, dan metode penyusutan aset tetap ditelaah, jika diperlukan, setidaknya disesuaikan, pada setiap akhir tahun buku. Dampak dari setiap revisi diakui dalam laba rugi ketika perubahan terjadi.\n\nNilai tercatat aset segera diturunkan sebesar jumlah yang dapat dipulihkan apabila nilai tercatat aset lebih besar daripada estimasi jumlah yang dapat dipulihkan (Catatan 2l).\n\nNilai tercatat aset tetap yang tidak digunakan lagi atau dijual atau diserahkan pada Pemerintah, dikeluarkan dari laporan keuangan konsolidasian, dan keuntungan atau kerugian yang timbul akibat pelepasan aset tetap tersebut diakui dalam laba rugi.\n\nAkumulasi biaya konstruksi bangunan, jalan dan jembatan, infrastruktur, fasilitas peremukan dan pengolahan dan pemasangan mesin dikapitalisasi sebagai aset dalam pembangunan. Biaya tersebut direklasifikasi ke akun aset tetap pada saat proses konstruksi atau pemasangan selesai. Penyusutan dimulai pada saat aset tersebut siap untuk digunakan sesuai dengan tujuan yang diinginkan manajemen.",
    "ImpairmentOfNon-FinancialAssetsTextBlock": "Aset yang memiliki umur manfaat tidak terbatas, misalnya goodwill atau aset takberwujud yang belum siap digunakan, tidak diamortisasi namun diuji penurunan nilainya setiap tahun, atau lebih sering jika terdapat kejadian atau perubahan keadaan yang mengindikasikan bahwa nilai tercatatnya mungkin tidak dapat dipulihkan. Aset yang memiliki umur manfaat terbatas, diamortisasi atau disusutkan, dan diuji untuk penurunan nilai jika terdapat kejadian atau perubahaan keadaan yang mengindikasikan bahwa nilai tercatatnya mungkin tidak dapat dipulihkan. Penurunan nilai diakui jika nilai tercatat aset melebihi jumlah terpulihkannya. Jumlah terpulihkan merupakan jumlah yang lebih tinggi antara nilai wajar aset dikurangi biaya untuk menjual dan nilai pakai aset. Dalam menentukan penurunan nilai, aset dikelompokkan pada level yang paling rendah dimana terdapat arus kas yang dapat diidentifikasi. Aset non-keuangan selain goodwill yang mengalami penurunan nilai diuji untuk menentukan apakah terdapat kemungkinan pemulihan penurunan nilai, pada setiap tanggal pelaporan.\n\nPembalikan rugi penurunan nilai, untuk aset selain goodwill, diakui jika, dan hanya jika, terdapat perubahan estimasi yang digunakan dalam menentukan jumlah terpulihkan aset sejak pengujian penurunan nilai terakhir kali. Pembalikan rugi penurunan nilai tersebut diakui segera dalam laba rugi. Pembalikan tersebut tidak boleh mengakibatkan nilai tercatat aset melebihi biaya perolehan disusutkan sebelum adanya pengakuan penurunan nilai pada tanggal pembalikan dilakukan. Rugi penurunan nilai atas goodwill tidak dibalik lagi.",
    "TradePayablesAndOtherLiabilitiesTextBlock": "Utang usaha adalah kewajiban untuk membayar barang atau jasa yang telah diterima dalam kegiatan usaha normal dari pemasok. Utang usaha diklasifikasikan sebagai liabilitas jangka pendek apabila pembayarannya jatuh tempo dalam waktu satu tahun atau kurang setelah tanggal pelaporan. Jika tidak, utang usaha tersebut disajikan sebagai liabilitas jangka panjang.\n\nUtang usaha pada awalnya diakui sebesar nilai wajar dan selanjutnya diukur pada biaya perolehan diamortisasi dengan menggunakan metode suku bunga efektif.",
    "RevenueAndExpenseRecognitionTextBlock": "Pendapatan dari kontrak dengan pelanggan\n\nPengakuan pendapatan harus memenuhi lima langkah analisa sebagai berikut:\n\n1. \tIdentifikasi kontrak dengan pelanggan.\n2. \tIdentifikasi kewajiban pelaksanaan dalam kontrak. Kewajiban pelaksanaan merupakan janji-janji dalam kontrak untuk menyerahkan barang atau jasa yang memiliki karakteristik berbeda ke pelanggan.\n3. \tPenetapan harga transaksi. Harga transaksi merupakan jumlah imbalan yang berhak diperoleh suatu entitas sebagai kompensasi atas diserahkannya barang atau jasa yang dijanjikan ke pelanggan. Jika imbalan yang dijanjikan di kontrak mengandung suatu jumlah yang bersifat variabel, maka Grup membuat estimasi jumlah imbalan tersebut sebesar jumlah yang diharapkan berhak diterima atas diserahkannya barang atau jasa yang dijanjikan ke pelanggan dikurangi dengan estimasi jumlah jaminan kinerja jasa yang akan dibayarkan selama periode kontrak.\n4. \tAlokasi harga transaksi ke setiap kewajiban pelaksanaan dengan menggunakan dasar harga jual berdiri sendiri relatif dari setiap barang atau jasa berbeda yang dijanjikan di kontrak. Ketika tidak dapat diamati secara langsung, harga jual berdiri sendiri relatif diperkirakan berdasarkan biaya yang diharapkan ditambah margin.\n5. \tPengakuan pendapatan ketika kewajiban pelaksanaan telah dipenuhi dengan menyerahkan barang atau jasa yang dijanjikan ke pelanggan (ketika pelanggan telah memiliki kendali atas barang atau jasa tersebut).\n\nPendapatan dari penjualan barang diakui ketika pengendalian dialihkan kepada pelanggan. Terdapat kondisi di mana pertimbangan diperlukan berdasarkan lima indikator pengendalian di bawah ini:\n\n1. \tPelanggan telah memiliki risiko dan manfaat signifikan atas kepemilikan aset dan memperoleh kemampuan untuk mengarahkan penggunaan atas, dan memperoleh secara substansial seluruh sisa manfaat dari barang.\n2. \tPelanggan memiliki kewajiban kini untuk membayar sesuai dengan syarat dan ketentuan dalam kontrak penjualan.\n3.\tPelanggan telah menerima barang. Penjualan barang dapat tergantung pada penyesuaian berdasarkan inspeksi terhadap pengiriman oleh pelanggan. Dalam hal ini, penjualan diakui berdasarkan estimasi terbaik Grup terhadap kualitas dan/atau kuantitas saat pengiriman, dan penyesuaian kemudian dicatat dalam akun pendapatan. Secara historis, perbedaan antara kualitas dan kuantitas, estimasi dan/atau aktual tidak signifikan.\n4. \tPelanggan telah memiliki hak kepemilikan legal atas barang.\n5. \tPelanggan telah menerima kepemilikan fisik atas barang.\n\nKewajiban pelaksanaan dapat dipenuhi dengan cara sebagai berikut:\n\na. \tPada waktu tertentu (umumnya janji untuk menyerahkan barang ke pelanggan); atau\nb. \tSepanjang waktu (umumnya janji untuk menyerahkan jasa ke pelanggan). Untuk kewajiban pelaksanaan yang dipenuhi dalam suatu periode waktu, Grup memilih ukuran penyelesaian yang sesuai untuk penentuan jumlah pendapatan yang harus diakui karena telah terpenuhinya kewajiban pelaksanaan.\n\nAset kontrak adalah hak imbalan Grup dalam pertukaran barang atau jasa yang dialihkan Grup kepada pelanggan. Liabilitas kontrak adalah kewajiban Grup untuk mengalihkan barang atau jasa kepada pelanggan di mana Grup telah menerima imbalan (atau jumlah imbalan yang jatuh tempo) dari pelanggan tersebut.\n\ni.\tPenjualan batubara\n\nPendapatan penjualan diakui pada setiap penjualan individu pelanggan. Pengendalian beralih ke pelanggan dan pendapatan penjualan diakui ketika produk dimuat ke kapal di mana batubara akan dikirim ke pelabuhan tujuan atau tempat pelanggan.\n\nGrup secara umum menjual batubara dengan syarat Free on Board (), di mana Grup tidak memiliki tanggung jawab untuk pengangkutan atau asuransi setelah pengendalian barang telah berlalu di pelabuhan muat. Untuk jangka waktu ini hanya ada satu kewajiban pelaksanaan, yaitu untuk penyediaan produk pada titik di mana pengendalian lewat. Selain itu juga, Grup menjual batubara dengan syarat Cost, Insurance and Freight (), tetapi berdasarkan perjanjian penjualan, kepemilikan dan risiko kerugian atas batubara akan tetap berada pada Grup sampai batubara melewati pelabuhan bongkar. Dalam kondisi ini, Grup menganggap bahwa biaya asuransi dan pengangkutan bukan merupakan kewajiban pelaksanaan terpisah melainkan satu kewajiban pelaksanaan dengan penjualan batubara dikarenakan pengendalian atas batubara berpindah ke pembeli pada saat batubara tersebut sudah sampai di lokasi pembeli. Oleh karena itu Grup tidak memiliki kewajiban pelaksanaan terpisah untuk jasa pengangkutan dan asuransi yang disediakan.\n\nii.\tPendapatan jasa logistik, termasuk jasa sewa dan jasa lainnya\n\nGrup mengakui pendapatan atas terpenuhinya kewajiban pelaksanaan dalam suatu periode waktu hanya jika Grup dapat mengukur dengan andal atas penyelesaian kewajiban pelaksanaan. Dalam keadaan tertentu, Grup mungkin tidak dapat mengukur hasil atas kewajiban pelaksanaan secara wajar, tetapi Grup berekspektasi untuk memulihkan biaya yang timbul dalam memenuhi kewajiban pelaksanaan. Dalam keadaan tersebut, Grup mengakui pendapatan hanya sebatas biaya yang timbul sampai Grup dapat mengukur hasil kewajiban pelaksanaan secara wajar.\n\nPendapatan dari jasa logistik, termasuk jasa sewa dan jasa lainnya, diakui atas dasar pekerjaan yang diselesaikan dalam suatu waktu pada saat jasa tersebut diberikan kepada pelanggan.\n\niii.\tPerjanjian konsesi jasa\n\nPendapatan keuangan dari perjanjian konsesi jasa merupakan pendapatan bunga dari piutang jasa konsesi yang timbul dari pengaturan jasa konsesi dan diakui dengan menggunakan metode suku bunga efektif.\n\nBeban\n\ni.\tBeban dari kontrak dengan pelanggan\n\nBiaya yang secara langsung berhubungan dengan kontrak, menghasilkan sumber daya untuk memenuhi kontrak ( untuk memenuhi) atau penambahan untuk mendapatkan kontrak ( untuk memperoleh) dan diharapkan dapat dipulihkan. Beban tersebut dengan demikian memenuhi syarat kapitalisasi berdasarkan PSAK No. 115 dan diakui sebagai aset. Beban tersebut diamortisasi dengan cara sistematis sejalan dengan penyerahan barang atau jasa yang terkait dengan aset tersebut.\n\nii.\tBeban-beban lainnya\n\nBeban-beban lainnya diakui pada saat terjadinya.",
    "ForeignCurrencyTranslationTextBlock": "Akun-akun yang disertakan dalam laporan keuangan setiap entitas anggota Grup diukur menggunakan mata uang dari lingkungan ekonomi utama dimana entitas tersebut beroperasi ( uang fungsional). Laporan keuangan konsolidasian disajikan dalam Dolar Amerika Serikat ($ atau  AS), yang merupakan mata uang fungsional Perusahaan dan penyajian Grup.",
    "IncomeTaxesTextBlock": "Beban pajak terdiri dari pajak kini dan pajak tangguhan. Pajak diakui dalam laba rugi, kecuali jika pajak itu terkait dengan kejadian atau transaksi yang diakui di penghasilan komprehensif lain atau langsung diakui ke ekuitas. Dalam hal ini, beban pajak tersebut masing-masing diakui pada penghasilan komprehensif lain atau secara langsung dicatat ke ekuitas.\n\nBeban pajak kini dihitung berdasarkan peraturan perpajakan yang berlaku pada tanggal pelaporan keuangan, di negara dimana Perusahaan dan entitas anaknya beroperasi dan menghasilkan penghasilan kena pajak. Manajemen secara periodik mengevaluasi posisi yang diambil dalam Surat Pemberitahuan Tahunan sehubungan dengan situasi dimana aturan pajak yang berlaku membutuhkan interpretasi atas peraturan pajak yang berlaku. Jika perlu, manajemen menentukan provisi dibentuk berdasarkan jumlah yang diharapkan akan dibayar pada otoritas pajak.\n\nUntuk penghasilan yang menjadi subjek pajak penghasilan final, beban pajak diakui secara proporsional dengan jumlah pendapatan akuntansi yang diakui dan disajikan sebagai bagian dari beban operasional pada tahun berjalan dikarenakan pajak tersebut tidak memenuhi kriteria sebagai pajak penghasilan. \n\nPajak penghasilan tangguhan diakui, dengan menggunakan metode liabilitas untuk semua perbedaan temporer antara dasar pengenaan pajak aset dan liabilitas dengan nilai tercatatnya pada laporan keuangan konsolidasian. Namun, liabilitas pajak tangguhan tidak diakui jika timbul dari pengakuan awal goodwill; dan pada saat pengakuan awal suatu aset atau liabilitas yang timbul dari transaksi selain kombinasi bisnis yang pada saat transaksi tersebut tidak mempengaruhi laba rugi akuntansi maupun laba rugi pajak dan tidak menimbulkan perbedaan temporer kena pajak dan perbedaan temporer dapat dikurangi dalam jumlah yang sama. Pajak penghasilan tangguhan ditentukan menggunakan tarif pajak yang berlaku atau yang secara substansial telah berlaku pada akhir tahun pelaporan dan diharapkan diterapkan jika aset pajak penghasilan tangguhan direalisasikan atau liabilitas pajak penghasilan tangguhan diselesaikan.\n\nAset pajak penghasilan tangguhan diakui hanya jika besar kemungkinan jumlah penghasilan kena pajak di masa depan akan memadai untuk dikompensasi dengan perbedaan temporer yang masih dapat digunakan.\n\nLiabilitas dan aset pajak tangguhan tidak diakui untuk perbedaan temporer antara nilai tercatat dan dasar pengenaan pajak atas investasi dalam entitas asosiasi dan ventura bersama dimana Grup dapat mengendalikan waktu pembalikan perbedaan temporer dan kemungkinan besar perbedaan tersebut tidak akan dibalik di masa mendatang.\n\nAset dan liabilitas pajak penghasilan tangguhan dapat saling hapus jika terdapat hak yang berkekuatan secara hukum untuk melakukan saling hapus antara aset pajak kini dengan liabilitas pajak kini.\n\nSelain pajak penghasilan, Grup juga mengakui bentuk pembayaran lain ke Pemerintah yang dihitung berdasarkan produksi atau pendapatan (royalti). Iuran eksploitasi dan royalti dianggap sebagai pajak penghasilan apabila mereka memiliki karakteristik sebagai pajak penghasilan. Hal ini dipertimbangkan demikian apabila dipersyaratkan oleh Pemerintah dan jumlah terutang didasarkan pada penghasilan kena pajak daripada kuantitas fisik yang diproduksi atau persentase dari penjualan. Untuk perjanjian yang demikian, pajak penghasilan dan pajak penghasilan ditangguhkan akan dicatat sesuai dengan penjelasan di atas untuk bentuk lain perpajakan. Kewajiban Grup yang timbul dari ketentuan iuran eksploitasi atau royalti dalam IUPK sebagai Kelanjutan Operasi Kontrak/Perjanjian AI, PC dan RC atau Izin Usaha Pertambangan entitas pertambangan lain di dalam Grup tidak memenuhi kriteria sebagai pajak penghasilan, sehingga diakui sebagai provisi dan dicatat sebagai beban pokok pendapatan.",
    "BorrowingsTextBlock": "Pinjaman diakui pada awalnya sebesar nilai wajar, dikurangi dengan biaya transaksi yang terjadi. Pinjaman kemudian dicatat sebesar biaya perolehan diamortisasi, dengan selisih antara hasil perolehan (dikurangi dengan biaya transaksi) dan nilai penarikan diakui dalam laba rugi selama periode pinjaman dengan menggunakan metode suku bunga efektif.\n\nBiaya-biaya yang dibayar untuk mendapatkan fasilitas pinjaman diakui sebagai biaya transaksi pinjaman tersebut, apabila besar kemungkinan akan dilakukan penarikan atas sebagian atau seluruh fasilitas tersebut. Dalam hal ini, biaya tersebut ditangguhkan sampai dilakukan penarikan. Apabila tidak terdapat bukti bahwa kemungkinan besar akan dilakukan penarikan atas sebagian atau seluruh fasilitas tersebut, biaya tersebut dikapitalisasi sebagai biaya dibayar dimuka untuk biaya keuangan dan diamortisasi selama periode fasilitas terkait. Pinjaman diklasifikasikan sebagai liabilitas jangka pendek kecuali Grup memiliki hak pada akhir periode pelaporan untuk menunda pembayaran liabilitas selama paling tidak 12 bulan dari tanggal pelaporan.\n\nKovenan yang harus dipatuhi oleh Grup, pada atau sebelum akhir periode pelaporan, dipertimbangkan dalam mengklasifikasikan perjanjian pinjaman dengan perjanjian sebagai lancar atau tidak lancar. Kovenan yang harus dipatuhi oleh Grup setelah periode pelaporan tidak memengaruhi klasifikasi pada tanggal pelaporan.",
    "ProvisionsTextBlock": "i.\tProvisi pembongkaran, rehabilitasi, reklamasi dan penutupan tambang\n\nReklamasi, rehabilitasi, dan biaya lingkungan yang berkaitan dengan pemulihan atas area yang terganggu selama tahap produksi dibebankan pada beban pokok pendapatan pada saat kewajiban dari pemulihan atas area yang terganggu tersebut timbul selama penambangan. \n\nKewajiban ini diakui sebagai liabilitas pada saat timbulnya kewajiban hukum atau konstruktif yang berasal dari aktivitas yang telah dilaksanakan. Kewajiban ini diukur pada saat dan setelah pengakuan sebesar nilai kini dari perkiraan pengeluaran yang diperlukan untuk menyelesaikan kewajiban dengan menggunakan tingkat diskonto sebelum pajak, yang mencerminkan penilaian pasar kini atas nilai waktu uang dan risiko yang terkait dengan kewajiban tersebut. Perubahan pada pengukuran kewajiban yang timbul selama tahap produksi juga dibebankan ke beban pokok pendapatan, sementara peningkatan kewajiban yang sehubungan dengan berlalunya waktu diakui sebagai biaya keuangan.\n\nProvisi pembongkaran aset-aset tambang dan kegiatan pascatambang terkait beserta peninggalan dan pembongkaran aset-aset berumur panjang dibentuk sehubungan dengan kewajiban hukum berkaitan dengan penarikan aset tambang terkait dan aset berumur panjang lainnya termasuk pembongkaran bangunan, peralatan, fasilitas peremukan dan pengolahan, infrastruktur, dan fasilitas lainnya yang berasal dari pembelian, konstruksi atau pengembangan aset tersebut. \n\nKewajiban ini diakui sebagai liabilitas pada saat timbulnya kewajiban hukum atau konstruktif yang berkaitan dengan penarikan sebuah aset, dengan pengukuran pada saat dan setelah pengakuan sebesar nilai kini dari perkiraan pengeluaran yang diperlukan untuk menyelesaikan kewajiban dengan menggunakan tingkat diskonto sebelum pajak, yang mencerminkan penilaian pasar kini atas nilai waktu uang dan risiko yang terkait dengan kewajiban tersebut.\n\nBiaya penarikan aset dalam jumlah yang setara dengan jumlah liabilitas tersebut dikapitalisasi sebagai bagian dari suatu aset tertentu dan kemudian disusutkan atau dideplesi selama masa manfaat aset tersebut. Peningkatan kewajiban sehubungan dengan berlalunya waktu diakui dalam biaya keuangan.\n\nPerubahan dalam pengukuran kewajiban pembongkaran yang timbul dari perubahan estimasi waktu atau jumlah pengeluaran sumber daya ekonomis (contohnya: arus kas) yang diperlukan untuk menyelesaikan kewajiban tersebut, atau perubahan dalam tingkat diskonto, akan ditambahkan pada atau dikurangkan dari, harga perolehan aset yang bersangkutan pada tahun berjalan. Jumlah yang dikurangkan dari harga perolehan aset tidak boleh melebihi nilai tercatatnya. Jika penurunan dalam liabilitas melebihi nilai tercatat aset, kelebihan tersebut segera diakui dalam laba rugi. Jika penyesuaian tersebut menghasilkan penambahan pada harga perolehan aset, Grup akan mempertimbangkan apakah hal ini mengindikasikan bahwa nilai tercatat aset yang baru mungkin tidak bisa dipulihkan secara penuh. Jika terdapat indikasi tersebut, Grup akan melakukan pengujian penurunan nilai terhadap aset tersebut dengan melakukan estimasi atas nilai yang dapat dipulihkan dan akan memperhitungkan setiap kerugian dari penurunan nilai yang terjadi.\n\nii.\tProvisi lain-lain\n\nProvisi untuk biaya restrukturisasi, tuntutan hukum, atau hal-hal yang berkaitan dengan lingkungan yang tidak berkaitan dengan penghentian aset, reklamasi, dan penutupan area pertambangan dan lainnya diakui ketika:\n\n\tGrup memiliki kewajiban hukum atau konstruktif saat kini sebagai akibat dari peristiwa masa lalu;\n\tkemungkinan arus keluar sumber daya diperlukan untuk menyelesaikan kewajiban tersebut; dan\n\tjumlahnya dapat diestimasi secara andal.\n\nJika terdapat sejumlah kewajiban serupa, maka kemungkinan arus keluar untuk menyelesaikan kewajiban tersebut ditentukan dengan mempertimbangkan secara keseluruhan kelompok kewajiban. Walaupun kemungkinan arus keluar sehubungan dengan setiap pos kewajiban tersebut kecil, terdapat kemungkinan besar dibutuhkan arus keluar sumber daya untuk menyelesaikan kelompok kewajiban secara keseluruhan. Jika hal itu terjadi, maka provisi diakui.\n\nProvisi diukur pada nilai kini dari estimasi terbaik manajemen atas pengeluaran yang diperlukan untuk menyelesaikan kewajiban dengan menggunakan tingkat diskonto sebelum pajak, yang mencerminkan penilaian pasar kini atas nilai waktu uang dan risiko yang terkait dengan liabilitas yang bersangkutan. Peningkatan provisi sehubungan dengan berlalunya waktu diakui sebagai bagian dari biaya keuangan.",
    "EmployeeBenefitsTextBlock": "i.\tImbalan pasca kerja\n\nSkema pensiun diklasifikasikan sebagai program iuran pasti atau program imbalan pasti, tergantung pada substansi ekonomi dari syarat dan kondisi utama program tersebut. \n\nProgram iuran pasti adalah program pensiun yang mewajibkan Grup membayar sejumlah iuran tertentu kepada entitas terpisah. Grup tidak memiliki kewajiban hukum atau konstruktif untuk membayar iuran lebih lanjut jika entitas tersebut tidak memiliki aset yang cukup untuk membayar seluruh imbalan atas jasa yang diberikan pekerja pada tahun berjalan dan tahun-tahun sebelumnya. \n\nProgram imbalan pasti adalah program pensiun yang bukan merupakan program iuran pasti. Program imbalan pasti adalah program pensiun yang menentukan jumlah imbalan pensiun yang akan diterima seorang pekerja pada saat pensiun, biasanya berdasarkan pada satu atau lebih faktor seperti usia, masa kerja, dan kompensasi.\n\nGrup harus mencadangkan jumlah minimal imbalan pensiun sesuai dengan peraturan ketenagakerjaan pada hukum yang berlaku di Indonesia ( Ketenagakerjaan) atau Perjanjian Kerja Bersama () atau Peraturan Perusahaan (), mana yang lebih tinggi. Oleh karena Peraturan Ketenagakerjaan atau PKB atau PP menetapkan formula untuk menghitung jumlah minimal imbalan pensiun, maka pada dasarnya, program pensiun berdasarkan Peraturan Ketenagakerjaan atau PKB atau PP adalah program imbalan pasti.\n\nSehubungan dengan program imbalan pasti, liabilitas diakui pada laporan posisi keuangan konsolidasian setara dengan nilai kini kewajiban imbalan pasti pada akhir tahun pelaporan dikurangi nilai wajar aset program. Kewajiban imbalan pasti dihitung setiap tahun oleh aktuaris independen dengan menggunakan metode Projected Unit Credit.  \n\nNilai kini kewajiban imbalan pasti ditentukan dengan mendiskontokan arus kas keluar yang diestimasi dengan menggunakan tingkat bunga obligasi korporat berkualitas tinggi dalam denominasi mata uang dimana imbalan akan dibayarkan dan memiliki jangka waktu jatuh tempo mendekati jangka waktu kewajiban pensiun. Apabila tidak terdapat pasar aktif untuk obligasi korporat tersebut, digunakan bunga obligasi pemerintah.\n\nBiaya jasa lalu diakui segera dalam laba rugi. Keuntungan dan kerugian atas kurtailmen atau penyelesaian suatu program imbalan pasti diakui pada saat kurtailmen atau penyelesaian tersebut terjadi.\n\nPengukuran kembali yang timbul dari penyesuaian pengalaman dan perubahan asumsi-asumsi aktuarial dibebankan atau dikreditkan pada ekuitas dalam laporan penghasilan komprehensif lain konsolidasian pada tahun dimana beban tersebut terjadi. Akumulasi saldo pengukuran kembali dilaporkan di saldo laba.\n\nUntuk program iuran pasti, Grup membayar iuran untuk program jaminan hari tua dan jaminan pensiun yang dikelola oleh Pemerintah, dengan dasar kewajiban. Grup tidak memiliki kewajiban membayar lebih lanjut jika iuran tersebut telah dibayarkan. Iuran tersebut diakui sebagai beban imbalan kerja ketika jatuh tempo. Iuran dibayar dimuka diakui sebagai aset sepanjang pengembalian dana atau pengurangan pembayaran masa depan dimungkinkan.\n\nii.\tPesangon pemutusan kontrak kerja\n\nPesangon pemutusan kontrak kerja dibayarkan ketika pekerja diberhentikan, atau ketika pekerja menerima tawaran imbalan dari entitas atas terminasi kontrak kerja. Grup mengakui pesangon pemutusan kontrak kerja pada tanggal yang lebih dahulu dari: (i) ketika Grup tidak bisa lagi membatalkan penawaran pesangon; dan (ii) ketika Grup mengakui biaya untuk restrukturisasi yang berada dalam lingkup PSAK No. 237,  Liabilitas Kontinjensi dan Aset Kontinjensi dan melibatkan pembayaran pesangon pemutusan kontrak kerja. Dalam hal pekerja menerima tawaran imbalan dari entitas atas terminasi kontrak kerja, pesangon pemutusan kontrak kerja diukur berdasarkan ekspektasi jumlah karyawan yang menerima penawaran tersebut. Pesangon pemutusan kontrak kerja yang jatuh tempo lebih dari 12 bulan setelah tanggal pelaporan didiskontokan ke nilai kini.",
    "EarningsPerShareTextBlock": "Laba per saham dasar dihitung dengan membagi laba tahun berjalan yang diatribusikan kepada pemegang saham Perusahaan dengan jumlah rata-rata tertimbang saham biasa yang beredar pada tahun berjalan.\n\nLaba per saham dilusian dihitung dengan membagi laba tahun berjalan yang diatribusikan kepada pemegang modal Perusahaan yang telah disesuaikan dengan biaya keuangan dan keuntungan atau kerugian selisih kurs atas utang obligasi konversi, serta pengaruh pajak yang bersangkutan, dengan jumlah tertimbang saham yang ditempatkan dan disetor penuh selama tahun yang bersangkutan, berdasarkan asumsi bahwa semua opsi telah dilaksanakan dan seluruh utang obligasi konversi telah dikonversikan.",
    "DividendsTextBlock": "Pembagian dividen kepada pemegang saham Perusahaan diakui sebagai liabilitas dalam laporan keuangan konsolidasian dalam periode ketika pembagian dividen telah diumumkan.",
    "SegmentReportingTextBlock": "Segmen operasi dilaporkan dengan cara yang konsisten dengan pelaporan internal yang diberikan kepada pengambil keputusan operasional. Direksi merupakan pengambil keputusan operasional yang bertanggung jawab untuk mengalokasikan sumber daya dan menilai kinerja segmen operasi dan membuat keputusan strategis.",
    "TheImplementationOfNewStatementsOfAccountingStandardsTextBlock": "Penerapan dari standar dan amandemen terhadap standar akuntansi, yang berlaku efektif sejak tanggal 1 Januari 2025 berikut tidak menyebabkan perubahan signifikan atas kebijakan akuntansi Grup dan tidak memberikan dampak yang material terhadap jumlah yang dilaporkan di laporan keuangan konsolidasian interim pada periode berjalan:\n\n\tPSAK No. 117  Asuransi\n\tAmandemen PSAK No. 221,  Perubahan Kurs Valuta Asing  Kekurangan Ketertukaran",
    "BusinessCombinationTextBlock": "Kombinasi bisnis entitas sepengendali dibukukan menggunakan metode penyatuan kepemilikan (pooling-of-interests).\n\nSelisih antara harga konsiderasi yang diterima dengan nilai tercatat setiap transaksi restrukturisasi antara entitas sepengendali dibukukan sebagai bagian tambahan modal disetor dalam bagian ekuitas di laporan posisi keuangan konsolidasian.",
    "ForeignCurrencyTransactionsAndBalancesTextBlock": "Transaksi dalam mata uang asing dijabarkan menjadi mata uang fungsional menggunakan kurs yang berlaku pada tanggal transaksi. Pada tanggal pelaporan, setiap aset dan liabilitas moneter dalam mata uang asing disesuaikan untuk mencerminkan kurs yang berlaku pada tanggal tersebut. Keuntungan dan kerugian selisih kurs yang timbul dari penyelesaian transaksi dalam mata uang asing dan dari penjabaran aset dan liabilitas moneter dalam mata uang asing menggunakan kurs yang berlaku pada akhir tahun pelaporan diakui dalam laba rugi. \n\nKurs yang digunakan pada tanggal laporan posisi keuangan konsolidasian, berdasarkan kurs tengah yang diterbitkan Bank Indonesia, adalah sebagai berikut (dalam Dolar AS penuh):\nRupiah 10.000 ()\t\t0.60\nDolar Singapura ($)\t\t0.75\nDolar Australia ($)\t\t0.63\nEuro ()\t\t1.08\t\tYen ()\t\t0.66\nYuan ()\t\t0.14",
    "GoodwillTextBlock": "Goodwill timbul dari akuisisi entitas anak dan merupakan selisih imbalan yang ditransfer terhadap kepemilikan dalam nilai wajar neto atas aset, liabilitas, dan liabilitas kontinjensi teridentifikasi dan nilai wajar kepentingan non-pengendali pada pihak diakuisisi.\n\nUntuk pengujian penurunan nilai, goodwill yang diperoleh dalam kombinasi bisnis dialokasikan pada setiap Unit Penghasil Kas (), atau kelompok UPK, yang diharapkan dapat memberikan manfaat dari sinergi kombinasi bisnis tersebut. Setiap unit atau kelompok unit yang memperoleh alokasi goodwill mempresentasikan level terendah dalam entitas yang goodwill-nya dipantau untuk tujuan manajemen internal. Goodwill dipantau pada level segmen operasi.",
    "InvestmentInAssociatesTextBlock": "Entitas asosiasi adalah suatu entitas dimana Grup mempunyai pengaruh signifikan, tetapi tidak mengendalikan, dan biasanya Grup memiliki 20% atau lebih hak suara, tetapi tidak melebihi 50% hak suara. Investasi pada entitas asosiasi dicatat pada laporan keuangan konsolidasian menggunakan metode ekuitas dikurangi kerugian penurunan nilai, jika ada.\n\nVentura bersama merupakan pengaturan bersama antara beberapa pihak yang melakukan kesepakatan pengendalian bersama yang memiliki hak atas aset neto pengaturan tersebut. Ventura bersama ini menggunakan metode ekuitas dikurangi kerugian penurunan nilai, jika ada.\n\n-\tAkuisisi\n\nInvestasi pada entitas asosiasi atau ventura bersama pada awalnya diakui sebesar biaya perolehan. Biaya perolehan diukur berdasarkan nilai wajar aset yang diserahkan, instrumen ekuitas yang diterbitkan atau liabilitas yang timbul atau diambil alih pada tanggal akuisisi, ditambah biaya yang berhubungan langsung dengan akuisisi.\n\nGoodwill pada akuisisi entitas asosiasi atau ventura bersama merupakan selisih lebih yang terkait dengan biaya perolehan investasi pada entitas asosiasi atau ventura bersama dengan bagian Grup atas nilai wajar neto aset teridentifikasi dari entitas asosiasi atau ventura bersama dan dimasukkan dalam jumlah tercatat investasi.\n\n-\tMetode ekuitas\n\nDalam menerapkan metode ekuitas, bagian Grup atas laba rugi entitas asosiasi atau ventura bersama setelah perolehan diakui dalam laba rugi dan bagian Grup atas penghasilan komprehensif lain setelah tanggal perolehan diakui dalam penghasilan komprehensif lain. \n\nPerubahan dan penerimaan distribusi dari entitas asosiasi atau ventura bersama setelah tanggal perolehan disesuaikan terhadap nilai tercatat investasi.\n\nJika bagian Grup atas rugi entitas asosiasi atau ventura bersama-sama dengan atau melebihi kepentingannya pada entitas asosiasi atau ventura bersama, termasuk piutang tidak lancar tanpa jaminan, maka Grup menghentikan pengakuan bagiannya atas rugi lebih lanjut, kecuali Grup memiliki kewajiban untuk melakukan pembayaran atau telah melakukan pembayaran atas nama entitas asosiasi atau ventura bersama.\n\nKeuntungan yang belum direalisasi atas transaksi antara Grup dengan entitas asosiasi atau ventura bersama dieliminasi sebesar bagian Grup dalam entitas asosiasi atau ventura bersama tersebut. Kerugian yang belum direalisasi juga dieliminasi kecuali transaksi tersebut memberikan bukti penurunan nilai atas aset yang ditransfer. Kebijakan akuntansi entitas asosiasi atau ventura bersama akan disesuaikan, apabila diperlukan, agar konsisten dengan kebijakan akuntansi Grup.\n\nDividen yang akan diterima dari entitas asosiasi atau ventura bersama diakui sebagai pengurang jumlah tercatat investasi. \n\nPada setiap tanggal pelaporan, Grup menentukan apakah terdapat bukti objektif bahwa telah terjadi penurunan nilai atas investasi pada entitas asosiasi atau ventura bersama. Jika bukti tersebut ada, maka Grup menghitung besarnya penurunan nilai sebagai selisih antara jumlah yang terpulihkan dan nilai tercatat atas investasi pada entitas asosiasi atau ventura bersama dan mengakui selisih tersebut pada laba rugi.\n\n-\tPelepasan\n\nInvestasi pada entitas asosiasi atau ventura bersama dihentikan pengakuannya apabila Grup tidak lagi memiliki pengaruh signifikan atau pengendalian bersama. Grup mengukur investasi yang tersisa sebesar nilai wajar. Selisih antara jumlah tercatat investasi yang tersisa pada tanggal hilangnya pengaruh signifikan dan nilai wajarnya diakui dalam laba rugi.\n\nKeuntungan dan kerugian yang timbul dari pelepasan sebagian atau dilusi yang timbul pada investasi pada entitas asosiasi atau ventura bersama dimana pengaruh signifikan masih dipertahankan diakui dalam laba rugi dan hanya suatu bagian proporsional atas jumlah yang telah diakui sebelumnya pada penghasilan komprehensif lain yang direklasifikasi ke laba rugi.",
    "ExplorationAndEvaluationAssetsTextBlock": "Aktivitas eksplorasi dan evaluasi meliputi mencari sumber daya mineral setelah Grup memperoleh hak hukum untuk mengeksplorasi suatu wilayah tertentu, menentukan kelayakan teknis dan menilai komersial atas sumber daya mineral spesifik.\n\nPengeluaran eksplorasi dan evaluasi termasuk biaya yang berhubungan langsung dengan:\n\n-\tperolehan hak untuk eksplorasi;\n-\tkajian topografi, geologi, geokimia, dan geofisika;\n-\tpengeboran eksplorasi;\n-\tpemaritan dan pengambilan contoh; dan\n-\taktivitas yang terkait dengan evaluasi kelayakan teknis dan komersial atas penambangan sumber daya mineral.\n\nBiaya eksplorasi dan evaluasi yang berhubungan dengan suatu area of interest dibebankan pada saat terjadinya kecuali biaya tersebut dikapitalisasi dan ditangguhkan, berdasarkan area of interest, apabila memenuhi salah satu dari ketentuan berikut ini:\n\n(i)\tterdapat hak untuk mengeksplorasi dan mengevaluasi suatu area dan biaya tersebut diharapkan dapat diperoleh kembali melalui keberhasilan pengembangan dan eksploitasi di area of interest tersebut atau melalui penjualan atas area of interest tersebut; atau\n\n(ii)\tkegiatan eksplorasi dalam area of interest tersebut belum mencapai tahap yang memungkinkan penentuan adanya cadangan terbukti yang secara ekonomis dapat diperoleh, serta kegiatan yang aktif dan signifikan dalam atau berhubungan dengan area of interest tersebut masih berlanjut.\n\nBiaya yang dikapitalisasi mencakup biaya-biaya yang berkaitan langsung dengan aktivitas eksplorasi dan evaluasi pada area of interest yang relevan, tidak termasuk aset berwujud yang dicatat sebagai aset tetap. Biaya umum dan administrasi dialokasikan sebagai aset eksplorasi atau evaluasi hanya jika biaya tersebut berkaitan langsung dengan aktivitas operasional pada area of interest yang relevan.\n\nPengeluaran eksplorasi dan evaluasi yang dikapitalisasi dihapusbukukan ketika kondisi tersebut di atas tidak lagi terpenuhi.\n\nAset eksplorasi dan evaluasi teridentifikasi yang diperoleh dalam suatu kombinasi bisnis pada awalnya diakui sebagai aset pada nilai wajar pada saat akuisisi dan selanjutnya diukur pada biaya perolehan dikurangi kerugian penurunan nilai. Pengeluaran eksplorasi dan evaluasi yang terjadi setelah perolehan aset eksplorasi dalam suatu kombinasi bisnis dicatat dengan mengacu pada kebijakan akuntansi di atas.\n\nOleh karena aset eksplorasi dan evaluasi tidak tersedia untuk digunakan, maka aset tersebut tidak disusutkan.\n\nAset eksplorasi dan evaluasi diuji penurunan nilainya ketika fakta dan kondisi mengindikasikan adanya penurunan nilai. Aset eksplorasi dan evaluasi juga diuji penurunan nilainya ketika terjadi penemuan cadangan komersial, sebelum aset tersebut ditransfer ke  pertambangan - tambang dalam pengembangan.\n\nPengeluaran yang terjadi sebelum entitas memperoleh hak hukum untuk mengeksplorasi suatu area spesifik dibiayakan pada saat terjadinya.",
    "ShareCapitalTextBlock": "Saham biasa dikelompokkan sebagai ekuitas, dan biaya langsung yang berkaitan dengan penerbitan saham baru atau opsi disajikan sebagai pengurang ekuitas, setelah dikurangi pajak, dari jumlah yang diterima.",
    "FinancialInstrumentsTextBlock": "i.\tKlasifikasi, pengakuan dan pengukuran\n\nGrup mengklasifikasikan aset keuangan dalam kategori berikut ini: \n\n(i) \taset keuangan diukur pada biaya perolehan diamortisasi; dan \n(ii) \taset keuangan diukur pada nilai wajar melalui laba rugi atau melalui penghasilan komprehensif lain.\n\nKlasifikasi ini tergantung pada model bisnis Grup dan persyaratan kontraktual arus kas - apakah penentuan arus kasnya semata dari pembayaran pokok dan bunga.\n\nGrup menentukan klasifikasi aset keuangan pada saat pengakuan awal.\n\n(i).  \tAset keuangan diukur pada biaya perolehan diamortisasi\n\nKlasifikasi ini berlaku untuk instrumen utang yang dikelola dalam model bisnis  untuk mendapatkan arus kas dan memiliki arus kas yang memenuhi kriteria -mata dari pembayaran pokok dan bunga.\n\nPada pengakuan awal, piutang usaha yang tidak memiliki komponen pendanaan yang signifikan, diakui sebesar harga transaksi. Aset keuangan lainnya awalnya diakui sebesar nilai wajar dikurangi biaya transaksi yang terkait. Aset keuangan ini selanjutnya diukur sebesar biaya perolehan diamortisasi menggunakan metode suku bunga efektif. Keuntungan atau kerugian pada penghentian atau modifikasi aset keuangan yang dicatat pada biaya perolehan diamortisasi diakui pada laba rugi.\n\n(ii).\tAset keuangan diukur pada nilai wajar melalui laba rugi\n\nKlasifikasi ini berlaku untuk aset keuangan berikut. Dalam semua klasifikasi, biaya transaksi dibebankan pada laba rugi:\n\n-\tInstrumen utang yang tidak memenuhi kriteria biaya perolehan diamortisasi atau nilai wajar melalui penghasilan komprehensif lain. Keuntungan atau kerugian nilai wajar selanjutnya akan dicatat pada laba rugi.\n\n-\tInvestasi ekuitas yang dimiliki untuk diperdagangkan atau dimana pilihan penghasilan komprehensif lain tidak berlaku. Keuntungan atau kerugian nilai wajar dan penghasilan dividen terkait diakui pada laba rugi.\n\n-\tDerivatif yang bukan merupakan instrumen lindung nilai. Keuntungan atau kerugian nilai wajar selanjutnya diakui pada laba rugi. \n\n-\tAset keuangan dengan derivatif melekat dipertimbangkan secara keseluruhan saat menentukan apakah arus kasnya semata-mata merupakan pembayaran pokok dan bunga.\n\n(iii).\tAset keuangan diukur pada nilai wajar melalui penghasilan komprehensif lain\n\nKlasifikasi ini berlaku untuk aset keuangan berikut ini:\n\n-\tInstrumen utang yang dikelola dengan model bisnis yang bertujuan untuk memiliki aset keuangan dalam rangka mendapatkan arus kas kontraktual dan untuk dijual dan di mana arus kasnya memenuhi kriteria -mata dari pembayaran pokok dan bunga.\n\n-\tPerubahan nilai wajar aset keuangan ini dicatat pada penghasilan komprehensif lain, kecuali pengakuan keuntungan atau kerugian penurunan nilai, pendapatan bunga (termasuk biaya transaksi menggunakan metode suku bunga efektif), keuntungan atau kerugian yang timbul dari penghentian dan keuntungan dan kerugian dari selisih kurs diakui pada laba rugi. Ketika aset keuangan dihentikan, keuntungan atau kerugian nilai wajar kumulatif yang sebelumnya diakui pada penghasilan komprehensif lain direklasifikasi pada laba rugi.\n\n-\tInvestasi ekuitas di mana Grup membuat pilihan yang tak terbatalkan untuk menyajikan keuntungan dan kerugian nilai wajar dari revaluasi pada penghasilan komprehensif lain. Pilihan ini dibuat berdasarkan instrumen per instrumen, namun, tidak berlaku pada investasi ekuitas yang dimiliki untuk diperdagangkan. Keuntungan atau kerugian nilai wajar dari revaluasi investasi ekuitas, termasuk komponen selisih kurs, diakui pada penghasilan komprehensif lain. Ketika investasi ekuitas dihentikan pengakuannya, keuntungan atau kerugian nilai wajar yang sebelumnya diakui dalam penghasilan komprehensif lain tidak direklasifikasi pada laba rugi. Dividen diakui dalam laba rugi ketika hak untuk menerima pembayaran telah ditetapkan.\n\nGrup mereklasifikasi investasi utang jika dan hanya jika model bisnis untuk mengelola aset tersebut berubah.\n\nii.\tPenghentian pengakuan\n\nAset keuangan dihentikan pengakuannya ketika hak untuk menerima arus kas dari investasi tersebut telah jatuh tempo atau telah ditransfer dan Grup telah mentransfer secara substansial seluruh risiko dan manfaat atas kepemilikan aset.\n\niii.\tPenurunan nilai aset keuangan \n\nGrup menilai berdasarkan basis forward-looking untuk mengukur kerugian kredit ekspektasian terhadap aset keuangan yang diukur pada biaya perolehan diamortisasi. Metode penurunan nilai dilakukan dengan mempertimbangkan apakah risiko kredit telah meningkat secara signifikan.\n\nPada setiap periode pelaporan, Grup menilai apakah risiko kredit dari instrumen keuangan telah meningkat secara signifikan sejak pengakuan awal. Ketika melakukan penilaian, Grup menggunakan perubahan atas risiko gagal bayar yang terjadi sepanjang perkiraan usia instrumen keuangan daripada perubahan atas jumlah kerugian kredit ekspektasian. Dalam melakukan penilaian, Grup membandingkan antara risiko gagal bayar yang terjadi atas instrumen keuangan pada saat periode pelaporan dengan risiko gagal bayar yang terjadi atas instrumen keuangan pada saat pengakuan awal dan mempertimbangkan informasi yang wajar dan terdukung yang tersedia tanpa biaya atau upaya berlebihan pada saat tanggal pelaporan terkait dengan kejadian masa lalu, kondisi terkini dan perkiraan atas kondisi ekonomi di masa depan, yang mengindikasikan kenaikan risiko kredit sejak pengakuan awal.\n\nGrup menerapkan pendekatan yang disederhanakan untuk mengukur kerugian kredit ekspektasian yang menggunakan cadangan kerugian kredit ekspektasian seumur hidup untuk seluruh saldo piutang usaha, piutang lain-lain dan aset kontrak tanpa komponen pendanaan yang signifikan dan pendekatan umum untuk aset keuangan lainnya. Pendekatan umum termasuk penelaahan perubahan signifikan risiko kredit sejak terjadinya. Penelaahan kerugian kredit ekspektasian termasuk asumsi mengenai risiko gagal bayar dan tingkat kerugian ekspektasian. Untuk piutang usaha, dalam pengkajian juga mempertimbangkan penggunaan peningkatan kredit, misalnya, letter of credit dan garansi bank. Untuk mengukur kerugian kredit ekspektasian, piutang usaha telah dikelompokkan berdasarkan karakteristik risiko kredit dan jatuh tempo yang serupa. \n\niv.\tSaling hapus antar instrumen keuangan \n\nAset dan liabilitas keuangan saling hapus dan nilai netonya disajikan dalam laporan posisi keuangan konsolidasian jika terdapat hak yang dapat dipaksakan secara hukum untuk melakukan saling hapus atas jumlah yang telah diakui tersebut dan terdapat maksud untuk menyelesaikan secara neto atau untuk merealisasikan aset dan menyelesaikan liabilitas secara bersamaan.",
    "AccountingStandardsIssuedButNotYetEffectiveTextBlock": "Amandemen baru yang telah diterbitkan namun belum berlaku efektif untuk tahun buku yang dimulai pada 1 Januari 2025 adalah sebagai berikut:\n\n\tAmandemen PSAK No. 109,  Keuangan dan PSAK No. 107,  Keuangan: Pengungkapan \n\nAmandemen baru di atas berlaku efektif mulai 1 Januari 2026, dengan penerapan dini diperkenankan.\n\nPada tanggal penyelesaian laporan keuangan konsolidasian interim ini, Grup sedang mempelajari dampak yang mungkin timbul dari penerapan amandemen baru pada laporan keuangan konsolidasian interim Grup.",
    "AdditionInPropertyPlantAndEquipment": "58500000",
    "TranslationAdjustmentPropertyPlantandEquipment": "-1803000",
    "DisposalsInPropertyPlantAndEquipment": "2716000",
    "ReclassificationsOfPropertyPlantAndEquipment": "-703000",
    "DisclosureofNotesforPropertyPlantandEquipmentTextBlock": "Beban penyusutan untuk tahun yang berakhir pada tanggal 31 Maret 2025 dan 2024 dialokasikan sebagai berikut\n\t\t31 Maret 2025\n\nBeban pokok pendapatan \n\t(Catatan 29)\t\t16,229\nBeban usaha (Catatan 30)\t\t652\nKapitalisasi sebagai aset tetap\t\t5\nTotal\t\t\t\t\t16,886\n\nPerhitungan kerugian atas pelepasan aset tetap untuk periode tiga bulan yang berakhir pada tanggal 31 Maret 2025 dan 2024 adalah sebagai berikut:\n\n\t\t31 Maret\n\t\t2025\t\n\nHarga perolehan\t\t765\nAkumulasi penyusutan\t\t(416)\n\nNilai buku aset tetap yang dilepas\t\t349\nDikurangi:\t\t\t\t\t\n-\tHarga jual dari pelepasan\t\t\t\naset tetap\t\t14\t\n-\tPenghentian liabilitas sewa\n\nKerugian atas pelepasan\t\t\n\taset tetap (Catatan 31)\t\t335\n\nBeberapa aset tetap tertentu AI yang dicatat dalam laporan keuangan konsolidasian ini dan diperoleh selama masa PKP2B menjadi properti milik Pemerintah (Barang Milik Negara atau ). Berdasarkan IUPK sebagai Kelanjutan Operasi Kontrak/Perjanjian, AI masih memiliki hak untuk menggunakan seluruh BMN yang diperoleh selama masa PKP2B sesuai dengan peraturan perundang-undangan yang berlaku. AI juga diharuskan untuk memelihara dan mengamankan semua properti milik Pemerintah dan mengembalikannya kepada Pemerintah setelah tidak digunakan lagi untuk operasi pertambangan, serta membayar tarif tertentu atas penggunaan BMN tersebut (Catatan 39o). \n\nSesuai dengan Perjanjian Kerjasama IBT dengan Pelindo beserta dengan perubahannya, sebagian aset tetap IBT, yang berada di dalam wilayah operasi pelabuhan batubara dan dicatat dalam laporan keuangan konsolidasian ini akan menjadi milik Pelindo setelah berakhirnya 30 tahun periode operasi.\n\nTidak ada perbedaan signifikan antara nilai wajar dan nilai buku aset tetap, kecuali beberapa tanah, bangunan serta aset tetap lain. Total nilai \nwajar dan nilai buku aset tetap tersebut \npada tanggal 31 Desember 2024 masing-masing adalah sebesar AS$34.690 dan AS$23.953. \nNilai wajar tersebut berdasarkan laporan penilaian independen terakhir dari Kantor Jasa Penilai \nPublik () Tobing Panuturi dan Rekan, penilai independen yang terdaftar di OJK, No. 00663/2.0171-00/PI/02/0420/1/VII/2024 dan No. 00664/2.0171-00/PI/02/0420/1/VII/2024 tertanggal 5 Juli 2024.\n\nPada tanggal 31 Maret 2025, aset tetap Grup telah diasuransikan terhadap semua risiko kerusakan dengan total pertanggungan kurang lebih sebesar AS$1.367.818 (31 Desember 2024: AS$1.315.021), kecuali untuk aset tetap yang tidak bisa diasuransikan seperti tanah, pengerukan Alur Ambang Sungai Barito, dan aset dalam pembangunan tertentu. Manajemen Grup berpendapat bahwa aset tetap telah diasuransikan secara memadai pada tanggal 31 Maret 2025 dan 31 Desember 2024.\n\nPada tanggal 31 Maret 2025, harga perolehan atas aset tetap Grup yang telah disusutkan penuh namun masih dipakai sebesar AS$1.208.462 (31 Desember 2024: AS$1.206.596).\n\nAset dalam pembangunan\n\t\nAset dalam pembangunan merupakan proyek yang belum selesai pada tanggal laporan posisi keuangan konsolidasian dengan rincian sebagai berikut:\n\n\t\t\t\tPersentase\t\t\tAkumulasi\t\t\tEstimasi\t\t\t\n\t\t\t\tpenyelesaian/\t\t\tbiaya/\t\t\tpenyelesaian/\t\t\t\n\tAset dalam\n\tpembangunan\n\n31 Maret 2025\t\t\n\nBangunan, pembangkit listrik dan\t3% - 99%\t\t502,713\tApril 2025 - Desember 2026\n\nJalan dan jembatan\t1% - 90%\t\t20,784\tApril 2025 - Desember 2026\n\nFasilitas peremukan dan\t1% - 99%\t\t12,651\tApril 2025 - Desember 2026\n\nLain-lain\t1% - 99%\t\t5,405\tBervariasi\n\nTotal\t\t\t\t541,553\t\tTotal\n\nBeberapa aset tetap kepemilikan langsung tertentu telah dijaminkan sebagai jaminan untuk pinjaman perjanjian fasilitas KPI (Catatan 19b) dan pinjaman properti komersial (Catatan 19d).\n\nSesuai dengan kebijakan akuntansi Grup, manajemen melakukan pengujian penurunan nilai atas aset non-keuangan (aset tetap, properti pertambangan dan aset lain-lain tertentu) bilamana terdapat kejadian atau perubahan keadaan yang mengindikasikan bahwa nilai tercatat aset tersebut tidak terpulihkan.\n\nManajemen berpendapat bahwa tidak terdapat indikasi adanya penurunan nilai aset tetap.",
    "ServiceOrProductName": "Penjualan batubara",
    "SalesAndRevenueMoreThan10Percent": "222653000",
    "PartyName": "TNB Fuel Services Sdn. Bhd.",
    "TradeReceivablesGross": "416867000",
    "AllowanceForImpairmentOfTradeReceivables": "16499000",
    "TradeReceivablesNet": "401508000",
    "AdditionOfAllowanceForImpairmentOfTradeReceivables": "115000",
    "ReductionOfMovementOfAllowanceForImpairmentOfTradeReceivables": "1140000",
    "Spareparts": "15312000",
    "Coal": "33359000",
    "OtherInventories": "19878000",
    "InventoriesGross": "68549000",
    "Inventories": "68549000",
    "DisclosureofNotesforInventoriesTextBlock": "Pada tanggal 31 Maret 2025, persediaan Grup telah diasuransikan terhadap risiko kerusakan signifikan dengan nilai pertanggungan sebesar AS$64.318 (31 Desember 2024: AS$64.318). Manajemen Grup berpendapat bahwa persediaan telah diasuransikan secara memadai untuk menutupi risiko kehilangan dan kerusakan.\n\nManajemen Grup berpendapat bahwa semua persediaan dapat digunakan atau dijual dan nilai realisasi neto persediaan masih melebihi nilai tercatat persediaan, sehingga tidak diperlukan adanya \nprovisi persediaan usang dan penurunan nilai pada tanggal 31 Maret 2025 dan 31 Desember 2024.",
    "TradePayables": "295542000",
    "MaterialUsage": "4533000",
    "MiningCost": "350419000",
    "RoyaltiesToGovernment": "260990000",
    "FreightAndHandlingCosts": "97546000",
    "MineReclamationAndClosureCosts": "5478000",
    "Amortization": "12321000",
    "Depreciation": "12635000",
    "MiningProductProces": "52755000",
    "ProductionCost": "796677000",
    "CostOfGoodsManufactured": "796677000",
    "FinishGoodsInventory": "80456000",
    "PurcahsedFinishGoodsInventory": "117008000",
    "OtherCostOfGoodSold": "18634000",
    "DisclosureofNotesforCostofGoodsSoldTextBlock": "Rincian pemasok yang memiliki transaksi pembelian lebih dari 10% dari total pendapatan konsolidasian adalah sebagai berikut:\n\n\t\t31 Maret\t\n\t\t2025\t\t\n\nPihak berelasi:\t\t\t\t\tRelated parties\nPenjualan batubara dan jasa lainnya:\nSIS\t\t168,001",
    "BankLoanAmountInForeignCurrency": "40000000",
    "TotalBankLoanGross": "691251000",
    "UnamortizedBankLoanIssuanceCost": "4662000",
    "BankLoans": "686589000",
    "DisclosureofNotesforLongTermBankLoansTextBlock": "a.\tPerjanjian Fasilitas AS$250.000 dan Rp3.800.000.000.000\n\nPada tanggal 24 Oktober 2024, AI mengadakan Perjanjian Fasilitas Multivaluta AS$250.000 dan Rp3.800.000.000.000 (nilai penuh) dengan sindikasi bank, dimana BCA bertindak sebagai agen fasilitas ( Pinjaman Sindikasi). Perusahaan bertindak sebagai penjamin atas fasilitas pinjaman ini.\n\nFasilitas pinjaman ini digunakan untuk membiayai kembali semua jumlah yang jatuh tempo berdasarkan perjanjian fasilitas pinjaman sebelumnya, tujuan umum korporasi, dan belanja modal.\n\nFasilitas ini bersifat revolving dan akan dilunasi pada tanggal jatuh tempo terakhir yaitu 24 Oktober 2027. Fasilitas ini dikenakan bunga sebesar Secured Overnight Financing Rate ()  ditambah persentase tertentu untuk fasilitas dalam mata uang Dolar Amerika Serikat dan Jakarta Interbank Offered Rate () ditambah persentase tertentu untuk fasilitas dalam mata uang Rupiah, serta tidak diikat dengan agunan apa pun.\n\nSelama tahun 2024, AI telah melakukan penarikan penuh pada fasilitas pinjaman ini sebesar AS$250.000 dan RP3.800.000.000.000 (nilai penuh) (setara dengan AS$244.672) dengan total sebesar AS$494.672.\n\nSelama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025, AI telah melakukan pembayaran pinjaman sebesar AS$250.000. Pada tanggal 31 Maret 2025, saldo pinjaman yang terutang dari fasilitas pinjaman ini adalah masing-masing sebesar AS$nihil dan Rp3.800.000.000.000 (nilai penuh) (setara dengan AS$229.081) (31 Desember 2024: AS$250.000 dan Rp3.800.000.000.000 (nilai penuh) (setara dengan AS$235.119)).\n\nSesuai dengan ketentuan dalam Perjanjian Fasilitas, AI diharuskan untuk menjaga beberapa rasio keuangan tertentu. AI juga diharuskan untuk memenuhi beberapa persyaratan dan ketentuan mengenai anggaran dasar, kegiatan usaha, aksi korporasi, kegiatan pembiayaan dan lainnya. Pada tanggal 31 Maret 2025 dan 31 Desember 2024, AI telah memenuhi rasio keuangan dan persyaratan dan ketentuan tersebut.\n\nb.\tPerjanjian Fasilitas AS$603.600 dan Rp952.100.000.000\n\nPada tanggal 12 Mei 2023, KPI menandatangani Perjanjian Fasilitas dengan sindikasi bank yang dimana Bank Mandiri bertindak sebagai agen fasilitas ( Pinjaman KPI).\n\nFasilitas Pinjaman KPI terdiri dari fasilitas pinjaman berjangka dalam mata uang: (i) Dolar AS, dengan total komitmen sebesar AS$603.600 dan tingkat suku bunga tahunan sebesar SOFR ditambah persentase tertentu ( Pinjaman KPI Tranche A); serta (ii) Rupiah, dengan total komitmen sebesar Rp952.100.000.000 (nilai penuh) dan tingkat suku bunga tahunan sebesar JIBOR ditambah persentase tertentu ( Pinjaman KPI Tranche B). Fasilitas Pinjaman KPI ini akan jatuh tempo paling lama 10 (sepuluh) tahun sejak tanggal penandatanganan Fasilitas Pinjaman KPI.\n\nFasilitas Pinjaman KPI akan digunakan untuk pembiayaan pengembangan proyek pembangkit listrik yang berlokasi di kawasan industri yang dikembangkan oleh PT Kalimantan Industrial Park Indonesia () di Kalimantan Utara, Indonesia.\n\nTerkait dengan Fasilitas Pinjaman KPI, Perusahaan telah memberikan jaminan gadai atas saham secara prorata sesuai kepemilikannya dan Perusahaan juga telah memberikan jaminan perusahaan secara proporsional. Selain itu, KPI juga telah memberikan jaminan berupa jaminan gadai atas rekening bank dan jaminan fidusia atas aset tetap material milik KPI, serta akan memberikan jaminan fidusia atas piutang yang diterima oleh KPI dan hak tanggungan atas tanah yang berlokasi di area proyek KPI.\n\nPada tanggal 14 November 2024, KPI dan Bank Mandiri telah menandatangani Akta Perjanjian Perubahan dan Pernyataan Kembali No. 51 sehubungan dengan perubahan pemberi jaminan, yang semula AlamTri menjadi Perusahaan.\n\nSelama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025 dan 2024, KPI tidak melakukan penarikan atau pembayaran atas Fasilitas Pinjaman KPI Tranche A dan Tranche B.\n\nPada tanggal 31 Maret 2025, saldo pinjaman yang terutang dari Fasilitas Pinjaman ini adalah masing-masing sebesar AS$136.260 dan Rp214.935.000.000 (nilai penuh) (setara dengan AS$12.957) (31 Desember 2024: AS$136.260 dan Rp214.935.000.000 (nilai penuh) (setara dengan AS$13.299)) dan harus dibayarkan kembali dengan jadwal pembayaran sebagai berikut:\n\n\t\tJadwal pembayaran kembali\t\t\tJumlah pembayaran kembali\n\t\t(tahun)\t\t\n\n\t\t2026\t\t\t8,296\n\t\t2027\t\t\t17,534\n\t\t2028\t\t18,635\n\t\t2029\t\t\t19,842\n\t\t2030\t\t\t21,083\n\t2031\t22,300\n\t\t2032\t\t23,325\n\t2033\t\t18,202\n\n\tTotal\t\t149,217\n\nSesuai dengan ketentuan dalam Fasilitas Pinjaman KPI, KPI diwajibkan untuk memenuhi kewajiban keuangan termasuk mematuhi syarat dan ketentuan yang tercantum dalam Fasilitas Pinjaman KPI. Pada tanggal 31 Maret 2025 dan 31 Desember 2024, KPI telah memenuhi rasio keuangan dan persyaratan dan ketentuan tersebut.\n\nc.\tPerjanjian Fasilitas AS$40.000\n\nPada tanggal 5 Desember 2017, AIS menandatangani Perjanjian Uncommitted Multi-Currency Revolving Term Loan Facility sebesar AS$50.000 dengan DBS Bank Ltd. Pada tanggal 28 Februari 2022, fasilitas pinjaman ini telah diturunkan menjadi AS$40.000. Fasilitas pinjaman ini digunakan untuk membiayai kebutuhan modal kerja.\n\nPada tanggal 30 Juni 2023, AIS menandatangani surat perubahan untuk mengubah suku bunga yang berlaku atas fasilitas pinjaman ini dari London Interbank Offered Rate () menjadi SOFR. Fasilitas pinjaman ini dikenakan bunga sebesar SOFR ditambah persentase tertentu.\n\nPada tanggal 29 November 2024, AIS menandatangani surat perubahan untuk antara lain, mengubah ketentuan mengenai jaminan dan penjamin. Setelah adanya perubahan ini, AlamTri yang sebelumnya bertindak sebagai penjamin atas fasilitas pinjaman ini dilepaskan dari kewajiban-kewajibannya sebagai penjamin dan penjamin digantikan oleh Perusahaan.\n\nSelama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025, AIS telah melakukan pembayaran pinjaman sebesar AS$15.000 (untuk periode tiga bulan yang berakhir pada tanggal 31 Maret 2024: AS$nihil).\n\nPada tanggal 31 Maret 2025, saldo pinjaman yang terutang dari fasilitas pinjaman ini adalah sebesar AS$25.000 (31 Desember 2024: AS$40.000). Fasilitas pinjaman ini akan dibayar kembali pada akhir periode bunga atau pada tanggal lain yang sebagaimana disepakati oleh DBS Bank Ltd.\n\nAIS harus memenuhi beberapa persyaratan dan ketentuan yang ditetapkan dalam perjanjian ini. Pada tanggal 31 Maret 2025 dan 31 Desember 2024, AIS telah memenuhi persyaratan dan ketentuan tersebut.\n\nd.\tPerjanjian Fasilitas AS$150.000\n\nPada tanggal 19 Oktober 2022, AIS menandatangani Perjanjian Fasilitas sebesar US$100.000 dengan BRI Cabang Singapura untuk keperluan fasilitas penerbitan Letter of Credit (L/C) dan fasilitas trade line. Perjanjian Fasilitas tersebut kemudian diubah pada tanggal 9 Juni 2023. Pada tanggal 9 Desember 2024, AIS dan BRI menandatangani Surat Fasilitas Tambahan  untuk, antara lain, merevisi jenis fasilitas dari trade line facility menjadi revolving working capital facility dan merevisi total komitmen untuk kedua  fasilitas L/C dan fasilitas modal kerja menjadi tidak melebihi AS$150.000.\n\nSelama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025, AIS melakukan penarikan dan pembayaran masing-masing sebesar AS$20.554 dan AS$10.960. Pada tanggal 31 Maret 2025, saldo pinjaman yang terutang dari fasilitas pinjaman ini adalah sebesar AS$9.594 (31 Desember 2024: AS$nihil).\n\ne.\tPerjanjian Pinjaman Properti Komersial\n\nAIS memperoleh pinjaman properti komersial sebesar S$10.751.900 (nilai penuh) dari UOB Bank Limited Singapore sebagaimana tercantum dalam surat penawaran tertanggal 10 Oktober 2022. Fasilitas pinjaman ini digunakan untuk pembelian properti komersial. Properti tersebut dijaminkan untuk fasilitas ini (Catatan 13). Pinjaman ini dikenakan bunga sebesar Singapore Overnight Rate Average () ditambah persentase tertentu dan memiliki jangka waktu sepuluh tahun sejak tanggal penarikan pertama. Pada tahun 2022 AIS telah melakukan penarikan sebesar S$10.751.900 (nilai penuh) dari pinjaman tersebut.\n\nSelama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025, AIS telah melakukan pembayaran cicilan sebesar S$268.800 (nilai penuh) (setara dengan AS$200) (untuk periode tiga bulan yang berakhir pada tanggal 31 Maret 2024: S$268.800 (nilai penuh) (setara dengan AS$200)). Pada tanggal 31 Maret 2025, saldo pinjaman yang terutang dari fasilitas ini adalah sebesar S$8.153.500 (nilai penuh) (setara dengan AS$6.080) (31 Desember 2024: S$8.422.300 (nilai penuh) (setara dengan AS$6.192)) dan dibayarkan dengan jadwal pembayaran sebagai berikut:\n\t\tJadwal pembayaran kembali\t\t\tJumlah pembayaran kembali\n\t\t(tahun)\t\n\n\t\t2025\t\t\t601\n\t\t2026\t\t\t802\n\t\t2027\t\t\t802\n\t\t2028\t\t\t802\n\t\t2029\t\t\t802\n\t\t2030\t\t\t802\n\t\t2031\t\t\t802\n\t\t2032\t\t\t667\n\n\t\tTotal\t\t\t6,080\n\nAIS harus memenuhi beberapa persyaratan dan ketentuan yang ditetapkan dalam Surat Penawaran UOB Bank Limited Singapore. Pada tanggal 31 Maret 2025 dan 31 Desember 2024, AIS telah memenuhi persyaratan dan ketentuan tersebut.\n\nf.\tPerjanjian Kredit Rp144.770.529.123 \n\nPada tanggal 25 Mei 2023, ATB menandatangani Perjanjian Kredit sebesar Rp144.770.529.123 (nilai penuh) dengan BCA termasuk juga di dalamnya fasilitas Bank Garansi sebesar Rp7.500.000.000 (nilai penuh). APM bertindak sebagai penjamin atas fasilitas pinjaman ini.\n\nFasilitas pinjaman ini digunakan untuk membiayai proyek SPAM Brayan Kota Medan dengan kapasitas 500 liter per detik. Fasilitas pinjaman ini dikenakan suku bunga sebesar JIBOR ditambah persentase tertentu per tahun dan akan jatuh tempo dalam jangka waktu sebelas tahun sejak tanggal dilakukannya pencairan pertama atas fasilitas pinjaman.\n\nPinjaman ini dijamin dengan jaminan berupa gadai saham ATM dan ATS di ATB, gadai atas rekening bank ATB, jaminan fidusia atas hasil klaim asuransi, jaminan fidusia atas bank garansi, jaminan fidusia atas hak tagih Perjanjian Kerja Sama dengan Perusahaan Umum Daerah Tirtanadi, jaminan fidusia atas mesin dan peralatan, jaminan fidusia atas piutang dan hak tanggungan atas tanah ATB yang digunakan sebagai area proyek.\n\nSelama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025, ATB melakukan penarikan sebesar Rp11.416.339.221 (nilai penuh) (setara dengan AS$695) (untuk periode tiga bulan yang berakhir pada tanggal 31 Maret 2024: Rp16.130.415.513 (nilai penuh) (setara dengan AS$1.027)) atas fasilitas pinjaman berjangka. Selama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025 dan 2024, ATB tidak melakukan pembayaran atas fasilitas pinjaman berjangka. Pada tanggal 31 Maret 2025, saldo pinjaman yang terutang dari fasilitas pinjaman ini adalah sebesar Rp93.587.644.863 (nilai penuh) (setara dengan AS$5.642) (31 Desember 2024: Rp82.171.305.642 (nilai penuh) (setara dengan AS$5.084)) dan harus dibayarkan kembali dengan jadwal pembayaran sebagai berikut:\n\n\tJadwal pembayaran kembali\t\t\tJumlah pembayaran kembali\n\t\t(tahun)\n\n\t\t2025\t\t\t28\n\t\t2026\t\t\t197\n\t\t2027\t\t\t473\n\t\t2028\t\t557\n\t\t2029\t\t\t635\n\t\t2030\t\t\t698\n\t2031\t769\n\t\t2032\t\t804\n\t2033\t846\n\t2034\t\t635\n\n\tTotal\t\t5,642\n\nPada tanggal 16 Oktober 2024, ATB dan BCA telah menandatangani Perubahan Pertama atas Perjanjian Kredit Rp144.770.529.123 sehubungan dengan perubahan ketentuan terkait dengan kepemilikan saham, yang semula kepemilikan saham baik secara langsung maupun tidak langsung setidaknya sebesar 51% di ATB dan APM oleh AlamTri menjadi Perusahaan.\n\nFasilitas pinjaman ini mensyaratkan ATB untuk menjaga rasio keuangan tertentu dan memenuhi beberapa syarat dan ketentuan yang tercantum dalam Perjanjian Kredit. Pada tanggal 31 Maret 2025 dan 31 Desember 2024, ATB telah memenuhi rasio keuangan dan persyaratan dan ketentuan tersebut.\n\ng.\tPerjanjian Pinjaman Rp260.000.000.000\n\nPada tanggal 26 Februari 2024, ATM menandatangani Perjanjian Pinjaman sebesar Rp260.000.000.000 (nilai penuh) dengan Bank Permata ( Pinjaman). Fasilitas pinjaman ini akan digunakan untuk membiayai proyek atas Instalasi Pengolahan Air () dengan kapasitas 270 liter per detik di Kabupaten Bekasi, membiayai proyek Penurunan Air Tak Berekening di Wilayah Utara Kota Bandung, membayar kembali pinjaman beberapa entitas anak ATM, serta membayar biaya transaksi dan biaya lain yang berhubungan dengan Perjanjian Pinjaman ini.\n\nFasilitas pinjaman ini terdiri dari: (i) fasilitas pinjaman berjangka sebesar Rp220.000.000.000 (nilai penuh) yang akan jatuh tempo dalam jangka waktu 108 bulan sejak tanggal Perjanjian Pinjaman ini; dan (ii) fasilitas pinjaman revolving sebesar Rp40.000.000.000 (nilai penuh) yang akan jatuh tempo dalam jangka waktu 60 bulan sejak tanggal Perjanjian Pinjaman ini. Fasilitas ini dikenakan suku bunga sebesar JIBOR ditambah persentase tertentu dan diikat dengan jaminan berupa gadai saham yang dimiliki ATM dan entitas anaknya.\n\nSelama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025, ATM tidak melakukan penarikan atas fasilitas pinjaman berjangka (untuk periode tiga bulan yang berakhir pada tanggal 31 Maret 2024: Rp85.805.598.666 (nilai penuh) (setara dengan AS$5.460)). Selama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025 dan 2024, ATM tidak melakukan pembayaran atas fasilitas pinjaman berjangka. Pada tanggal 31 Maret 2025, saldo pinjaman yang terutang dari fasilitas pinjaman ini adalah sebesar Rp85.608.245.788 (nilai penuh) (setara dengan AS$5.161) (31 Desember 2024: Rp85.608.245.788 (nilai penuh) (setara dengan AS$5.297)) dan harus dibayarkan kembali dengan jadwal pembayaran sebagai berikut:\n\n\tJadwal pembayaran kembali\t\t\tJumlah pembayaran kembali\n\t\t(tahun)\n\n\t\t2025\t\t\t70\n\t\t2026\t\t\t364\n\t\t2027\t\t\t564\n\t\t2028\t\t612\n\t\t2029\t\t\t800\n\t\t2030\t\t\t846\n\t2031\t846\n\t\t2032\t\t1,059\n\n\tTotal\t\t5,161\n\nPada tanggal 25 Oktober 2024, ATM dan Bank Permata telah menandatangani Addendum I atas Perjanjian Pinjaman Rp260.000.000.000. Addendum ini berkaitan dengan ketentuan mengenai perubahan pengendalian di ATM dan beberapa entitas anaknya yang mengalihkan kendali dari AlamTri menjadi Perusahaan.\n\nFasilitas pinjaman ini mensyaratkan ATM untuk menjaga rasio keuangan tertentu dan memenuhi beberapa syarat dan ketentuan yang tercantum dalam Perjanjian Pinjaman. Pada tanggal 31 Maret 2025 dan 31 Desember 2024, ATM telah memenuhi rasio keuangan dan persyaratan dan ketentuan tersebut.\n\nh.\tPerjanjian Fasilitas AS$100.000\n\nPada tanggal 26 Juli 2021, PCS, SCM dan LSA mengadakan Perjanjian Pinjaman Sindikasi sebesar AS$100.000 dengan sindikasi bank, yang mana PT Bank Permata Tbk bertindak sebagai agen fasilitas ( Pinjaman Sindikasi). Perusahaan bertindak sebagai penjamin atas fasilitas pinjaman ini.\n\nFasilitas pinjaman ini terdiri dari fasilitas pinjaman amortisasi berjangka sebesar AS$40.000 dan fasilitas pinjaman revolving sebesar AS$60.000 dengan tanggal jatuh tempo 26 Juli 2026 dan dibayarkan setiap kuartal. Fasilitas ini dikenakan bunga sebesar LIBOR ditambah persentase tertentu. Fasilitas ini tidak terikat dengan jaminan apapun.\n\nFasilitas pinjaman ini akan digunakan untuk membayar kembali pinjaman yang diterima dari para pemegang sahamnya, membayar biaya transaksi dan biaya lain yang berhubungan dengan Perjanjian Pinjaman Sindikasi ini dan untuk tujuan korporasi umum lainnya.\n\nPCS telah melakukan penarikan penuh pada fasilitas pinjaman amortisasi berjangka tersebut. Pada tanggal 26 Januari 2023, PCS telah melakukan pelunasan atas fasilitas pinjaman amortisasi berjangka. Dengan demikian, berdasarkan syarat dan ketentuan dalam Perjanjian Pinjaman Sindikasi, fasilitas pinjaman amortisasi berjangka tidak dapat ditarik kembali atau dipinjam kembali, namun fasilitas pinjaman revolving tetap berlaku. \n\nPada 16 Mei 2023, SCM, PCS dan LSA melakukan perubahan Perjanjian Pinjaman Sindikasi AS$100.000 untuk mengubah suku bunga dari LIBOR menjadi SOFR.\n\nPada tanggal 5 Juli 2024, SCM, PCS dan LSA melakukan perubahan kedua atas Perjanjian Pinjaman Sindikasi AS$100.000 untuk melakukan penurunan margin atas suku bunga fasilitas pinjaman revolving yang berlaku efektif sejak tanggal 2 Juli 2024.\n\nPada tanggal 11 November 2024, SCM, PCS dan LSA melakukan perubahan ketiga atas Perjanjian Pinjaman Sindikasi AS$100.000 yang diantaranya untuk melakukan perubahan Penjamin, yang semula AlamTri menjadi Perusahaan yang berlaku efektif sejak tanggal 14 Oktober 2024.\n\nSelama periode tiga bulan yang berakhir pada tanggal 31 Maret 2025, LSA dan SCM melakukan penarikan masing-masing sebesar AS$27.000 dan AS$13.000 dan melakukan pembayaran masing-masing sebesar AS$27.000 dan AS$13.000 atas fasilitas pinjaman ini (untuk periode tiga bulan yang berakhir pada tanggal 31 Maret 2024: AS$nihil).\n\nPada tanggal 31 Maret 2025 dan 31 Desember 2024, saldo pinjaman yang terutang dari fasilitas pinjaman ini adalah sebesar AS$nihil.\n\nSesuai dengan ketentuan dalam Perjanjian Pinjaman Sindikasi, PCS, SCM dan LSA diharuskan untuk menjaga beberapa rasio keuangan tertentu. PCS, SCM dan LSA juga diharuskan untuk memenuhi beberapa persyaratan dan ketentuan mengenai syarat pendahuluan, kegiatan usaha, tujuan penggunaan pinjaman dan lainnya. PCS, SCM dan LSA telah memenuhi rasio keuangan dan persyaratan dan ketentuan tersebut.",
    "DueDateForLogTermBankLoan": "Sepuluh tahun sejak tanggal penarikan pertama",
    "InterestRateLongTermBankLoan": "5.5% - 8.4%",
    "InterestRateTypeLongTermBankLoan": "SOFR"
  }
}