{
  "emiten": "Asuransi Bina Dana Arta Tbk",
  "laporan_keuangan": {
    "measure": "shares",
    "identifier": "abda_maker2",
    "instant": "2024-12-31",
    "startDate": "2024-01-01",
    "endDate": "2024-12-31",
    "explicitMember": "idx-cor:OthersAssetsUnderConstructionMember",
    "EntityName": "Asuransi Bina Dana Arta Tbk",
    "EntityCode": "ABDA",
    "EntityIdentificationNumber": "AA030",
    "EntityMainIndustry": "Asuransi / Insurance",
    "SelectedAccountingStandards": "PSAK",
    "Sector": "G. Financials",
    "Subsector": "G4. Insurance",
    "Industry": "G41. Insurance",
    "Subindustry": "G412. General Insurance",
    "ControllingShareholderInformation": "Foreign Corporation",
    "TypeOfEntity": "Local Company - Indonesia Jurisdiction",
    "TypeOfListedSecurities": "Saham / Stock",
    "TypeOfBoardOnWhichTheEntityIsListed": "Pemantauan Khusus / Watchlist",
    "WhetherTheFinancialStatementsAreOfAnIndividualEntityOrAGroupOfEntities": "Entitas grup / Group entity",
    "PeriodOfFinancialStatementsSubmissions": "Kuartal I / First Quarter",
    "DateOfBoardOfDirectorsStatementLetter": "2025-04-29",
    "CurrentPeriodStartDate": "2025-01-01",
    "CurrentPeriodEndDate": "2025-03-31",
    "PriorYearEndDate": "2024-12-31",
    "PriorPeriodStartDate": "2024-01-01",
    "PriorPeriodEndDate": "2024-03-31",
    "Prior2YearEndDate": "2023-12-31",
    "DescriptionOfPresentationCurrency": "Rupiah / IDR",
    "LevelOfRoundingUsedInFinancialStatements": "Ribuan / In Thousand",
    "TypeOfReportOnFinancialStatements": "Tidak Diaudit / Unaudit",
    "PriorYearAuditor": "KAP Purwantono, Sungkoro  Surja",
    "NameofPriorYearAuditSigningPartner": "Ignatius Yokajaya",
    "WhetherInComplianceWithBAPEPAMLKVIIIG11RulesConcerningResponsibilitiesOfBoardOfDirectorsOnFinancialStatements": "Ya / Yes",
    "WhetherInComplianceWithBAPEPAMLKVIIIATwoRulesConcerningIndependenceOfAccountantProvidingAuditServicesInCapitalMarket": "Ya / Yes",
    "CashAndCashEquivalents": "422870963000",
    "InvestmentIncomeReceivables": "14144234000",
    "PremiumReceivables": "107502172000",
    "ReinsuranceReceivables": "46066876000",
    "OtherReceivables": "9342393000",
    "ReinsuranceAssets": "136348361000",
    "InvestmentsInTimeDeposits": "5540000000",
    "InvestmentsOnFairValueThroughOtherComprehensiveIncomeSecurities": "1654527322000",
    "InvestmentsInShares": "20423499000",
    "PrepaidExpenses": "2887619000",
    "PrepaidTaxes": "2486000",
    "DeferredTaxAssets": "69751555000",
    "InvestmentProperties": "179846689000",
    "PropertyPlantAndEquipment": "66639652000",
    "OtherAssets": "5272940000",
    "Assets": "2751906616000",
    "ReinsurancePayables": "15867586000",
    "CommissionPayables": "17508029000",
    "ClaimPayables": "16954809000",
    "TaxesPayable": "1299143000",
    "InsuranceLiabilitiesOnUnearnedPremium": "682907792000",
    "InsuranceLiabilitiesOnEstimatedClaimsLiability": "312372442000",
    "PostEmploymentBenefitObligations": "18113901000",
    "OtherLiabilities": "127805177000",
    "Liabilities": "1192828879000",
    "CommonStocks": "193316724000",
    "AdditionalPaidInCapital": "8109426000",
    "ReserveForChangesInFairValueOfFairValueThroughOtherComprehensiveIncomeFinancialAssets": "892591000",
    "ReserveOfRemeasurementsOfDefinedBenefitPlans": "7304843000",
    "DifferenceDueToChangesOfEquityInSubsidiaryAssociates": "19053000",
    "AppropriatedRetainedEarnings": "7750000000",
    "UnappropriatedRetainedEarnings": "1341639534000",
    "EquityAttributableToEquityOwnersOfParentEntity": "1559032171000",
    "NonControllingInterests": "45566000",
    "Equity": "1559077737000",
    "LiabilitiesTabarruFundsAndEquity": "2751906616000",
    "RevenueFromInsurancePremiums": "249566516000",
    "ReinsurancePremiums": "23514456000",
    "DecreaseIncreaseInUnearnedPremiums": "-54295659000",
    "DecreaseIncreaseInPremiumIncomeCededToReinsurancer": "-904875000",
    "NetInvestmentIncome": "41005747000",
    "OtherUnderwritingIncome": "105235000",
    "ClaimExpenses": "73351865000",
    "ReinsuranceClaims": "1304457000",
    "IncreaseDecreaseInEstimatedClaimsLiability": "14209394000",
    "IncreaseDecreaseInInsuranceLiabilitiesCededToReinsurers": "5367369000",
    "CommissionExpenses": "25754181000",
    "GeneralAndAdministrativeExpenses": "96396797000",
    "ProfitLossBeforeIncomeTax": "10731847000",
    "TaxBenefitExpenses": "1311815000",
    "ProfitLossFromContinuingOperations": "12043662000",
    "ProfitLoss": "12043662000",
    "UnrealisedGainsLossesOnChangesInFairValueThroughOtherComprehensiveIncomeFinancialAssetsAfterTax": "-46936057000",
    "OtherComprehensiveIncomeAfterTax": "-46936057000",
    "ComprehensiveIncome": "-34892395000",
    "ProfitLossAttributableToParentEntity": "12045914000",
    "ProfitLossAttributableToNonControllingInterests": "-2252000",
    "ComprehensiveIncomeAttributableToParentEntity": "-34890143000",
    "ComprehensiveIncomeAttributableToNonControllingInterests": "-2252000",
    "BasicEarningsLossPerShareFromContinuingOperations": "19",
    "BalanceBeforeRestatementAtBeginningOfPeriod": "1548860178000",
    "EquityPositionBeginningOfThePeriod": "1548860178000",
    "ProfitLossChangesInEquity": "12043662000",
    "OtherComprehensiveIncome": "-46936057000",
    "EquityPositionEndOfThePeriod": "1513967783000",
    "ReceiptsFromInsurancePremiums": "196967215000",
    "ReceiptsFromReinsuranceClaims": "7877835000",
    "PaymentsOfCommission": "23008852000",
    "PaymentsForReinsurancePremiums": "31787068000",
    "PaymentsForInsuranceClaimsAndBenefits": "72977699000",
    "PaymentsForGeneralAndAdministrativeExpense": "96256032000",
    "IncomeTaxesRefundedPaidFromOperatingActivities": "-5879116000",
    "OtherCashInflowsOutflowsFromOperatingActivities": "18181547000",
    "NetCashFlowsReceivedFromUsedInOperatingActivities": "-6882170000",
    "ReceiptsOfInvestmentIncome": "38558254000",
    "ProceedsFromDisposalOfPropertyAndEquipment": "10800000",
    "PaymentsForAcquisitionOfPropertyAndEquipment": "2212204000",
    "OtherCashInflowsOutflowsFromInvestingActivities": "-70162839000",
    "NetCashFlowsReceivedFromUsedInInvestingActivities": "-33805989000",
    "NetCashFlowsReceivedFromUsedInFinancingActivities": "0",
    "NetIncreaseDecreaseInCashAndCashEquivalents": "-40688159000",
    "CashAndCashEquivalentsCashFlows": "681964220000",
    "BasisOfPreparationOfConsolidatedFinancialStatementsTextBlock": "Dasar pengukuran dalam penyusunan laporan keuangan konsolidasian adalah konsep biaya historis (historical cost), kecuali untuk investasi pada efek tertentu yang dinyatakan sebesar nilai wajar dan properti investasi yang dinyatakan sebesar hasil penilaian kembali. Laporan keuangan konsolidasian disusun berdasarkan konsep akrual, kecuali arus kas. \nLaporan arus kas konsolidasian disusun dengan metode langsung dengan mengklasifikasikan arus kas berdasarkan aktivitas operasional, investasi dan pendanaan.\nMata uang pelaporan yang digunakan dalam penyusunan laporan keuangan konsolidasian ini adalah Rupiah (), dengan penyajian angka dalam ribuan Rupiah, kecuali dinyatakan lain.",
    "PrinciplesOfConsolidationTextBlock": "Laporan keuangan konsolidasian meliputi laporan keuangan Perusahaan dan Entitas Anak.\nPengaruh dari seluruh transaksi dan saldo antara perusahaan-perusahaan di dalam Grup yang material telah dieliminasi dalam penyajian laporan keuangan konsolidasian.\nEntitas anak dikonsolidasikan secara penuh sejak tanggal akuisisi, yaitu tanggal Perusahaan memperoleh pengendalian, sampai dengan tanggal Perusahaan kehilangan pengendalian.\nEntitas anak adalah entitas dimana Grup memilikipengendalian. Grup mengendalikan entitas ketika Grup terekspos atas, atau memiliki hak untuk, imbal hasil yang bervariasi dari keterlibatannya dengan entitas dan memiliki kemampuan untuk mempengaruhi imbal hasil tersebut melalui kekuasaannya atas entitas tersebut. Keberadaan dan dampak dari hak suara potensial yang saat ini dapat dilaksanakan atau dikonversi, dipertimbangkan ketika menilai apakah Perusahaan mengendalikan entitas lain.\nPerusahaan juga menilai keberadaan pengendalian ketika Perusahaan tidak memiliki lebih dari 50% hak suara namun dapat mengatur kebijakan keuangan dan operasional secara de-facto . Pengendalian de-facto dapat timbul ketika jumlah hak suara yang dimiliki Perusahaan, secara relatif terhadap jumlah dan penyebaran kepemilikan hak suara pemegang saham lain memberikan Perusahaan kemampuan untuk mengendalikan kebijakan keuangan dan operasi, serta kebijakan lainnya. Entitas anak dikonsolidasikan secara penuh sejak tanggal pengendalian dialihkan kepada Perusahaan dan tidak dikonsolidasikan sejak tanggal Perusahaan kehilangan pengendalian.\nSelisih lebih imbalan yang dialihkan, jumlah kepentingan non-pengendali pada pihak yang diakuisisi serta nilai wajar pada tanggal akuisisi kepentingan ekuitas yang dimiliki sebelumnya, terhadap bagian kepemilikan Perusahaan atas nilai wajar aset neto teridentifikasi yang diakuisisi, dicatat sebagai goodwill . Jika jumlah ini lebih rendah dari nilai wajar aset neto entitas yang diakuisisi, selisihnya diakui langsung dalam laporan laba rugi konsolidasian. \nPerubahan dalam bagian kepemilikan entitas induk pada entitas anak yang tidak mengakibatkan hilangnya pengendalian dicatat sebagai transaksi ekuitas. Ketika pengendalian atas entitas anak hilang, bagian kepemilikan yang tersisa di entitas tersebut diukur kembali pada nilai wajarnya dan keuntungan atau kerugian yang dihasilkan diakui dalam laporan laba rugi konsolidasian.\nLaporan keuangan konsolidasian disusun dengan menggunakan kebijakan akuntansi yang sama untuk peristiwa dan transaksi sejenis dalam kondisi yang sama. Apabila laporan keuangan Entitas Anak menggunakan kebijakan akuntansi yang berbeda dari kebijakan akuntansi yang digunakan dalam laporan keuangan konsolidasian, maka dilakukan penyesuaian yang diperlukan terhadap laporan keuangan Entitas Anak tersebut.\nKepentingan non-pengendali disajikan di ekuitas dalam laporan posisi keuangan konsolidasian dan dinyatakan sebesar proporsi pemegang saham non-pengendali atas laba tahun berjalan dan ekuitas. Entitas Anak tersebut sesuai dengan persentase kepemilikan pemegang saham non-pengendali pada Entitas Anak tersebut.",
    "CashAndCashEquivalentsTextBlock": "Kas terdiri dari kas dan bank. Setara kas adalah semua investasi yang bersifat jangka pendek dan sangat likuid yang dapat segera dikonversikan menjadi kas dengan jatuh tempo dalam waktu 3 (tiga) bulan atau kurang sejak tanggal penempatannya, dan yang tidak dijaminkan serta tidak dibatasi pencairannya.",
    "TradeAndOtherReceivablesTextBlock": "Aset keuangan dikategorikan sebagai pinjaman yang diberikan dan piutang terdiri dari deposito berjangka, kas dan setara kas, piutang premi, piutang reasuransi, uang muka klaim, piutang lain-lain dan piutang pihak-pihak berelasi di dalam laporan posisi keuangan konsolidasian.\nPinjaman yang diberikan dan piutang adalah aset keuangan non-derivatif dengan pembayaran tetap atau telah ditentukan yang tidak mempunyai kuotasi di pasar\naktif. Setelah pengakuan awal diukur pada biaya perolehan diamortisasi dengan menggunakan metode suku bunga efektif, setelah dikurangi penyisihan untuk\npenurunan nilai.\nPiutang premi dinyatakan sebesar jumlah bruto.\nPiutang premi yang diakui sebagai aset yang diperkenankan dalam menghitung solvabilitas adalah piutang premi yang berumur kurang dari 2 bulan (60 hari).\nPiutang lain-lain merupakan piutang pegawai, piutang salvage klaim, piutang aso dan uang muka biaya pemasaran.",
    "FixedAssetsTextBlock": "Awalnya suatu aset tetap diukur sebesar biaya perolehan, yang terdiri dari harga perolehannya dan biaya-biaya yang dapat diatribusikan secara langsung untuk membawa aset ke lokasi dan kondisi yang diinginkan agar aset siap\ndigunakan sesuai dengan keinginan dan maksud manajemen, serta estimasi awal biaya pembongkaran dan pemindahan aset tetap dan restorasi lokasi aset. \nBiaya-biaya setelah perolehan awal seperti penggantian komponen dan inspeksi yang signifikan, diakui dalam jumlah tercatat aset tetap jika besar kemungkinan manfaat ekonomis di masa depan akan mengalir ke Grup dan biaya tersebut dapat diukur secara andal. Sisa jumlah tercatat biaya komponen yang diganti atau biaya inspeksi terdahulu dihentikan pengakuannya. Biaya perawatan sehari-hari aset tetap diakui sebagai beban pada saat terjadinya. \nPenyusutan diakui dengan menggunakan metode garis lurus untuk menyusutkan nilai aset tetap, kecuali tanah.",
    "ImpairmentOfNon-FinancialAssetsTextBlock": "Grup mengakui rugi penurunan nilai aset apabila terdapat indikasi bahwa taksiran yang dapat diperoleh kembali (recoverable amount ) dari suatu aset lebih rendah dari nilai tercatatnya. Taksiran yang dapat diperoleh kembali adalah nilai yang lebih tinggi antara nilai wajar dikurangi dengan biaya untuk menjual atau dengan nilai yang digunakan. Nilai wajar dikurangi biaya penjualan adalah nilai yang dapat diperoleh atas penjualan aset dalam transaksi wajar setelah dikurangi dengan biaya terkait transaksi penjualan aset.\nNilai yang digunakan adalah nilai tercatat atas estimasi arus kas masa datang yang dapat diperoleh dari penggunaan rutin atas aset dan dari penjualan aset pada nilai akhir masa manfaat. Saat penurunan nilai tidak dapat diakui kembali, rugi penurunan nilai aset diakui pada tahun-tahun yang lampau harus dipulihkan. Akan tetapi, rugi penurunan nilai aset atas goodwill tidak dapat dipulihkan.",
    "DeferredChargesTextBlock": "N/A",
    "TradePayablesAndOtherLiabilitiesTextBlock": "Kategori ini merupakan liabilitas keuangan yang tidak dimiliki untuk diperdagangkan atau pada saat pengakuan awal tidak ditetapkan untuk diukur pada nilai wajar melalui laporan laba rugi.\nInstrumen keuangan yang diterbitkan atau komponen dari instrumen keuangan tersebut, yang tidak diklasifikasikan sebagai liabilitas keuangan yang diukur\npada nilai wajar melalui laporan laba rugi, diklasifikasikan sebagai liabilitas keuangan lain-lain, jika substansi perjanjian kontraktual mengharuskan Grup untuk menyerahkan kas atau aset keuangan lainnya kepada pemegang instrumen keuangan, atau jika liabilitas tersebut diselesaikan melalui penukaran\nkas atau aset keuangan lain atau saham sendiri yang jumlahnya tetap atau telah ditetapkan.\nKomponen instrumen keuangan yang diterbitkan yang terdiri dari komponen liabilitas dan komponen ekuitas harus dipisahkan, dimana komponen ekuitas\nmerupakan bagian residual dari keseluruhan instrumen keuangan setelah dikurangi nilai wajar komponen liabilitas pada tanggal penerbitan. Setelah pengakuan\nawal, komponen liabilitas diukur pada biaya perolehan diamortisasi menggunakan metode suku bunga efektif. Biaya perolehan diamortisasi tersebut\nmemperhitungkan premi atau diskonto yang timbul pada saat perolehan serta imbalan dan biaya yang merupakan bagian integral dari suku bunga efektif.\nDampak penjabaran atas liabilitas keuangan dalam mata uang asing diakui dalam laporan laba rugi dan penghasilan komprehensif lain konsolidasian.\nLiabilitas keuangan lain-lain pada pengakuan awal diukur pada nilai wajar dan sesudah pengakuan awal diukur pada biaya perolehan diamortisasi, dengan\nmemperhitungkan dampak amortisasi (atau akresi) berdasarkan suku bunga efektif atas premi, diskonto dan biaya transaksi yang dapat diatribusikan secara langsung.\nGrup mengklasifikasikan utang klaim, utang reasuransi, utang komisi dan utang lain-lain dalam kategori ini.",
    "RevenueAndExpenseRecognitionTextBlock": "Premi dari kontrak asuransi jangka pendek diakui sebagai pendapatan sesuai periode polis (kontrak) berdasarkan proporsi jumlah proteksi yang diberikan. Premi selain kontrak asuransi jangka pendek diakui sebagai pendapatan pada saat jatuh tempo.\nPendapatan premi disajikan sebagai premi bruto dalam laporan laba rugi dan penghasilan komprehensif lain konsolidasian.\nUntuk mengurangi resiko penutupan polis asuransi, Grup mereasuransikan sebagian risiko polis yang ditutupnya ke perusahaan reasuradur dan tidak mengakui ganti rugi atas klaim asuransi yang menjadi tanggungan perusahaan reasuradur. Jika perusahaan reasuradur tidak dapat memenuhi kewajibannya berdasarkan perjanjian reasuransi, maka Grup memiliki liabilitas kontinjensi atas seluruh klaim tersebut. Perjanjian reasuransi yang dimiliki Grup meliputi perjanjian reasuransi treaty proporsional dan non proporsional (excess of loss) , maupun perjanjian reasuransi fakultatif.\nBeban klaim merupakan klaim bruto dikurangi klaim reasuransi serta ditambah kenaikan atau dikurangi penurunan estimasi klaim retensi sendiri. Beban penyelesaian klaim diakui sebagai beban klaim pada saat timbulnya liabilitas untuk memenuhi klaim. Hak subrogasi diakui sebagai pengurang beban klaim pada saat realisasi.\nBiaya penerbitan polis, seperti insentif dan beban underwriting lainnya dibebankan pada laporan laba rugi konsolidasian tahun berjalan pada saat terjadinya.\nKomisi tanggungan sendiri merupakan selisih komisi yang dikeluarkan untuk mendapatkan penutupan pertanggungan dengan komisi yang diterima dari reasuradur. Komisi diakui sesuai dengan pengakuan pendapatan premi. Komisi yang diperoleh dari transaksi reasuransi diakui pada saat terjadinya dan dicatat sebagai pengurang beban komisi.",
    "ForeignCurrencyTranslationTextBlock": "Pembukuan Grup diselenggarakan dalam mata uang Rupiah. Transaksi dalam mata uang asing dibukukan dengan menggunakan kurs pada saat terjadinya transaksi.\nLaba atau rugi kurs yang timbul akibat penjabaran pos aset dan liabilitas moneter dalam mata uang asing dikreditkan atau dibebankan pada laporan laba rugi dan penghasilan komprehensif lain konsolidasian berjalan.\nPada tanggal laporan posisi keuangan konsolidasian, pos aset dan liabilitas dalam mata uang asing dilaporkan ke dalam mata uang Rupiah dengan mempergunakan kurs tengah Bank Indonesia pada tanggal tersebut, yaitu sebagai berikut (nilai penuh): \n1 (satu) Poundsterling Inggris  21.417\n1 (satu) Euro                                     17.893\n1 (satu) Dolar AS                             16.588\n1 (satu) Dolar Australia                10.481\n1 (satu) Dolar Singapura              12.406\n1 (satu) Ringgit Malaysia                3.745\n1 (satu) Dolar Hong Kong               2.134\n1 (satu) Peso Filipina                          287\n1 (satu) Yen Jepang                             110\n1 (satu) Yuan China                           2.284\n1 (satu) Krona Swedia                      1.650\n1 (satu) Won Korea Selatan                11",
    "TransactionsWithRelatedPartiesTextBlock": "Suatu pihak dianggap pihak berelasi dengan Grup jika:\na. Orang atau anggota keluarga terdekat mempunyai relasi dengan Grup jika orang tersebut:\n     i. memiliki pengendalian atau pengendalian bersama atas Grup;\n    ii. memiliki pengaruh signifikan atas Grup; atau\n    iii. personil manajemen kunci Grup atau entitas induk Perusahaan.\nb. Suatu entitas berelasi dengan Grup jika memenuhi salah satu hal berikut:\n    i. Entitas dan Grup adalah anggota kelompok usaha yang sama (artinya entitas induk, entitas anak, dan entitas anak berikutnya terkait dengan entitas lain).\n   ii. Suatu entitas adalah entitas asosiasi atau ventura bersama dari entitas lain (atau entitas asosiasi atau entitas ventura bersama yang merupakan anggota suatu kelompok usaha, yang mana entitas lain tersebut adalah anggotanya).\n  iii. Kedua entitas tersebut adalah ventura bersama dari pihak ketiga yang sama.\n  iv. Suatu entitas adalah ventura bersama dari entitas ketiga dan entitas yang lain adalah entitas asosiasi dari entitas ketiga.\n   v. Entitas tersebut adalah suatu program imbalan pasca kerja untuk imbalan kerja dari salah satu Grup atau entitas yang terkait dengan Grup. Jika Grup adalah entitas yang menyelenggarakan program tersebut, maka entitas sponsor juga berelasi dengan Grup.\n  vi. Entitas yang dikendalikan atau dikendalikan bersama oleh orang yang diidentifikasi dalam huruf (a).\n  vii. Orang yang diidentifikasi dalam huruf (a) (i) memiliki pengaruh signifikan atas entitas atau personil manajemen kunci entitas (atau entitas induk dari entitas).\nSeluruh transaksi yang dilakukan dengan pihak-pihak berelasi, baik dilakukan dengan kondisi dan persyaratan dengan pihak ketiga maupun tidak, diungkapkan pada laporan keuangan konsolidasian.",
    "IncomeTaxesTextBlock": "Beban pajak penghasilan terdiri dari pajak penghasilan kini dan pajak penghasilan tangguhan. Pajak tersebut diakui dalam laporan laba rugi konsolidasian, kecuali apabila pajak tersebut terkait dengan transaksi atau kejadian yang langsung diakui ke ekuitas dan laba komprehensif lainnya.\nPajak penghasilan kini dihitung dengan menggunakan tarif pajak yang berlaku pada tanggal posisi keuangan.\nPajak penghasilan tangguhan diakui dengan menggunakan balance sheet liability method , untuk semua perbedaan temporer antara dasar pengenaan pajak atas aset dan liabilitas dengan nilai tercatatnya untuk masing-masing entitas.\nPajak tangguhan diukur dengan menggunakan tarif pajak yang berlaku atau yang telah secara substantif berlaku pada tanggal laporan posisi keuangan konsolidasian dan yang akan digunakan pada saat aset pajak tangguhan dipulihkan atau liabilitas pajak tangguhan dilunasi.",
    "EmployeeBenefitsTextBlock": "a. Imbalan kerja jangka pendek \nImbalan kerja jangka pendek diakui pada saat terutang kepada karyawan.\nb. Imbalan pascakerja\nGrup menyediakan imbalan pensiun dengan jumlah minimal sesuai dengan undang-undang ketenagakerjaan yang berlaku atau Kontrak Kerja Bersama (), mana yang lebih tinggi. Karena Undang-Undang Ketenagakerjaan atau KKB menentukan rumus tertentu untuk menghitung jumlah minimal imbalan pensiun, pada dasarnya program pensiun berdasarkan Undang-Undang Ketenagakerjaan atau KKB adalah program pensiun imbalan pasti.\nKaryawan berhak atas manfaat pensiun dari dana pensiun yang meliputi kontribusi dana pensiun dan akumulasi bunganya, apabila karyawan tersebut pensiun, cacat, atau meninggal dunia.\nLiabilitas imbalan pasti dihitung oleh aktuaris independen dengan menggunakan metode Projected Unit Credit . Dalam menghitung imbalan pascakerja, aktuaris independen telah memperhitungkan juga kontribusi yang telah dilakukan oleh Perusahaan kepada PT Asuransi Jiwa Manulife Indonesia.\nNilai kini liabilitas imbalan pasti ditentukan dengan mendiskontokan estimasi arus kas keluar masa depan dengan menggunakan tingkat bunga Obligasi Pemerintah (dengan pertimbangan saat ini tidak ada pasar aktif untuk Obligasi korporasi berkualitas tinggi) dalam mata uang Rupiah, sama dengan mata uang dimana imbalan tersebut akan dibayarkan, dan yang memiliki jangka waktu yang mendekati jangka waktu liabilitas imbalan pensiun yang bersangkutan.\nBiaya jasa lalu diakui segera dalam laporan laba rugi.\nGrup mengakui keuntungan atau kerugian atas kurtailmen atau penyelesaian suatu program imbalan pasti ketika kurtailmen atau penyelesaian tersebut terjadi. Keuntungan atau kerugian atas kurtailmen atau penyelesaian terdiri dari perubahan yang terjadi dalam nilai kini kewajiban imbalan pasti. Keuntungan dan kerugian aktuarial yang timbul dari penyesuaian pengalaman dan perubahan asumsi aktuarial dibebankan atau dikreditkan pada ekuitas dalam laporan penghasilan komprehensif lain konsolidasian pada periode terjadinya.\nGrup menyelenggarakan program manfaat pesangon pemutusan kontrak kerja sesuai perjanjian kerja bersama.\nGrup tidak melakukan pendanaan sehubungan dengan program manfaat karyawan tersebut.",
    "EarningsPerShareTextBlock": "Laba bersih per saham dihitung dengan membagi masing-masing laba bersih dengan rata-rata tertimbang saham yang beredar selama tahun yang bersangkutan.\nLaba per saham dilusian dihitung dengan membagi laba bersih dengan rata-rata tertimbang jumlah saham yang beredar ditambah dengan rata-rata tertimbang jumlah saham yang akan diterbitkan atas konversi efek yang berpotensi saham yang bersifat dilutif.",
    "DividendsTextBlock": "Pada tahun 2024, Grup tidak membagikan dividen kas atas laba bersih tahun 2023.",
    "SegmentReportingTextBlock": "Segmen operasi adalah suatu komponen dari Grup:\na. Yang terlibat dalam aktivitas bisnis yang mana memperoleh pendapatan dan menimbulkan beban (termasuk pendapatan dan beban terkait dengan\ntransaksi dengan komponen lain dari entitas yang sama);\nb. Hasil operasinya dikaji ulang secara reguler oleh pengambil keputusan operasional untuk membuat keputusan tentang sumber daya yang dialokasikan pada segmen tersebut dan menilai kinerjanya; dan\nc. Tersedia informasi keuangan yang dapat dipisahkan.",
    "DerivativeFinancialInstrumentsTextBlock": "Aset keuangan diklasifikasikan dalam kelompok diperdagangkan jika diperoleh atau dimiliki terutama untuk tujuan dijual atau dibeli kembali di dalam waktu dekat atau jika merupakan bagian dari portfolio instrumen keuangan tertentu yang dikelola bersama dan terdapat bukti mengenai pola ambil untung dalam jangka pendek (short-term profit taking) yang terkini.\nDerivatif juga dikategorikan dalam kelompok diperdagangkan, kecuali derivatif yang ditetapkan dan efektif sebagai instrumen lindung nilai.\nKeuntungan atau kerugian yang timbul dari perubahan nilai wajar dan penjualan instrumen keuangan diakui dalam laporan laba rugi konsolidasian.",
    "TheImplementationOfNewStatementsOfAccountingStandardsTextBlock": "Penerapan dari standar dan interpretasi baru/revisi standar berikut yang berlaku efektif mulai 1 Januari 2024, tidak menimbulkan perubahan substansial terhadap kebijakan akuntansi Grup dan pengaruh yang material atas jumlah yang dilaporkan atas tahun berjalan atau tahun sebelumnya.",
    "BusinessCombinationTextBlock": "N/A",
    "DeterminationOfFairValueTextBlock": "Nilai wajar adalah harga yang akan diterima untuk menjual suatu aset atau harga yang akan dibayar untuk mengalihkan suatu liabilitas dalam transaksi teratur\nantara pelaku pasar pada tanggal pengukuran tanpa memperhatikan apakah harga tersebut dapat diobservasi secara langsung atau diestimasi menggunakan teknik\npenilaian lain. Dalam mengukur nilai wajar atas suatu aset atau liabilitas pada tanggal pengukuran, Grup memperhitungkan karakteristik suatu aset atau liabilitas\njika pelaku pasar akan memperhitungkan karakteristik tersebut ketika menentukan harga aset atau liabilitas pada tanggal pengukuran.\nGrup melakukan pengukuran nilai wajar atas instrumen keuangan yang dimiliki ke dalam 3 (tiga) tingkatan (level) hirarki nilai wajar.",
    "ForeignCurrencyTransactionsAndBalancesTextBlock": "Pembukuan Grup diselenggarakan dalam mata uang Rupiah. Transaksi dalam mata uang asing dibukukan dengan menggunakan kurs pada saat terjadinya transaksi.\nLaba atau rugi kurs yang timbul akibat penjabaran pos aset dan liabilitas moneter dalam mata uang asing dikreditkan atau dibebankan pada laporan laba rugi dan penghasilan komprehensif lain konsolidasian berjalan.\nPada tanggal laporan posisi keuangan konsolidasian, pos aset dan liabilitas dalam mata uang asing dilaporkan ke dalam mata uang Rupiah dengan mempergunakan kurs tengah Bank Indonesia pada tanggal tersebut, yaitu sebagai berikut (nilai penuh):\n1 (satu) Poundsterling Inggris  21.417\n1 (satu) Euro                                     17.893\n1 (satu) Dolar AS                             16.588\n1 (satu) Dolar Australia                10.481\n1 (satu) Dolar Singapura              12.406\n1 (satu) Ringgit Malaysia                3.745\n1 (satu) Dolar Hong Kong               2.134\n1 (satu) Peso Filipina                          287\n1 (satu) Yen Jepang                             110\n1 (satu) Yuan China                           2.284\n1 (satu) Krona Swedia                      1.650\n1 (satu) Won Korea Selatan                11",
    "SecuritiesTextBlock": "Grup memiliki investasi efek saham, reksa dana dan obligasi yang mempunyai harga kuotasi di pasar yang aktif dan diklasifikasikan dalam kategori aset keuangan tersedia untuk dijual.\nPenyertaan saham merupakan investasi dalam bentuk saham yang tidak melalui pasar modal untuk tujuan jangka panjang pada Grup. Grup memiliki pemilikan kurang dari 20% dari hak suara dan dicatat berdasarkan biaya perolehan (metode biaya) dikurangi penyisihan kerugian penurunan nilai. Penghasilan dari dividen diakui pada saat surat pemberitahuan pembagian dividen diterima.\nObligasi pemerintah yang dimiliki oleh Grup dikeluarkan oleh Republik Indonesia, dimana obligasi pemerintah Republik Indonesia dalam Rupiah tidak diperingkat. Sedangkan obligasi pemerintah Republik Indonesia dalam Dolar A.S.\ndirating BBB oleh Fitch pada tanggal akhir tahun pelaporan.\nSeluruh peringkat obligasi korporasi berdasarkan Pemeringkat Efek Indonesia (Pefindo) dan Fitch ratings.\nNilai wajar untuk surat-surat berharga dan obligasi tersedia untuk dijual ditetapkan berdasarkan harga pasar atau harga kuotasi perantara (broker) /pedagang efek (dealer) dan Penilai Harga Efek Indonesia (IBPA).",
    "ShorttermInvestmentTextBlock": "Nilai wajar efek didasarkan pada harga pasar. Apabila informasi tidak tersedia, nilai wajar telah diestimasi dengan menggunakan harga pasar yang berlaku untuk sekuritas yang serupa, jatuh tempo kredit dan karakteristik hasil (yield).\nNilai tercatat investasi berupa deposito berjangka, kas dan setara kas, piutang premi, piutang reasuransi, uang muka klaim, piutang lain-lain, piutang pegawai, utang klaim, utang reasuransi, utang komisi, dan utang lain-lain kurang lebih sama dengan besar nilai wajarnya karena aset dan liabilitas keuangan tersebut berjangka pendek.",
    "RightOfUseAssetsTextBlock": "Pada tanggal permulaan sewa, Perusahaan mengakui aset hak guna dan liabilitas sewa. Aset hak guna diukur pada biaya perolehan, dimana meliputi jumlah pengukuran awal liabilitas sewa yang disesuaikan dengan pembayaran sewa yang dilakukan pada atau sebelum tanggal permulaan, ditambah dengan biaya langsung awal yang dikeluarkan dan estimasi biaya yang akan dikeluarkan untuk membongkar dan memindahkan aset pendasar atau untuk merestorasi aset pendasar ke kondisi yang disyaratkan dan ketentuan sewa, dikurangi dengan insentif sewa yang diterima.\nAset hak-guna kemudian disusutkan menggunakan metode garis lurus dari tanggal permulaan hingga tanggal yang lebih awal antara akhir umur manfaat aset hak-guna atau akhir masa sewa. Selain itu, aset hak-guna secara berkala dinilai untuk penurunan nilai dan disesuaikan atas pengukuran kembali dari liabilitas sewa.\nKetika liabilitas sewa diukur kembali dengan cara tersebut, penyesuaian dilakukan terhadap jumlah tercatat dari aset hak-guna, atau diakui dalam laba rugi jika jumlah tercatat dari aset hak-guna telah dikurangi menjadi nol.\nPerusahaan menyajikan aset hak-guna yang tidak memenuhi definisi properti investasi sebagai aset tetap dan liabilitas sewa dalam laporan posisi keuangan.\nPerusahaan memutuskan untuk tidak mengakui aset hak guna dan liabilitas sewa untuk sewa jangka-pendek yang memiliki masa sewa 12 bulan atau kurang. Perusahaan mengakui pembayaran sewa atas sewa tersebut sebagai beban dengan dasar garis lurus selama masa sewa.",
    "InvestmentPropertiesTextBlock": "Penilai independen eksternal yang memiliki kualifikasi profesional serta berpengalaman dalam lokasi dan kategori properti yang dinilai. Nilai wajar diukur\nberdasarkan pada nilai pasar, dimana nilai tersebut diasumsikan dari jumlah nilai properti yang dapat dipertukarkan pada tanggal penilaian antara pihak pembeli dan penjual yang berkeinginan melalui transaksi yang wajar (arm length transaction ) setelah kegiatan pemasaran yang layak dimana kedua belah pihak tersebut memiliki pengetahuan yang memadai. Apabila tidak tersedia harga terkini dalam pasar aktif, penilaian dibuat dengan mempertimbangkan teknik penilaian lainnya.\nDasar pengukuran dalam penyusunan laporan keuangan konsolidasian untuk properti investasi adalah dinyatakan sebesar hasil penilaian kembali.",
    "GoodwillTextBlock": "Selisih lebih imbalan yang dialihkan, jumlah kepentingan non-pengendali pada pihak yang diakuisisi serta nilai wajar pada tanggal akuisisi kepentingan ekuitas yang dimiliki sebelumnya, terhadap bagian kepemilikan Perusahaan atas nilai wajar aset neto teridentifikasi yang diakuisisi, dicatat sebagai goodwill.\nDidalam investasi Grup atas entitas asosiasi termasuk goodwill yang diidentifikasi ketika akuisisi.\nRugi penurunan nilai aset atas goodwill tidak dapat dipulihkan.",
    "InvestmentInAssociatesTextBlock": "Entitas asosiasi adalah seluruh entitas dimana Grup memiliki pengaruh signifikan namun bukan pengendalian, biasanya melalui kepemilikan hak suara antara 20% dan\n50%. Investasi entitas asosiasi dicatat dengan metode ekuitas. Sesuai metode ekuitas, investasi pada awalnya dicatat pada biaya, dan nilai tercatat akan meningkat atau menurun untuk mengakui bagian investor atas laba rugi. Di dalam investasi Grup atas entitas asosiasi termasuk goodwill yang diidentifikasi ketika akuisisi.\nBagian Grup atas laba atau rugi entitas asosiasi pasca akuisisi diakui dalam laporan laba rugi dan bagian atas mutasi pendapatan komprehensif lainnya pasca akuisisi\ndiakui di dalam pendapatan komprehensif lainnya dan diikuti dengan penyesuaian pada jumlah tercatat investasi. Dividen yang akan diterima dari entitas asosiasi diakui sebagai pengurang jumlah tercatat investasi. Jika bagian Grup atas kerugian entitas asosiasi sama dengan atau melebihi kepentingannya pada entitas asosiasi, termasuk piutang tanpa agunan, Grup menghentikan pengakuan bagian kerugiannya, kecuali Grup memiliki kewajiban atau melakukan pembayaran atas nama entitas asosiasi.\nPada setiap tanggal pelaporan, Grup menentukan apakah terdapat bukti objektif bahwa telah terjadi penurunan nilai pada investasi pada entitas asosiasi. Jika demikian, maka\nGrup menghitung besarnya penurunan nilai sebagai selisih antara jumlah yang terpulihkan dan nilai tercatat atas investasi pada perusahaan asosiasi dan mengakui selisih tersebut pada  atas Hasil Bersih Entitas Asosiasi di laporan laba rugi. Kerugian yang belum direalisasi juga dieliminasi kecuali transaksi tersebut memberikan bukti penurunan nilai atas aset yang ditransfer. Kebijakan akuntansi entitas asosiasi disesuaikan jika diperlukan untuk memastikan konsistensi dengan kebijakan yang diterapkan oleh Grup.",
    "IntangibleAssetsTextBlock": "N/A",
    "PrepaidExpensesTextBlock": "Biaya dibayar di muka dibebankan sesuai dengan masa manfaat masing-masing biaya dengan menggunakan metode garis lurus.",
    "InsuranceReceivablesAndPayablesTextBlock": "Aset keuangan dikategorikan sebagai pinjaman yang diberikan dan piutang terdiri dari deposito berjangka, kas dan setara kas, piutang premi, piutang reasuransi, uang muka klaim, piutang lain-lain dan piutang pihak-pihak berelasi di dalam laporan posisi keuangan konsolidasian.\nPinjaman yang diberikan dan piutang adalah aset keuangan non-derivatif dengan pembayaran tetap atau telah ditentukan yang tidak mempunyai kuotasi di pasar\naktif. Setelah pengakuan awal diukur pada biaya perolehan diamortisasi dengan menggunakan metode suku bunga efektif, setelah dikurangi penyisihan untuk\npenurunan nilai.\nPiutang premi dinyatakan sebesar jumlah bruto.\nPiutang premi yang diakui sebagai aset yang diperkenankan dalam menghitung solvabilitas adalah piutang premi yang berumur kurang dari 2 bulan (60 hari).\nPiutang lain-lain merupakan piutang pegawai, piutang salvage klaim, piutang aso dan uang muka biaya pemasaran.",
    "ConsumerFinancingReceivablesTextBlock": "N/A",
    "ContractLiabilitiesTextBlock": "Liabilitas kontrak asuransi adalah nilai liabilitas asuradur dalam suatu kontrak asuransi. Yang termasuk didalam liabilitas kontrak asuransi adalah:\na. Estimasi Liabilitas Klaim\nEstimasi liabilitas klaim merupakan estimasi jumlah liabilitas yang menjadi tanggungan sehubungan dengan klaim yang masih dalam proses penyelesaian dan klaim yang terjadi namun belum dilaporkan (IBNR). Perubahan jumlah estimasi liabilitas klaim, sebagai akibat proses penelaahan lebih lanjut dan perbedaan antara jumlah estimasi klaim dengan klaim yang dibayarkan diakui dalam laba rugi pada periode terjadinya perubahan. Grup tidak mengakui setiap provisi untuk kemungkinan klaim masa depan sebagai liabilitas jika klaim tersebut timbul berdasarkan kontrak asuransi yang tidak ada pada akhir periode pelaporan (seperti cadangan atas bencana dan provisi penyetaraan).\nEstimasi pemulihan klaim dari reasuransi disajikan secara terpisah dalam akun aset reasuransi.\nCadangan atas klaim IBNR dibentuk dengan menggunakan data historis pengalaman klaim yang diproyeksikan untuk memperoleh perkiraan biaya dari klaim yang sudah terjadi tetapi belum dilaporkan.\nb. Liabilitas Premi\nPSAK 28 (Revisi 2012), setelah merujuk ke PSAK No. 36 (Revisi 2012), mengatur liabilitas asuransi kontrak asuransi yang berjangka waktu lebih dari satu tahun\ndiukur dengan menggunakan salah satu dari:\n  i. Konsep nilai kini estimasi pembayaran seluruh manfaat yang diperjanjikan termasuk seluruh opsi yang disediakan ditambah dengan nilai kini estimasi seluruh biaya yang akan dikeluarkan dan juga mempertimbangkan penerimaan premi di\nmasa depan.\nii. Kebijakan akuntansi sebelumnya.",
    "DepositsFromCustomersAndDepositsFromOtherBanksTextBlock": "N/A",
    "SubordinatedBondsTextBlock": "N/A",
    "SecuritiesPurchasedUnderResellAgreementsTextBlock": "N/A",
    "TreasuryStockTextBlock": "N/A",
    "ShareCapitalTextBlock": "Pada tanggal 31 Maret 2025 dan 31 Desember 2024 kepemilikan saham Oona Indonesia Pte.Ltd sebanyak 538.582.804 lembar saham (setara dengan 86,76% kepemilikan) dan 588.313.138 lembar saham (setara dengan 94,77% kepemilikan).",
    "SharebasedPaymentArrangementTextBlock": "N/A",
    "StockIssuanceCostTextBlock": "Biaya-biaya emisi efek yang terjadi sehubungan dengan penawaran saham kepada masyarakat (termasuk penerbitan hak memesan efek terlebih dahulu) dikurangkan langsung dari hasil emisi dan disajikan sebagai pengurang pada akun  Modal Disetor - Bersih sebagai bagian dari Ekuitas pada laporan posisi keuangan konsolidasian.",
    "FinancialInstrumentsTextBlock": "Aset keuangan diklasifikasikan dalam kelompok diperdagangkan jika diperoleh atau dimiliki terutama untuk tujuan dijual atau dibeli kembali di dalam waktu dekat atau jika merupakan bagian dari portfolio instrumen keuangan tertentu yang dikelola bersama\ndan terdapat bukti mengenai pola ambil untung dalam jangka pendek (short-term profit taking) yang terkini.\nKeuntungan atau kerugian yang timbul dari perubahan nilai wajar dan penjualan instrumen keuangan diakui dalam laporan laba rugi konsolidasian.",
    "NoncurrentAssetsClassifiedAsHeldForSaleTextBlock": "N/A",
    "EventsAfterReportingPeriodTextBlock": "N/A",
    "AdoptionOfNewAccountingStandardsTextBlock": "Penerapan dari standar dan interpretasi baru/revisi standar berikut yang berlaku efektif mulai 1 Januari 2024, tidak menimbulkan perubahan substansial terhadap kebijakan akuntansi Grup dan pengaruh yang material atas jumlah yang dilaporkan atas tahun berjalan atau tahun sebelumnya.",
    "AccountingStandardsIssuedButNotYetEffectiveTextBlock": "Standar, perubahan dan interpretasi yang berlaku efektif mulai tanggal 1 Januari 2024\nStandar baru dan amendemen standar yang telah diterbitkan dan relevan bagi Perseroan, yang wajib diterapkan untuk tahun buku yang dimulai pada atau setelah tanggal 1 Januari 2024 dan belum diterapkan secara dini oleh Perseroan. \n- Amendemen PSAK 57  Liabilitas Kontinjensi, dan Aset Kontinjensi tentang Kontrak Memberatkan Memenuhi Kontrak\n- Penyesuaian tahunan atas PSAK 71  Keuangan\n- Penyesuaian tahunan atas PSAK 73 \nStandar, perubahan dan Interprestasi yang sudah diterbitkan tetapi belum berlaku efektif\nStandar baru dan amendemen standar yang telah diterbitkan dan relevan bagi Perseroan, yang wajib diterapkan untuk tahun buku yang dimulai pada atau\nsetelah tanggal 1 Januari 2023 dan belum diterapkan secara dini oleh Perseroan, adalah sebagai berikut:\n- Amendemen PSAK 1  Laporan Keuangan Tentang Pengungkapan Kebijakan Akuntansi\n- Amendemen PSAK 1  Laporan Keuangan tentang Klasifikasi Liabilitas sebagai Jangka Pendek atau Jangka Panjang\n- Amendemen PSAK 16  Tetap tentang hasil sebelum penggunaan yang diintensikan\n- Amendemen PSAK 25  Akuntansi, Perubahan Estimasi Akuntansi dan Kesalahan tentang definisi estimasi akuntansi\n- Amendemen PSAK 46  Penghasilan: Pajak Tangguhan Terkait Aset dan Kewajiban yang Timbul dari Satu Transaksi\nSampai dengan tanggal pengesahan laporan keuangan konsolidasian ini, manajemen masih mempelajari dampak yang mungkin timbul dari penerapan standar baru dan revisi tersebut serta pengaruhnya pada laporan keuangan konsolidasian.",
    "ConsumerFinancingLiabilitiesTextBlock": "N/A",
    "AdditionInPropertyPlantAndEquipment": "10371534000",
    "DisposalsInPropertyPlantAndEquipment": "3675550000",
    "ReclassificationsOfPropertyPlantAndEquipment": "115158000",
    "DisclosureofNotesforPropertyPlantandEquipmentTextBlock": "Awalnya suatu aset tetap diukur sebesar biaya perolehan, yang terdiri dari harga perolehannya dan biaya-biaya yang dapat diatribusikan secara langsung untuk membawa aset ke lokasi dan kondisi yang diinginkan agar aset siap digunakan sesuai dengan keinginan dan maksud manajemen, serta estimasi awal biaya pembongkaran dan pemindahan aset tetap dan restorasi lokasi aset. \nBiaya-biaya setelah perolehan awal seperti penggantian komponen dan inspeksi yang signifikan, diakui dalam jumlah tercatat aset tetap jika besar kemungkinan manfaat ekonomis di masa depan akan mengalir ke Grup dan biaya tersebut dapat diukur secara andal. Sisa jumlah tercatat biaya komponen yang diganti atau biaya inspeksi terdahulu dihentikan pengakuannya. Biaya perawatan sehari-hari aset tetap diakui sebagai beban pada saat terjadinya. \nPenyusutan diakui dengan menggunakan metode garis lurus untuk menyusutkan nilai aset tetap, kecuali tanah.\nEstimasi masa manfaat aset tetap adalah sebagai berikut: \n                                            Tahun\nBangunan                            20\nKendaraan bermotor         5\nPeralatan kantor                 5\nPerlengkapan kantor          3\nPeralatan bengkel               5\n\nNilai residu, umur manfaat dan metode penyusutan di review setiap akhir periode pelaporan untuk memastikan nilai residu, umur manfaat dan metode depresiasi\nditerapkan secara konsisten sesuai dengan ekspektasi pola manfaat ekonomis dari aset tersebut.\nKetika suatu aset dilepaskan atau tidak ada manfaat ekonomis masa depan yang diharapkan dari penggunaan atau pelepasannya, biaya perolehan dan akumulasi\npenyusutan dan akumulasi rugi penurunan nilai, jika ada, dikeluarkan dari akun tersebut. Laba atau rugi yang timbul dari penghentian pengakuan aset tetap akan dimasukkan dalam laporan laba rugi dan penghasilan komprehensif lain konsolidasian.\nGrup memilih untuk menerapkan model biaya, sehingga aset tetap Grup dicatat sebesar biaya perolehan dikurangi akumulasi penyusutan dan akumulasi rugi penurunan nilai aset, jika ada."
  }
}